stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
typedef struct                                  /*!< SPI Structure                                                             */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SR;                           /*!< (@ 0x00000008) Status register                                            */
  __IO uint32_t  DR;                           /*!< (@ 0x0000000C) Data register                                              */
  __IO uint32_t  CRCPR;                        /*!< (@ 0x00000010) CRC polynomial register                                    */
  __IO uint32_t  RXCRCR;                       /*!< (@ 0x00000014) RX CRC register                                            */
  __IO uint32_t  TXCRCR;                       /*!< (@ 0x00000018) TX CRC register                                            */
  __IO uint32_t  I2SCFGR;                      /*!< (@ 0x0000001C) I2S configuration register                                 */
  __IO uint32_t  I2SPR;                        /*!< (@ 0x00000020) I2S prescaler register                                     */
} SPI_TypeDef;                                  /*!< Size = 36 (0x24)                                                          */


/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct                                  /*!< RCC Structure                                                             */
{
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Clock control register                                     */
  __IO uint32_t  ICSCR;                        /*!< (@ 0x00000004) Internal clock sources calibration register                */
  __IO uint32_t  CFGR;                         /*!< (@ 0x00000008) Clock configuration register                               */
  __IO uint32_t  CSSWCR;                       /*!< (@ 0x0000000C) Clocks Sources Software Calibration register               */
  __IO uint32_t  RESERVED[2];
  __IO uint32_t  CIER;                         /*!< (@ 0x00000018) Clock interrupt enable register                            */
  __IO uint32_t  CIFR;                         /*!< (@ 0x0000001C) Clock interrupt flag register                              */
  __IO uint32_t  CSCMDR;                       /*!< (@ 0x00000020) Clock Switch Command register                              */
  __IO uint32_t  RESERVED1[3];
  __IO uint32_t  AHBRSTR;                      /*!< (@ 0x00000030) AHB0 macro cells reset register                            */
  __IO uint32_t  APB0RSTR;                     /*!< (@ 0x00000034) APB0 macro cells reset register                            */
  __IO uint32_t  APB1RSTR;                     /*!< (@ 0x00000038) APB1 peripheral reset register 1                           */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  APB2RSTR;                     /*!< (@ 0x00000040) APB2 peripheral reset register 2                           */
  __IO uint32_t  RESERVED3[3];
  __IO uint32_t  AHBENR;                       /*!< (@ 0x00000050) AHB0 macro cells clock enable register                     */
  __IO uint32_t  APB0ENR;                      /*!< (@ 0x00000054) APB0 macro cells clock enable register                     */
  __IO uint32_t  APB1ENR;                      /*!< (@ 0x00000058) APB1ENR1                                                   */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  APB2ENR;                      /*!< (@ 0x00000060) APB2ENR                                                    */
  __IO uint32_t  RESERVED5[12];
  __IO uint32_t  CSR;                          /*!< (@ 0x00000094) CSR                                                        */
  __IO uint32_t  RFSWHSECR;                    /*!< (@ 0x00000098) RF Software High Speed External register                   */
  __IO uint32_t  RFHSECR;                      /*!< (@ 0x0000009C) RF High Speed External register                            */
} RCC_TypeDef;                                  /*!< Size = 160 (0xA0)                                                         */


/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct                                  /*!< PWR Structure                                                             */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Power control register 1                                   */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Power control register 2                                   */
  __IO uint32_t  CR3;                          /*!< (@ 0x00000008) Power control register 3                                   */
  __IO uint32_t  CR4;                          /*!< (@ 0x0000000C) Power control register 4                                   */
  __IO uint32_t  SR1;                          /*!< (@ 0x00000010) Power status register 1                                    */
  __IO uint32_t  SR2;                          /*!< (@ 0x00000014) Power status register 2                                    */
  __IO uint32_t  RESERVED;
  __IO uint32_t  CR5;                          /*!< (@ 0x0000001C) Power control register 5                                   */
  __IO uint32_t  PUCRA;                        /*!< (@ 0x00000020) Power Port A pull-up control register                      */
  __IO uint32_t  PDCRA;                        /*!< (@ 0x00000024) Power Port A pull-down control register                    */
  __IO uint32_t  PUCRB;                        /*!< (@ 0x00000028) Power Port B pull-up control register                      */
  __IO uint32_t  PDCRB;                        /*!< (@ 0x0000002C) Power Port B pull-down control register                    */
  __IO uint32_t  CR6;                          /*!< (@ 0x00000030) Power control register 6                                   */
  __IO uint32_t  CR7;                          /*!< (@ 0x00000034) Power control register 7                                   */
  __IO uint32_t  SR3;                          /*!< (@ 0x00000038) Power status register 3                                    */
  __IO uint32_t  RESERVED1;
  __IO uint32_t  IOxCFG;                       /*!< (@ 0x00000040) IO DEEPSTOP drive configuration register                   */
  __IO uint32_t  RESERVED2[16];
  __IO uint32_t  DBGR;                         /*!< (@ 0x00000084) Debug register                                             */
  __IO uint32_t  EXTSRR;                       /*!< (@ 0x00000088) Power status clear register                                */
  __IO uint32_t  DBGSMPS;                      /*!< (@ 0x0000008C) This register drives some control signals for
                                                                    the SMPS                                                   */
  __IO uint32_t  TRIMR;                        /*!< (@ 0x00000090) This register provides the trimming values applied
                                                                    by hardware according to the trimmingdone
                                                                    at EWS.                                                    */
  __IO uint32_t  ENGTRIM;                      /*!< (@ 0x00000094) This register allows the software overloading
                                                                    the hardware trimming flashed at EWS.                      */
  __IO uint32_t  DBG1;                         /*!< (@ 0x00000098) This register shows the current states of the
                                                                    FLASH FSM and SMPS FSM.                                    */
  __IO uint32_t  DBG2;                         /*!< (@ 0x0000009C) This register shows the current states of the
                                                                    FLASH FSM and SMPS FSM.                                    */
} PWR_TypeDef;                                  /*!< Size = 160 (0xA0)                                                         */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct                                  /*!< SYSCFG Structure                                                          */
{
  __IO uint32_t  DIE_ID;                       /*!< (@ 0x00000000) This register provides the device version and
                                                                    cut information.                                           */
  __IO uint32_t  JTAG_ID;                      /*!< (@ 0x00000004) This register provides the JTAG ID of the stm32wb07.       */
  __IO uint32_t  I2C_FMP_CTRL;                 /*!< (@ 0x00000008) This register allows activating the Fast-mode
                                                                    Plus driving capability on I2C open-drain
                                                                    pads.                                                      */
  __IO uint32_t  IO_DTR;                       /*!< (@ 0x0000000C) IO_DTR                                                     */
  __IO uint32_t  IO_IBER;                      /*!< (@ 0x00000010) IO_IBER                                                    */
  __IO uint32_t  IO_IEVR;                      /*!< (@ 0x00000014) I/O Interrupt polarity event register                      */
  __IO uint32_t  IO_IER;                       /*!< (@ 0x00000018) I/O Interrupt Enable register                              */
  __IO uint32_t  IO_ISCR;                      /*!< (@ 0x0000001C) I/O Interrupt Status and Clear register                    */
  __IO uint32_t  PWRC_IER;                     /*!< (@ 0x00000020) This register allows control of the enable or
                                                                    mask on the interrupt sources of the Power
                                                                    Controller (PWRC) block.                                   */
  __IO uint32_t  PWRC_ISCR;                    /*!< (@ 0x00000024) Power Controller Interrupt Status and Clear register       */
  __IO uint32_t  RESERVED;                     /*!< (@ 0x00000028)                                                            */
  __IO uint32_t  BLERXTX_DTR;                  /*!< (@ 0x0000002C) MR_BLE RX or TX sequence information
                                                                    detection type register                                    */
  __IO uint32_t  BLERXTX_IBER;                 /*!< (@ 0x00000030) MR_BLE RX or TX sequence information
                                                                    detection type register                                    */
  __IO uint32_t  BLERXTX_IEVR;                 /*!< (@ 0x00000034) MR_BLE RX or TX sequence information
                                                                    detection event register                                   */
  __IO uint32_t  BLERXTX_IER;                  /*!< (@ 0x00000038) MR_BLE RX or TX Interrupt Enable Register                  */
  __IO uint32_t  BLERXTX_ISCR;                 /*!< (@ 0x0000003C) MR_BLE RX or TX sequence information detection
                                                                    status and clear register                                  */
} SYSCFG_TypeDef;                               /*!< Size = 64 (0x40)                                                          */


/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct                                  /*!< RNG Structure                                                             */
{
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IO uint32_t  SR;                           /*!< (@ 0x00000004) Status register                                            */
  __IO uint32_t  VAL;                          /*!< (@ 0x00000008) Data register                                              */
} RNG_TypeDef;                                  /*!< Size = 12 (0xC)                                                           */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIO)
  */

typedef struct                                  /*!< GPIO Structure                                                            */
{
  __IO uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IO uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IO uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IO uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IO uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IO uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __IO uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IO uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IO uint32_t  AFR[2];                       /*!< (@ 0x00000020) GPIO alternate function register                           */
  __IO uint32_t  BRR;                          /*!< (@ 0x00000028) GPIO bit reset register                                    */
} GPIO_TypeDef;                                 /*!< Size = 44 (0x2C)                                                          */


/* =========================================================================================================================== */
/* ================                                            TIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM)
  */

typedef struct                                  /*!< TIM Structure                                                             */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  SMCR;                         /*!< (@ 0x00000008) Slave mode control register                                */
  __IO uint32_t  DIER;                         /*!< (@ 0x0000000C) Interrupt enable register                              */
  __IO uint32_t  SR;                           /*!< (@ 0x00000010) Status register                                            */
  __IO uint32_t  EGR;                          /*!< (@ 0x00000014) Event generation register                                  */
  __IO uint32_t  CCMR1;                        /*!< (@ 0x00000018) Input capture and output compare mode register 1           */
  __IO uint32_t  CCMR2;                        /*!< (@ 0x0000001C) Input capture and output compare mode register 2           */
  __IO uint32_t  CCER;                         /*!< (@ 0x00000020) Capture/compare enable register                            */
  __IO uint32_t  CNT;                          /*!< (@ 0x00000024) Counter                                                    */
  __IO uint32_t  PSC;                          /*!< (@ 0x00000028) Prescaler                                                  */
  __IO uint32_t  ARR;                          /*!< (@ 0x0000002C) Auto-reload register                                       */
  __IO uint32_t  RCR;                          /*!< (@ 0x00000030) Repetition counter register                                */
  __IO uint32_t  CCR1;                         /*!< (@ 0x00000034) Capture/compare register 1                                 */
  __IO uint32_t  CCR2;                         /*!< (@ 0x00000038) Capture/compare register 2                                 */
  __IO uint32_t  CCR3;                         /*!< (@ 0x0000003C) Capture/compare register 3                                 */
  __IO uint32_t  CCR4;                         /*!< (@ 0x00000040) Capture/compare register 4                                 */
  __IO uint32_t  BDTR;                         /*!< (@ 0x00000044) Break and dead-time register                               */
  __IO uint32_t  RESERVED[3];
  __IO uint32_t  CCMR3;                        /*!< (@ 0x00000054) Output compare mode register 3                             */
  __IO uint32_t  CCR5;                         /*!< (@ 0x00000058) Capture/compare register 4                                 */
  __IO uint32_t  CCR6;                         /*!< (@ 0x0000005C) Capture/compare register 4                                 */
  __IO uint32_t  AF1;                          /*!< (@ 0x00000060) TIM1 alternate function option register 1                  */
  __IO uint32_t  AF2;                          /*!< (@ 0x00000064) TIM1 alternate function option register 2                  */
} TIM_TypeDef;                                  /*!< Size = 104 (0x68)                                                         */


/* =========================================================================================================================== */
/* ================                                           USART                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver transmitter (USART)
  */

typedef struct                                  /*!< USART Structure                                                           */
{
  __IO uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IO uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IO uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IO uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IO uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IO uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __IO uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __IO uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IO uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IO uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IO uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} USART_TypeDef;                                /*!< Size = 48 (0x30)                                                          */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

