stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
typedef struct                                  /*!<  RRM structure                                                            */
{
  __IO  uint32_t  RRM_ID;            /*!<  (@ 0x00) RRM_ID register                                                 */
  __IO uint32_t  RRM_CTRL;           /*!<  (@ 0x04) RRM_CTRL register                                               */
  __IO  uint32_t  RESERVED[2];
  __IO uint32_t  UDRA_CTRL0;           /*!<  (@ 0x10) UDRA_CTRL0 register                                             */
  __IO uint32_t  UDRA_IRQ_ENABLE;    /*!<  (@ 0x14) UDRA_IRQ_ENABLE register                                        */
  __IO uint32_t  UDRA_IRQ_STATUS;    /*!<  (@ 0x18) UDRA_IRQ_STATUS register                                        */
  __IO  uint32_t  UDRA_RADIO_CFG_PTR;    /*!<  (@ 0x1C) UDRA_RADIO_CFG_PTR register                                     */
  __IO uint32_t  SEMA_IRQ_ENABLE;    /*!<  (@ 0x20) SEMA_IRQ_ENABLE register                                        */
  __IO  uint32_t  SEMA_IRQ_STATUS;   /*!<  (@ 0x24) SEMA_IRQ_STATUS register                                        */
  __IO uint32_t  BLE_IRQ_ENABLE;   /*!<  (@ 0x28) BLE_IRQ_ENABLE register                                         */
  __IO uint32_t  BLE_IRQ_STATUS;   /*!<  (@ 0x2C) BLE_IRQ_STATUS register                                         */
  __IO  uint32_t  RESERVED1[12];
  __IO uint32_t  VP_CPU_CMD_BUS;   /*!<  (@ 0x60) VP_CPU_CMD_BUS register                                         */
  __IO uint32_t  VP_CPU_SEMA_BUS;    /*!<  (@ 0x64) VP_CPU_SEMA_BUS register                                        */
  __IO uint32_t  VP_CPU_IRQ_ENABLE;    /*!<  (@ 0x68) VP_CPU_IRQ_ENABLE register                                      */
  __IO uint32_t  VP_CPU_IRQ_STATUS;    /*!<  (@ 0x6C) VP_CPU_IRQ_STATUS register                                      */
  __IO  uint32_t  RESERVED2[36];
  __IO uint32_t  AA0_DIG_USR;            /*!<  (@ 0x100+0x00) AA0_DIG_USR register                                      */
  __IO uint32_t  AA1_DIG_USR;            /*!<  (@ 0x100+0x04) AA1_DIG_USR register                                      */
  __IO uint32_t  AA2_DIG_USR;            /*!<  (@ 0x100+0x08) AA2_DIG_USR register                                      */
  __IO uint32_t  AA3_DIG_USR;            /*!<  (@ 0x100+0x0C) AA3_DIG_USR register                                      */
  __IO uint32_t  DEM_MOD_DIG_USR;    /*!<  (@ 0x100+0x10) DEM_MOD_DIG_USR register                                  */
  __IO uint32_t  RADIO_FSM_USR;    /*!<  (@ 0x100+0x14) RADIO_FSM_USR register                                    */
  __IO uint32_t  PHYCTRL_DIG_USR;    /*!<  (@ 0x100+0x18) PHYCTRL_DIG_USR register                                  */
  __IO  uint32_t  RESERVED3[10];
  __IO uint32_t  AFC0_DIG_ENG;   /*!<  (@ 0x100+0x44) AFC0_DIG_ENG register                                     */
  __IO uint32_t  AFC1_DIG_ENG;   /*!<  (@ 0x100+0x48) AFC1_DIG_ENG register                                     */
  __IO uint32_t  AFC2_DIG_ENG;   /*!<  (@ 0x100+0x4C) AFC2_DIG_ENG register                                     */
  __IO uint32_t  AFC3_DIG_ENG;   /*!<  (@ 0x100+0x50) AFC3_DIG_ENG register                                     */
  __IO uint32_t  CR0_DIG_ENG;            /*!<  (@ 0x100+0x54) CR0_DIG_ENG register                                      */
  __IO  uint32_t  RESERVED4[4];
  __IO uint32_t  CR0_LR;           /*!<  (@ 0x100+0x68) CR0_LR register                                           */
  __IO uint32_t  VIT_CONF_DIG_ENG;   /*!<  (@ 0x100+0x6C) VIT_CONF_DIG_ENG register                                 */
  __IO  uint32_t  RESERVED5[5];
  __IO uint32_t  LR_PD_THR_DIG_ENG;    /*!<  (@ 0x100+0x84) LR_PD_THR_DIG_ENG register                                */
  __IO uint32_t  LR_RSSI_THR_DIG_ENG;    /*!<  (@ 0x100+0x88) LR_RSSI_THR_DIG_ENG register                              */
  __IO uint32_t  LR_AAC_THR_DIG_ENG;   /*!<  (@ 0x100+0x8C) LR_AAC_THR_DIG_ENG register                               */
  __IO  uint32_t  RESERVED6[19];
  __IO uint32_t  DTB0_DIG_ENG;   /*!<  (@ 0x100+0xDC) DTB0_DIG_ENG register                                     */
  __IO  uint32_t  RESERVED7[4];
  __IO uint32_t  DTB5_DIG_ENG;   /*!<  (@ 0x100+0xF0) DTB5_DIG_ENG register                                     */
  __IO  uint32_t  RESERVED8[16];
  __IO uint32_t  MOD0_DIG_TST;   /*!<  (@ 0x100+0x134) MOD0_DIG_TST register                                    */
  __IO uint32_t  MOD1_DIG_TST;   /*!<  (@ 0x100+0x138) MOD1_DIG_TST register                                    */
  __IO uint32_t  MOD2_DIG_TST;   /*!<  (@ 0x100+0x13C) MOD2_DIG_TST register                                    */
  __IO uint32_t  MOD3_DIG_TST;   /*!<  (@ 0x100+0x140) MOD3_DIG_TST register                                    */
  __IO  uint32_t  RESERVED9;
  __IO uint32_t  RXADC_ANA_USR;    /*!<  (@ 0x100+0x148) RXADC_ANA_USR register                                   */
  __IO  uint32_t  RESERVED10[2];
  __IO uint32_t  LDO_ANA_ENG;            /*!<  (@ 0x100+0x154) LDO_ANA_ENG register                                     */
  __IO  uint32_t  RESERVED11[7];
  __IO uint32_t  CBIAS0_ANA_ENG;   /*!<  (@ 0x100+0x174) CBIAS0_ANA_ENG register                                  */
  __IO uint32_t  CBIAS1_ANA_ENG;   /*!<  (@ 0x100+0x178) CBIAS1_ANA_ENG register                                  */
  __IO uint32_t  CBIAS_ANA_TEST;   /*!<  (@ 0x100+0x17C) CBIAS_ANA_TEST register                                  */
  __IO  uint32_t  SYNTHCAL0_DIG_OUT;   /*!<  (@ 0x100+0x180) SYNTHCAL0_DIG_OUT register                               */
  __IO  uint32_t  SYNTHCAL1_DIG_OUT;   /*!<  (@ 0x100+0x184) SYNTHCAL1_DIG_OUT register                               */
  __IO  uint32_t  SYNTHCAL2_DIG_OUT;   /*!<  (@ 0x100+0x188) SYNTHCAL2_DIG_OUT register                               */
  __IO  uint32_t  SYNTHCAL3_DIG_OUT;   /*!<  (@ 0x100+0x18C) SYNTHCAL3_DIG_OUT register                               */
  __IO  uint32_t  SYNTHCAL4_DIG_OUT;   /*!<  (@ 0x100+0x190) SYNTHCAL4_DIG_OUT register                               */
  __IO  uint32_t  SYNTHCAL5_DIG_OUT;   /*!<  (@ 0x100+0x194) SYNTHCAL5_DIG_OUT register                               */
  __IO  uint32_t  FSM_STATUS_DIG_OUT;    /*!<  (@ 0x100+0x198) FSM_STATUS_DIG_OUT register                              */
  __IO  uint32_t  IRQ_STATUS_DIG_OUT;    /*!<  (@ 0x100+0x19C) IRQ_STATUS_DIG_OUT register                              */
  __IO  uint32_t  RESERVED12;
  __IO  uint32_t  RSSI0_DIG_OUT;   /*!<  (@ 0x100+0x1A4) RSSI0_DIG_OUT register                                   */
  __IO  uint32_t  RSSI1_DIG_OUT;   /*!<  (@ 0x100+0x1A8) RSSI1_DIG_OUT register                                   */
  __IO  uint32_t  AGC_DIG_OUT;           /*!<  (@ 0x100+0x1AC) AGC_DIG_OUT register                                     */
  __IO  uint32_t  DEMOD_DIG_OUT;   /*!<  (@ 0x100+0x1B0) DEMOD_DIG_OUT register                                   */
  __IO uint32_t  AGC0_ANA_TST;   /*!<  (@ 0x100+0x1B4) AGC0_ANA_TST register                                    */
  __IO uint32_t  AGC1_ANA_TST;   /*!<  (@ 0x100+0x1B8) AGC1_ANA_TST register                                    */
  __IO uint32_t  AGC2_ANA_TST;   /*!<  (@ 0x100+0x1BC) AGC2_ANA_TST register                                    */
  __IO uint32_t  AGC0_DIG_ENG;   /*!<  (@ 0x100+0x1C0) AGC0_DIG_ENG register                                    */
  __IO uint32_t  AGC1_DIG_ENG;   /*!<  (@ 0x100+0x1C4) AGC1_DIG_ENG register                                    */
  __IO uint32_t  AGC2_DIG_ENG;   /*!<  (@ 0x100+0x1C8) AGC2_DIG_ENG register                                    */
  __IO uint32_t  AGC3_DIG_ENG;   /*!<  (@ 0x100+0x1CC) AGC3_DIG_ENG register                                    */
  __IO uint32_t  AGC4_DIG_ENG;   /*!<  (@ 0x100+0x1D0) AGC4_DIG_ENG register                                    */
  __IO uint32_t  AGC5_DIG_ENG;   /*!<  (@ 0x100+0x1D4) AGC5_DIG_ENG register                                    */
  __IO uint32_t  AGC6_DIG_ENG;   /*!<  (@ 0x100+0x1D8) AGC6_DIG_ENG register                                    */
  __IO uint32_t  AGC7_DIG_ENG;   /*!<  (@ 0x100+0x1DC) AGC7_DIG_ENG register                                    */
  __IO uint32_t  AGC8_DIG_ENG;   /*!<  (@ 0x100+0x1E0) AGC8_DIG_ENG register                                    */
  __IO uint32_t  AGC9_DIG_ENG;   /*!<  (@ 0x100+0x1E4) AGC9_DIG_ENG register                                    */
  __IO uint32_t  AGC10_DIG_ENG;    /*!<  (@ 0x100+0x1E8) AGC10_DIG_ENG register                                   */
  __IO uint32_t  AGC11_DIG_ENG;    /*!<  (@ 0x100+0x1EC) AGC11_DIG_ENG register                                   */
  __IO uint32_t  AGC12_DIG_ENG;    /*!<  (@ 0x100+0x1F0) AGC12_DIG_ENG register                                   */
  __IO uint32_t  AGC13_DIG_ENG;    /*!<  (@ 0x100+0x1F4) AGC13_DIG_ENG register                                   */
  __IO uint32_t  AGC14_DIG_ENG;    /*!<  (@ 0x100+0x1F8) AGC14_DIG_ENG register                                   */
  __IO uint32_t  AGC15_DIG_ENG;    /*!<  (@ 0x100+0x1FC) AGC15_DIG_ENG register                                   */
  __IO uint32_t  AGC16_DIG_ENG;    /*!<  (@ 0x100+0x200) AGC16_DIG_ENG register                                   */
  __IO uint32_t  AGC17_DIG_ENG;    /*!<  (@ 0x100+0x204) AGC17_DIG_ENG register                                   */
  __IO uint32_t  AGC18_DIG_ENG;    /*!<  (@ 0x100+0x208) AGC18_DIG_ENG register                                   */
  __IO uint32_t  AGC19_DIG_ENG;    /*!<  (@ 0x100+0x20C) AGC19_DIG_ENG register                                   */
  __IO uint32_t  AGC20_DIG_ENG;    /*!<  (@ 0x100+0x210) AGC20_DIG_ENG register                                   */
  __IO  uint32_t  RESERVED13[4];
  __IO  uint32_t  RXADC_HW_TRIM_OUT;           /*!<  (@ 0x100+0x224) RXADC_HW_TRIM_OUT register                               */
  __IO  uint32_t  CBIAS0_HW_TRIM_OUT;          /*!<  (@ 0x100+0x228) CBIAS0_HW_TRIM_OUT register                              */
  __IO  uint32_t  CBIAS1_HW_TRIM_OUT;          /*!<  (@ 0x100+0x22C) CBIAS1_HW_TRIM_OUT register                              */
  __IO  uint32_t  AGC_HW_TRIM_OUT;             /*!<  (@ 0x100+0x230) AGC_HW_TRIM_OUT register                                 */
  __IO  uint32_t  RESERVED14;
} RRM_TypeDef;                                  /*!< Size = 824 (0x338)                                                        */


/* =========================================================================================================================== */
/* ================                                     WAKEUP                                                ================ */
/* =========================================================================================================================== */


/**
  * @brief Wakeup (WAKEUP)
  */

typedef struct                                  /*!< Wakeup structure                                                          */
{
  __IO  uint32_t  WAKEUP_BLOCK_VERSION;        /*!< (@ 0x00000000) Wakeup block version register                              */
  __IO  uint32_t  RESERVED;
  __IO uint32_t  WAKEUP_OFFSET[2];            /*!< (@ 0x00000008) Wakeup offset_x register                                   */
  __IO  uint32_t  ABSOLUTE_TIME;               /*!< (@ 0x00000010) Absolute time register                                     */
  __IO  uint32_t  MINIMUM_PERIOD_LENGTH;       /*!< (@ 0x00000014) Minimum period length register                             */
  __IO  uint32_t  AVERAGE_PERIOD_LENGTH;       /*!< (@ 0x00000018) Average period length register                             */
  __IO  uint32_t  MAXIMUM_PERIOD_LENGTH;       /*!< (@ 0x0000001C) Maximum period length register                             */
  __IO uint32_t  STATISTICS_RESTART;          /*!< (@ 0x00000020) Statistics restart register                                */
  __IO uint32_t  BLUE_WAKEUP_TIME;            /*!< (@ 0x00000024) BLE wakeup time register                                   */
  __IO uint32_t  BLUE_SLEEP_REQUEST_MODE;     /*!< (@ 0x00000028) BLE sleep request mode register                            */
  __IO uint32_t  CM0_WAKEUP_TIME;             /*!< (@ 0x0000002C) CPU wakeup time register                                   */
  __IO uint32_t  CM0_SLEEP_REQUEST_MODE;      /*!< (@ 0x00000030) CPU sleep request mode register                            */
  __IO  uint32_t  RESERVED1[3];
  __IO uint32_t  WAKEUP_BLE_IRQ_ENABLE;       /*!< (@ 0x00000040) Wakeup BLE interrupt enable register                       */
  __IO uint32_t  WAKEUP_BLE_IRQ_STATUS;       /*!< (@ 0x00000044) Wakeup BLE interrupt status register                       */
  __IO uint32_t  WAKEUP_CM0_IRQ_ENABLE;       /*!< (@ 0x00000048) Wakeup CPU interrupt enable register                       */
  __IO uint32_t  WAKEUP_CM0_IRQ_STATUS;       /*!< (@ 0x0000004C) Wakeup CPU interrupt status register                       */
  __IO  uint32_t  RESERVED2;
} WAKEUP_TypeDef;                               /*!< Size = 84 (0x54)                                                          */


