stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    OAR1    ===================================================== */
#define I2C_OAR1_OA1EN_Pos                                                 (15UL)                             /*!<I2C OAR1: OA1EN (Bit 15) */
#define I2C_OAR1_OA1EN_Msk                                                 (0x1UL << I2C_OAR1_OA1EN_Pos)      /*!< I2C OAR1: OA1EN (Bitfield-Mask: 0x01) */
#define I2C_OAR1_OA1EN                                                     I2C_OAR1_OA1EN_Msk
#define I2C_OAR1_OA1MODE_Pos                                               (10UL)                             /*!<I2C OAR1: OA1MODE (Bit 10) */
#define I2C_OAR1_OA1MODE_Msk                                               (0x1UL << I2C_OAR1_OA1MODE_Pos)    /*!< I2C OAR1: OA1MODE (Bitfield-Mask: 0x01) */
#define I2C_OAR1_OA1MODE                                                   I2C_OAR1_OA1MODE_Msk
#define I2C_OAR1_OA1_Pos                                                   (0UL)                              /*!<I2C OAR1: OA1 (Bit 0) */
#define I2C_OAR1_OA1_Msk                                                   (0x3FFUL << I2C_OAR1_OA1_Pos)      /*!< I2C OAR1: OA1 (Bitfield-Mask: 0x3ff) */
#define I2C_OAR1_OA1                                                       I2C_OAR1_OA1_Msk
#define I2C_OAR1_OA1_0                                                     (0x1U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_1                                                     (0x2U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_2                                                     (0x4U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_3                                                     (0x8U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_4                                                     (0x10U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_5                                                     (0x20U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_6                                                     (0x40U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_7                                                     (0x80U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_8                                                     (0x100U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_9                                                     (0x200U << I2C_OAR1_OA1_Pos)

/* =====================================================    OAR2    ===================================================== */
#define I2C_OAR2_OA2EN_Pos                                                 (15UL)                             /*!<I2C OAR2: OA2EN (Bit 15) */
#define I2C_OAR2_OA2EN_Msk                                                 (0x1UL << I2C_OAR2_OA2EN_Pos)      /*!< I2C OAR2: OA2EN (Bitfield-Mask: 0x01) */
#define I2C_OAR2_OA2EN                                                     I2C_OAR2_OA2EN_Msk
#define I2C_OAR2_OA2MSK_Pos                                                (8UL)                              /*!<I2C OAR2: OA2MSK (Bit 8) */
#define I2C_OAR2_OA2MSK_Msk                                                (0x7UL << I2C_OAR2_OA2MSK_Pos)     /*!< I2C OAR2: OA2MSK (Bitfield-Mask: 0x07) */
#define I2C_OAR2_OA2MSK                                                    I2C_OAR2_OA2MSK_Msk
#define I2C_OAR2_OA2NOMASK                                                 (0x00000000UL)                     /*!< No mask                                        */
#define I2C_OAR2_OA2MASK01_Pos                                             (8U)
#define I2C_OAR2_OA2MASK01_Msk                                             (0x1UL << I2C_OAR2_OA2MASK01_Pos)  /*!< 0x00000100 */
#define I2C_OAR2_OA2MASK01                                                 I2C_OAR2_OA2MASK01_Msk             /*!< OA2[1] is masked, Only OA2[7:2] are compared   */
#define I2C_OAR2_OA2MASK02_Pos                                             (9U)
#define I2C_OAR2_OA2MASK02_Msk                                             (0x1UL << I2C_OAR2_OA2MASK02_Pos)  /*!< 0x00000200 */
#define I2C_OAR2_OA2MASK02                                                 I2C_OAR2_OA2MASK02_Msk             /*!< OA2[2:1] is masked, Only OA2[7:3] are compared */
#define I2C_OAR2_OA2MASK03_Pos                                             (8U)
#define I2C_OAR2_OA2MASK03_Msk                                             (0x3UL << I2C_OAR2_OA2MASK03_Pos)  /*!< 0x00000300 */
#define I2C_OAR2_OA2MASK03                                                 I2C_OAR2_OA2MASK03_Msk             /*!< OA2[3:1] is masked, Only OA2[7:4] are compared */
#define I2C_OAR2_OA2MASK04_Pos                                             (10U)
#define I2C_OAR2_OA2MASK04_Msk                                             (0x1UL << I2C_OAR2_OA2MASK04_Pos)  /*!< 0x00000400 */
#define I2C_OAR2_OA2MASK04                                                 I2C_OAR2_OA2MASK04_Msk             /*!< OA2[4:1] is masked, Only OA2[7:5] are compared */
#define I2C_OAR2_OA2MASK05_Pos                                             (8U)
#define I2C_OAR2_OA2MASK05_Msk                                             (0x5UL << I2C_OAR2_OA2MASK05_Pos)  /*!< 0x00000500 */
#define I2C_OAR2_OA2MASK05                                                 I2C_OAR2_OA2MASK05_Msk             /*!< OA2[5:1] is masked, Only OA2[7:6] are compared */
#define I2C_OAR2_OA2MASK06_Pos                                             (9U)
#define I2C_OAR2_OA2MASK06_Msk                                             (0x3UL << I2C_OAR2_OA2MASK06_Pos)  /*!< 0x00000600 */
#define I2C_OAR2_OA2MASK06                                                 I2C_OAR2_OA2MASK06_Msk             /*!< OA2[6:1] is masked, Only OA2[7] are compared   */
#define I2C_OAR2_OA2MASK07_Pos                                             (8U)
#define I2C_OAR2_OA2MASK07_Msk                                             (0x7UL << I2C_OAR2_OA2MASK07_Pos)  /*!< 0x00000700 */
#define I2C_OAR2_OA2MASK07                                                 I2C_OAR2_OA2MASK07_Msk             /*!< OA2[7:1] is masked, No comparison is done      */
#define I2C_OAR2_OA2_Pos                                                   (1UL)                              /*!<I2C OAR2: OA2 (Bit 1) */
#define I2C_OAR2_OA2_Msk                                                   (0x7FUL << I2C_OAR2_OA2_Pos)       /*!< I2C OAR2: OA2 (Bitfield-Mask: 0x7f) */
#define I2C_OAR2_OA2                                                       I2C_OAR2_OA2_Msk
#define I2C_OAR2_OA2_0                                                     (0x1U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_1                                                     (0x2U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_2                                                     (0x4U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_3                                                     (0x8U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_4                                                     (0x10U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_5                                                     (0x20U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_6                                                     (0x40U << I2C_OAR2_OA2_Pos)

/* =====================================================    TIMINGR    ===================================================== */
#define I2C_TIMINGR_PRESC_Pos                                              (28UL)                             /*!<I2C TIMINGR: PRESC (Bit 28) */
#define I2C_TIMINGR_PRESC_Msk                                              (0xFUL << I2C_TIMINGR_PRESC_Pos)   /*!< I2C TIMINGR: PRESC (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_PRESC                                                  I2C_TIMINGR_PRESC_Msk
#define I2C_TIMINGR_PRESC_0                                                (0x1U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_1                                                (0x2U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_2                                                (0x4U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_3                                                (0x8U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_SCLDEL_Pos                                             (20UL)                             /*!<I2C TIMINGR: SCLDEL (Bit 20) */
#define I2C_TIMINGR_SCLDEL_Msk                                             (0xFUL << I2C_TIMINGR_SCLDEL_Pos)  /*!< I2C TIMINGR: SCLDEL (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_SCLDEL                                                 I2C_TIMINGR_SCLDEL_Msk
#define I2C_TIMINGR_SCLDEL_0                                               (0x1U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_1                                               (0x2U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_2                                               (0x4U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_3                                               (0x8U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SDADEL_Pos                                             (16UL)                             /*!<I2C TIMINGR: SDADEL (Bit 16) */
#define I2C_TIMINGR_SDADEL_Msk                                             (0xFUL << I2C_TIMINGR_SDADEL_Pos)  /*!< I2C TIMINGR: SDADEL (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_SDADEL                                                 I2C_TIMINGR_SDADEL_Msk
#define I2C_TIMINGR_SDADEL_0                                               (0x1U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_1                                               (0x2U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_2                                               (0x4U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_3                                               (0x8U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SCLH_Pos                                               (8UL)                              /*!<I2C TIMINGR: SCLH (Bit 8) */
#define I2C_TIMINGR_SCLH_Msk                                               (0xFFUL << I2C_TIMINGR_SCLH_Pos)   /*!< I2C TIMINGR: SCLH (Bitfield-Mask: 0xff) */
#define I2C_TIMINGR_SCLH                                                   I2C_TIMINGR_SCLH_Msk
#define I2C_TIMINGR_SCLH_0                                                 (0x1U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_1                                                 (0x2U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_2                                                 (0x4U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_3                                                 (0x8U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_4                                                 (0x10U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_5                                                 (0x20U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_6                                                 (0x40U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_7                                                 (0x80U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLL_Pos                                               (0UL)                              /*!<I2C TIMINGR: SCLL (Bit 0) */
#define I2C_TIMINGR_SCLL_Msk                                               (0xFFUL << I2C_TIMINGR_SCLL_Pos)   /*!< I2C TIMINGR: SCLL (Bitfield-Mask: 0xff) */
#define I2C_TIMINGR_SCLL                                                   I2C_TIMINGR_SCLL_Msk
#define I2C_TIMINGR_SCLL_0                                                 (0x1U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_1                                                 (0x2U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_2                                                 (0x4U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_3                                                 (0x8U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_4                                                 (0x10U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_5                                                 (0x20U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_6                                                 (0x40U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_7                                                 (0x80U << I2C_TIMINGR_SCLL_Pos)

/* =====================================================    TIMEOUTR    ===================================================== */
#define I2C_TIMEOUTR_TEXTEN_Pos                                            (31UL)                                 /*!<I2C TIMEOUTR: TEXTEN (Bit 31) */
#define I2C_TIMEOUTR_TEXTEN_Msk                                            (0x1UL << I2C_TIMEOUTR_TEXTEN_Pos)     /*!< I2C TIMEOUTR: TEXTEN (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TEXTEN                                                I2C_TIMEOUTR_TEXTEN_Msk
#define I2C_TIMEOUTR_TIMEOUTB_Pos                                          (16UL)                                 /*!<I2C TIMEOUTR: TIMEOUTB (Bit 16) */
#define I2C_TIMEOUTR_TIMEOUTB_Msk                                          (0xFFFUL << I2C_TIMEOUTR_TIMEOUTB_Pos) /*!< I2C TIMEOUTR: TIMEOUTB (Bitfield-Mask: 0xfff) */
#define I2C_TIMEOUTR_TIMEOUTB                                              I2C_TIMEOUTR_TIMEOUTB_Msk
#define I2C_TIMEOUTR_TIMEOUTB_0                                            (0x1U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_1                                            (0x2U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_2                                            (0x4U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_3                                            (0x8U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_4                                            (0x10U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_5                                            (0x20U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_6                                            (0x40U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_7                                            (0x80U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_8                                            (0x100U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_9                                            (0x200U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_10                                           (0x400U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_11                                           (0x800U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMOUTEN_Pos                                          (15UL)                                 /*!<I2C TIMEOUTR: TIMOUTEN (Bit 15) */
#define I2C_TIMEOUTR_TIMOUTEN_Msk                                          (0x1UL << I2C_TIMEOUTR_TIMOUTEN_Pos)   /*!< I2C TIMEOUTR: TIMOUTEN (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TIMOUTEN                                              I2C_TIMEOUTR_TIMOUTEN_Msk
#define I2C_TIMEOUTR_TIDLE_Pos                                             (12UL)                                 /*!<I2C TIMEOUTR: TIDLE (Bit 12) */
#define I2C_TIMEOUTR_TIDLE_Msk                                             (0x1UL << I2C_TIMEOUTR_TIDLE_Pos)      /*!< I2C TIMEOUTR: TIDLE (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TIDLE                                                 I2C_TIMEOUTR_TIDLE_Msk
#define I2C_TIMEOUTR_TIMEOUTA_Pos                                          (0UL)                                  /*!<I2C TIMEOUTR: TIMEOUTA (Bit 0) */
#define I2C_TIMEOUTR_TIMEOUTA_Msk                                          (0xFFFUL << I2C_TIMEOUTR_TIMEOUTA_Pos) /*!< I2C TIMEOUTR: TIMEOUTA (Bitfield-Mask: 0xfff) */
#define I2C_TIMEOUTR_TIMEOUTA                                              I2C_TIMEOUTR_TIMEOUTA_Msk
#define I2C_TIMEOUTR_TIMEOUTA_0                                            (0x1U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_1                                            (0x2U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_2                                            (0x4U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_3                                            (0x8U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_4                                            (0x10U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_5                                            (0x20U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_6                                            (0x40U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_7                                            (0x80U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_8                                            (0x100U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_9                                            (0x200U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_10                                           (0x400U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_11                                           (0x800U << I2C_TIMEOUTR_TIMEOUTA_Pos)

