stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    IRQRAW    ===================================================== */
#define FLASH_IRQRAW_READOK_RIS_Pos                                        (4UL)    /*!<FLASH IRQRAW: READOK_RIS (Bit 4) */
#define FLASH_IRQRAW_READOK_RIS_Msk                                        (0x10UL)   /*!< FLASH IRQRAW: READOK_RIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQRAW_READOK_RIS                                            FLASH_IRQRAW_READOK_RIS_Msk
#define FLASH_IRQRAW_ILLCMD_RIS_Pos                                        (3UL)    /*!<FLASH IRQRAW: ILLCMD_RIS (Bit 3) */
#define FLASH_IRQRAW_ILLCMD_RIS_Msk                                        (0x8UL)    /*!< FLASH IRQRAW: ILLCMD_RIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQRAW_ILLCMD_RIS                                            FLASH_IRQRAW_ILLCMD_RIS_Msk
#define FLASH_IRQRAW_CMDERR_RIS_Pos                                        (2UL)    /*!<FLASH IRQRAW: CMDERR_RIS (Bit 2) */
#define FLASH_IRQRAW_CMDERR_RIS_Msk                                        (0x4UL)    /*!< FLASH IRQRAW: CMDERR_RIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQRAW_CMDERR_RIS                                            FLASH_IRQRAW_CMDERR_RIS_Msk
#define FLASH_IRQRAW_CMDSTART_RIS_Pos                                      (1UL)    /*!<FLASH IRQRAW: CMDSTART_RIS (Bit 1) */
#define FLASH_IRQRAW_CMDSTART_RIS_Msk                                      (0x2UL)    /*!< FLASH IRQRAW: CMDSTART_RIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQRAW_CMDSTART_RIS                                          FLASH_IRQRAW_CMDSTART_RIS_Msk
#define FLASH_IRQRAW_CMDDONE_RIS_Pos                                       (0UL)    /*!<FLASH IRQRAW: CMDDONE_RIS (Bit 0) */
#define FLASH_IRQRAW_CMDDONE_RIS_Msk                                       (0x1UL)    /*!< FLASH IRQRAW: CMDDONE_RIS (Bitfield-Mask: 0x01) */
#define FLASH_IRQRAW_CMDDONE_RIS                                           FLASH_IRQRAW_CMDDONE_RIS_Msk

/* =====================================================    FLASH_SIZE    ===================================================== */
#define FLASH_FLASH_SIZE_SWD_DISABLE_Pos                                   (20UL)   /*!<FLASH FLASH_SIZE: SWD_DISABLE (Bit 20) */
#define FLASH_FLASH_SIZE_SWD_DISABLE_Msk                                   (0x100000UL)   /*!< FLASH FLASH_SIZE: SWD_DISABLE (Bitfield-Mask: 0x01) */
#define FLASH_FLASH_SIZE_SWD_DISABLE                                       FLASH_FLASH_SIZE_SWD_DISABLE_Msk
#define FLASH_FLASH_SIZE_FLASH_SECURE_Pos                                  (19UL)   /*!<FLASH FLASH_SIZE: FLASH_SECURE (Bit 19) */
#define FLASH_FLASH_SIZE_FLASH_SECURE_Msk                                  (0x80000UL)    /*!< FLASH FLASH_SIZE: FLASH_SECURE (Bitfield-Mask: 0x01) */
#define FLASH_FLASH_SIZE_FLASH_SECURE                                      FLASH_FLASH_SIZE_FLASH_SECURE_Msk
#define FLASH_FLASH_SIZE_RAM_SIZE_Pos                                      (17UL)   /*!<FLASH FLASH_SIZE: RAM_SIZE (Bit 17) */
#define FLASH_FLASH_SIZE_RAM_SIZE_Msk                                      (0x60000UL)    /*!< FLASH FLASH_SIZE: RAM_SIZE (Bitfield-Mask: 0x03) */
#define FLASH_FLASH_SIZE_RAM_SIZE                                          FLASH_FLASH_SIZE_RAM_SIZE_Msk
#define FLASH_FLASH_SIZE_RAM_SIZE_0                                        (0x1U << FLASH_FLASH_SIZE_RAM_SIZE_Pos)
#define FLASH_FLASH_SIZE_RAM_SIZE_1                                        (0x2U << FLASH_FLASH_SIZE_RAM_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_Pos                                    (0UL)    /*!<FLASH FLASH_SIZE: FLASH_SIZE (Bit 0) */
#define FLASH_FLASH_SIZE_FLASH_SIZE_Msk                                    (0xffffUL)   /*!< FLASH FLASH_SIZE: FLASH_SIZE (Bitfield-Mask: 0xffff) */
#define FLASH_FLASH_SIZE_FLASH_SIZE                                        FLASH_FLASH_SIZE_FLASH_SIZE_Msk
#define FLASH_FLASH_SIZE_FLASH_SIZE_0                                      (0x1U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_1                                      (0x2U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_2                                      (0x4U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_3                                      (0x8U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_4                                      (0x10U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_5                                      (0x20U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_6                                      (0x40U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_7                                      (0x80U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_8                                      (0x100U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_9                                      (0x200U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_10                                     (0x400U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_11                                     (0x800U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_12                                     (0x1000U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_13                                     (0x2000U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_14                                     (0x4000U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)
#define FLASH_FLASH_SIZE_FLASH_SIZE_15                                     (0x8000U << FLASH_FLASH_SIZE_FLASH_SIZE_Pos)

/* =====================================================    ADDRESS    ===================================================== */
#define FLASH_ADDRESS_XADDR_Pos                                            (6UL)    /*!<FLASH ADDRESS: XADDR (Bit 6) */
#define FLASH_ADDRESS_XADDR_Msk                                            (0xffc0UL)   /*!< FLASH ADDRESS: XADDR (Bitfield-Mask: 0x3ff) */
#define FLASH_ADDRESS_XADDR                                                FLASH_ADDRESS_XADDR_Msk
#define FLASH_ADDRESS_XADDR_0                                              (0x1U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_1                                              (0x2U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_2                                              (0x4U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_3                                              (0x8U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_4                                              (0x10U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_5                                              (0x20U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_6                                              (0x40U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_7                                              (0x80U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_8                                              (0x100U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_XADDR_9                                              (0x200U << FLASH_ADDRESS_XADDR_Pos)
#define FLASH_ADDRESS_YADDR_Pos                                            (0UL)    /*!<FLASH ADDRESS: YADDR (Bit 0) */
#define FLASH_ADDRESS_YADDR_Msk                                            (0x3fUL)   /*!< FLASH ADDRESS: YADDR (Bitfield-Mask: 0x3f) */
#define FLASH_ADDRESS_YADDR                                                FLASH_ADDRESS_YADDR_Msk
#define FLASH_ADDRESS_YADDR_0                                              (0x1U << FLASH_ADDRESS_YADDR_Pos)
#define FLASH_ADDRESS_YADDR_1                                              (0x2U << FLASH_ADDRESS_YADDR_Pos)
#define FLASH_ADDRESS_YADDR_2                                              (0x4U << FLASH_ADDRESS_YADDR_Pos)
#define FLASH_ADDRESS_YADDR_3                                              (0x8U << FLASH_ADDRESS_YADDR_Pos)
#define FLASH_ADDRESS_YADDR_4                                              (0x10U << FLASH_ADDRESS_YADDR_Pos)
#define FLASH_ADDRESS_YADDR_5                                              (0x20U << FLASH_ADDRESS_YADDR_Pos)

/* =====================================================    LFSRVAL      =====================================================*/
#define FLASH_LFSRVAL_Pos                                                  (0UL)    /*!< Linear feedback shift*/
#define FLASH_LFSRVAL_Msk                                                  (0xFFFFFFFFUL << FLASH_LFSRVAL_Pos)        /*! 0xFFFFFFFF */
#define FLASH_LFSRVAL                                                      FLASH_LFSRVAL_Msk
#define FLASH_LFSRVAL_0                                                    (0x00000001U << FLASH_LFSRVAL_Pos)             /*! 0x00000001 */
#define FLASH_LFSRVAL_1                                                    (0x00000002U << FLASH_LFSRVAL_Pos)             /*! 0x00000002 */
#define FLASH_LFSRVAL_2                                                    (0x00000004U << FLASH_LFSRVAL_Pos)             /*! 0x00000004 */
#define FLASH_LFSRVAL_3                                                    (0x00000008U << FLASH_LFSRVAL_Pos)             /*! 0x00000008 */
#define FLASH_LFSRVAL_4                                                    (0x00000010U << FLASH_LFSRVAL_Pos)             /*! 0x00000010 */
#define FLASH_LFSRVAL_5                                                    (0x00000020U << FLASH_LFSRVAL_Pos)             /*! 0x00000020 */
#define FLASH_LFSRVAL_6                                                    (0x00000040U << FLASH_LFSRVAL_Pos)             /*! 0x00000040 */
#define FLASH_LFSRVAL_7                                                    (0x00000080U << FLASH_LFSRVAL_Pos)             /*! 0x00000080 */
#define FLASH_LFSRVAL_8                                                    (0x00000100U << FLASH_LFSRVAL_Pos)             /*! 0x00000100 */
#define FLASH_LFSRVAL_9                                                    (0x00000200U << FLASH_LFSRVAL_Pos)             /*! 0x00000200 */
#define FLASH_LFSRVAL_10                                                   (0x00000400U << FLASH_LFSRVAL_Pos)             /*! 0x00000400 */
#define FLASH_LFSRVAL_11                                                   (0x00000800U << FLASH_LFSRVAL_Pos)             /*! 0x00000800 */
#define FLASH_LFSRVAL_12                                                   (0x00001000U << FLASH_LFSRVAL_Pos)             /*! 0x00001000 */
#define FLASH_LFSRVAL_13                                                   (0x00002000U << FLASH_LFSRVAL_Pos)             /*! 0x00002000 */
#define FLASH_LFSRVAL_14                                                   (0x00004000U << FLASH_LFSRVAL_Pos)             /*! 0x00004000 */
#define FLASH_LFSRVAL_15                                                   (0x00008000U << FLASH_LFSRVAL_Pos)             /*! 0x00008000 */
#define FLASH_LFSRVAL_16                                                   (0x00010000U << FLASH_LFSRVAL_Pos)             /*! 0x00010000 */
#define FLASH_LFSRVAL_17                                                   (0x00020000U << FLASH_LFSRVAL_Pos)             /*! 0x00020000 */
#define FLASH_LFSRVAL_18                                                   (0x00040000U << FLASH_LFSRVAL_Pos)             /*! 0x00040000 */
#define FLASH_LFSRVAL_19                                                   (0x00080000U << FLASH_LFSRVAL_Pos)             /*! 0x00080000 */
#define FLASH_LFSRVAL_20                                                   (0x00100000U << FLASH_LFSRVAL_Pos)             /*! 0x00100000 */
#define FLASH_LFSRVAL_21                                                   (0x00200000U << FLASH_LFSRVAL_Pos)             /*! 0x00200000 */
#define FLASH_LFSRVAL_22                                                   (0x00400000U << FLASH_LFSRVAL_Pos)             /*! 0x00400000 */
#define FLASH_LFSRVAL_23                                                   (0x00800000U << FLASH_LFSRVAL_Pos)             /*! 0x00800000 */
#define FLASH_LFSRVAL_24                                                   (0x01000000U << FLASH_LFSRVAL_Pos)             /*! 0x01000000 */
#define FLASH_LFSRVAL_25                                                   (0x02000000U << FLASH_LFSRVAL_Pos)             /*! 0x02000000 */
#define FLASH_LFSRVAL_26                                                   (0x04000000U << FLASH_LFSRVAL_Pos)             /*! 0x04000000 */
#define FLASH_LFSRVAL_27                                                   (0x08000000U << FLASH_LFSRVAL_Pos)             /*! 0x08000000 */
#define FLASH_LFSRVAL_28                                                   (0x10000000U << FLASH_LFSRVAL_Pos)             /*! 0x10000000 */
#define FLASH_LFSRVAL_29                                                   (0x20000000U << FLASH_LFSRVAL_Pos)             /*! 0x20000000 */
#define FLASH_LFSRVAL_30                                                   (0x40000000U << FLASH_LFSRVAL_Pos)             /*! 0x40000000 */
#define FLASH_LFSRVAL_31                                                   (0x80000000U << FLASH_LFSRVAL_Pos)             /*! 0x80000000 */

/* =====================================================    PAGEPROT0    ===================================================== */
#define FLASH_PAGEPROT0_SEG1_Pos                                           (16UL)   /*!<FLASH PAGEPROT0: SEG1 (Bit 16) */
#define FLASH_PAGEPROT0_SEG1_Msk                                           (0xffff0000UL)   /*!< FLASH PAGEPROT0: SEG1 (Bitfield-Mask: 0xffff) */
#define FLASH_PAGEPROT0_SEG1                                               FLASH_PAGEPROT0_SEG1_Msk
#define FLASH_PAGEPROT0_SEG1_0                                             (0x1U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_1                                             (0x2U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_2                                             (0x4U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_3                                             (0x8U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_4                                             (0x10U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_5                                             (0x20U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_6                                             (0x40U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_7                                             (0x80U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_8                                             (0x100U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_9                                             (0x200U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_10                                            (0x400U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_11                                            (0x800U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_12                                            (0x1000U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_13                                            (0x2000U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_14                                            (0x4000U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG1_15                                            (0x8000U << FLASH_PAGEPROT0_SEG1_Pos)
#define FLASH_PAGEPROT0_SEG0_Pos                                           (0UL)    /*!<FLASH PAGEPROT0: SEG0 (Bit 0) */
#define FLASH_PAGEPROT0_SEG0_Msk                                           (0xffffUL)   /*!< FLASH PAGEPROT0: SEG0 (Bitfield-Mask: 0xffff) */
#define FLASH_PAGEPROT0_SEG0                                               FLASH_PAGEPROT0_SEG0_Msk
#define FLASH_PAGEPROT0_SEG0_0                                             (0x1U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_1                                             (0x2U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_2                                             (0x4U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_3                                             (0x8U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_4                                             (0x10U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_5                                             (0x20U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_6                                             (0x40U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_7                                             (0x80U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_8                                             (0x100U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_9                                             (0x200U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_10                                            (0x400U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_11                                            (0x800U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_12                                            (0x1000U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_13                                            (0x2000U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_14                                            (0x4000U << FLASH_PAGEPROT0_SEG0_Pos)
#define FLASH_PAGEPROT0_SEG0_15                                            (0x8000U << FLASH_PAGEPROT0_SEG0_Pos)

/* =====================================================    PAGEPROT1    ===================================================== */
#define FLASH_PAGEPROT1_SEG3_Pos                                           (16UL)   /*!<FLASH PAGEPROT1: SEG3 (Bit 16) */
#define FLASH_PAGEPROT1_SEG3_Msk                                           (0xffff0000UL)   /*!< FLASH PAGEPROT1: SEG3 (Bitfield-Mask: 0xffff) */
#define FLASH_PAGEPROT1_SEG3                                               FLASH_PAGEPROT1_SEG3_Msk
#define FLASH_PAGEPROT1_SEG3_0                                             (0x1U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_1                                             (0x2U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_2                                             (0x4U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_3                                             (0x8U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_4                                             (0x10U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_5                                             (0x20U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_6                                             (0x40U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_7                                             (0x80U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_8                                             (0x100U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_9                                             (0x200U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_10                                            (0x400U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_11                                            (0x800U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_12                                            (0x1000U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_13                                            (0x2000U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_14                                            (0x4000U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG3_15                                            (0x8000U << FLASH_PAGEPROT1_SEG3_Pos)
#define FLASH_PAGEPROT1_SEG2_Pos                                           (0UL)    /*!<FLASH PAGEPROT1: SEG2 (Bit 0) */
#define FLASH_PAGEPROT1_SEG2_Msk                                           (0xffffUL)   /*!< FLASH PAGEPROT1: SEG2 (Bitfield-Mask: 0xffff) */
#define FLASH_PAGEPROT1_SEG2                                               FLASH_PAGEPROT1_SEG2_Msk
#define FLASH_PAGEPROT1_SEG2_0                                             (0x1U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_1                                             (0x2U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_2                                             (0x4U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_3                                             (0x8U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_4                                             (0x10U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_5                                             (0x20U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_6                                             (0x40U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_7                                             (0x80U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_8                                             (0x100U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_9                                             (0x200U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_10                                            (0x400U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_11                                            (0x800U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_12                                            (0x1000U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_13                                            (0x2000U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_14                                            (0x4000U << FLASH_PAGEPROT1_SEG2_Pos)
#define FLASH_PAGEPROT1_SEG2_15                                            (0x8000U << FLASH_PAGEPROT1_SEG2_Pos)

