stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    CIER    ===================================================== */
#define RCC_CIER_WDGRSTIE_Pos                                              (8UL)    /*!<RCC CIER: WDGRSTIE (Bit 8) */
#define RCC_CIER_WDGRSTIE_Msk                                              (0x100UL)    /*!< RCC CIER: WDGRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_WDGRSTIE                                                  RCC_CIER_WDGRSTIE_Msk
#define RCC_CIER_RTCRSTIE_Pos                                              (7UL)    /*!<RCC CIER: RTCRSTIE (Bit 7) */
#define RCC_CIER_RTCRSTIE_Msk                                              (0x80UL)   /*!< RCC CIER: RTCRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_RTCRSTIE                                                  RCC_CIER_RTCRSTIE_Msk
#define RCC_CIER_HSIPLLUNLOCKDETIE_Pos                                     (6UL)    /*!<RCC CIER: HSIPLLUNLOCKDETIE (Bit 6) */
#define RCC_CIER_HSIPLLUNLOCKDETIE_Msk                                     (0x40UL)   /*!< RCC CIER: HSIPLLUNLOCKDETIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIPLLUNLOCKDETIE                                         RCC_CIER_HSIPLLUNLOCKDETIE_Msk
#define RCC_CIER_HSIPLLRDYIE_Pos                                           (5UL)    /*!<RCC CIER: HSIPLLRDYIE (Bit 5) */
#define RCC_CIER_HSIPLLRDYIE_Msk                                           (0x20UL)   /*!< RCC CIER: HSIPLLRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIPLLRDYIE                                               RCC_CIER_HSIPLLRDYIE_Msk
#define RCC_CIER_HSERDYIE_Pos                                              (4UL)    /*!<RCC CIER: HSERDYIE (Bit 4) */
#define RCC_CIER_HSERDYIE_Msk                                              (0x10UL)   /*!< RCC CIER: HSERDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSERDYIE                                                  RCC_CIER_HSERDYIE_Msk
#define RCC_CIER_HSIRDYIE_Pos                                              (3UL)    /*!<RCC CIER: HSIRDYIE (Bit 3) */
#define RCC_CIER_HSIRDYIE_Msk                                              (0x8UL)    /*!< RCC CIER: HSIRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIRDYIE                                                  RCC_CIER_HSIRDYIE_Msk
#define RCC_CIER_LSERDYIE_Pos                                              (1UL)    /*!<RCC CIER: LSERDYIE (Bit 1) */
#define RCC_CIER_LSERDYIE_Msk                                              (0x2UL)    /*!< RCC CIER: LSERDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LSERDYIE                                                  RCC_CIER_LSERDYIE_Msk
#define RCC_CIER_LSIRDYIE_Pos                                              (0UL)    /*!<RCC CIER: LSIRDYIE (Bit 0) */
#define RCC_CIER_LSIRDYIE_Msk                                              (0x1UL)    /*!< RCC CIER: LSIRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LSIRDYIE                                                  RCC_CIER_LSIRDYIE_Msk

/* =====================================================    CIFR    ===================================================== */
#define RCC_CIFR_WDGRSTF_Pos                                               (8UL)    /*!<RCC CIFR: WDGRSTF (Bit 8) */
#define RCC_CIFR_WDGRSTF_Msk                                               (0x100UL)    /*!< RCC CIFR: WDGRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_WDGRSTF                                                   RCC_CIFR_WDGRSTF_Msk
#define RCC_CIFR_RTCRSTF_Pos                                               (7UL)    /*!<RCC CIFR: RTCRSTF (Bit 7) */
#define RCC_CIFR_RTCRSTF_Msk                                               (0x80UL)   /*!< RCC CIFR: RTCRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_RTCRSTF                                                   RCC_CIFR_RTCRSTF_Msk
#define RCC_CIFR_HSIPLLUNLOCKDETF_Pos                                      (6UL)    /*!<RCC CIFR: HSIPLLUNLOCKDETF (Bit 6) */
#define RCC_CIFR_HSIPLLUNLOCKDETF_Msk                                      (0x40UL)   /*!< RCC CIFR: HSIPLLUNLOCKDETF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIPLLUNLOCKDETF                                          RCC_CIFR_HSIPLLUNLOCKDETF_Msk
#define RCC_CIFR_HSIPLLRDYF_Pos                                            (5UL)    /*!<RCC CIFR: HSIPLLRDYF (Bit 5) */
#define RCC_CIFR_HSIPLLRDYF_Msk                                            (0x20UL)   /*!< RCC CIFR: HSIPLLRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIPLLRDYF                                                RCC_CIFR_HSIPLLRDYF_Msk
#define RCC_CIFR_HSERDYF_Pos                                               (4UL)    /*!<RCC CIFR: HSERDYF (Bit 4) */
#define RCC_CIFR_HSERDYF_Msk                                               (0x10UL)   /*!< RCC CIFR: HSERDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSERDYF                                                   RCC_CIFR_HSERDYF_Msk
#define RCC_CIFR_HSIRDYF_Pos                                               (3UL)    /*!<RCC CIFR: HSIRDYF (Bit 3) */
#define RCC_CIFR_HSIRDYF_Msk                                               (0x8UL)    /*!< RCC CIFR: HSIRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIRDYF                                                   RCC_CIFR_HSIRDYF_Msk
#define RCC_CIFR_LSERDYF_Pos                                               (1UL)    /*!<RCC CIFR: LSERDYF (Bit 1) */
#define RCC_CIFR_LSERDYF_Msk                                               (0x2UL)    /*!< RCC CIFR: LSERDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LSERDYF                                                   RCC_CIFR_LSERDYF_Msk
#define RCC_CIFR_LSIRDYF_Pos                                               (0UL)    /*!<RCC CIFR: LSIRDYF (Bit 0) */
#define RCC_CIFR_LSIRDYF_Msk                                               (0x1UL)    /*!< RCC CIFR: LSIRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LSIRDYF                                                   RCC_CIFR_LSIRDYF_Msk

/* =====================================================    CSCMDR    ===================================================== */
#define RCC_CSCMDR_EOFSEQ_IRQ_Pos                                          (7UL)    /*!<RCC CSCMDR: EOFSEQ_IRQ (Bit 7) */
#define RCC_CSCMDR_EOFSEQ_IRQ_Msk                                          (0x80UL)   /*!< RCC CSCMDR: EOFSEQ_IRQ (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_EOFSEQ_IRQ                                              RCC_CSCMDR_EOFSEQ_IRQ_Msk
#define RCC_CSCMDR_EOFSEQ_IE_Pos                                           (6UL)    /*!<RCC CSCMDR: EOFSEQ_IE (Bit 6) */
#define RCC_CSCMDR_EOFSEQ_IE_Msk                                           (0x40UL)   /*!< RCC CSCMDR: EOFSEQ_IE (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_EOFSEQ_IE                                               RCC_CSCMDR_EOFSEQ_IE_Msk
#define RCC_CSCMDR_STATUS_Pos                                              (4UL)    /*!<RCC CSCMDR: STATUS (Bit 4) */
#define RCC_CSCMDR_STATUS_Msk                                              (0x30UL)   /*!< RCC CSCMDR: STATUS (Bitfield-Mask: 0x03) */
#define RCC_CSCMDR_STATUS                                                  RCC_CSCMDR_STATUS_Msk
#define RCC_CSCMDR_STATUS_0                                                (0x1U << RCC_CSCMDR_STATUS_Pos)
#define RCC_CSCMDR_STATUS_1                                                (0x2U << RCC_CSCMDR_STATUS_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_Pos                                       (1UL)    /*!<RCC CSCMDR: CLKSYSDIV_REQ (Bit 1) */
#define RCC_CSCMDR_CLKSYSDIV_REQ_Msk                                       (0xeUL)    /*!< RCC CSCMDR: CLKSYSDIV_REQ (Bitfield-Mask: 0x07) */
#define RCC_CSCMDR_CLKSYSDIV_REQ                                           RCC_CSCMDR_CLKSYSDIV_REQ_Msk
#define RCC_CSCMDR_CLKSYSDIV_REQ_0                                         (0x1U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_1                                         (0x2U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_2                                         (0x4U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_REQUEST_Pos                                             (0UL)    /*!<RCC CSCMDR: REQUEST (Bit 0) */
#define RCC_CSCMDR_REQUEST_Msk                                             (0x1UL)    /*!< RCC CSCMDR: REQUEST (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_REQUEST                                                 RCC_CSCMDR_REQUEST_Msk

