stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    CR5    ===================================================== */
#define PWR_CR5_CLKDETR_DISABLE_Pos                                        (12UL)   /*!<PWR CR5: CLKDETR_DISABLE (Bit 12) */
#define PWR_CR5_CLKDETR_DISABLE_Msk                                        (0x1000UL)   /*!< PWR CR5: CLKDETR_DISABLE (Bitfield-Mask: 0x01) */
#define PWR_CR5_CLKDETR_DISABLE                                            PWR_CR5_CLKDETR_DISABLE_Msk
#define PWR_CR5_SMPS_ENA_DCM_Pos                                           (11UL)   /*!<PWR CR5: SMPS_ENA_DCM (Bit 11) */
#define PWR_CR5_SMPS_ENA_DCM_Msk                                           (0x800UL)    /*!< PWR CR5: SMPS_ENA_DCM (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_ENA_DCM                                               PWR_CR5_SMPS_ENA_DCM_Msk
#define PWR_CR5_NOSMPS_Pos                                                 (10UL)   /*!<PWR CR5: NOSMPS (Bit 10) */
#define PWR_CR5_NOSMPS_Msk                                                 (0x400UL)    /*!< PWR CR5: NOSMPS (Bitfield-Mask: 0x01) */
#define PWR_CR5_NOSMPS                                                     PWR_CR5_NOSMPS_Msk
#define PWR_CR5_SMPSFBYP_Pos                                               (9UL)    /*!<PWR CR5: SMPSFBYP (Bit 9) */
#define PWR_CR5_SMPSFBYP_Msk                                               (0x200UL)    /*!< PWR CR5: SMPSFBYP (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFBYP                                                   PWR_CR5_SMPSFBYP_Msk
#define PWR_CR5_SMPSLPOPEN_Pos                                             (8UL)    /*!<PWR CR5: SMPSLPOPEN (Bit 8) */
#define PWR_CR5_SMPSLPOPEN_Msk                                             (0x100UL)    /*!< PWR CR5: SMPSLPOPEN (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSLPOPEN                                                 PWR_CR5_SMPSLPOPEN_Msk
#define PWR_CR5_SMPSFRDY_Pos                                               (7UL)    /*!<PWR CR5: SMPSFRDY (Bit 7) */
#define PWR_CR5_SMPSFRDY_Msk                                               (0x80UL)   /*!< PWR CR5: SMPSFRDY (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFRDY                                                   PWR_CR5_SMPSFRDY_Msk
#define PWR_CR5_SMPSBOMSEL_Pos                                             (4UL)    /*!<PWR CR5: SMPSBOMSEL (Bit 4) */
#define PWR_CR5_SMPSBOMSEL_Msk                                             (0x30UL)   /*!< PWR CR5: SMPSBOMSEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPSBOMSEL                                                 PWR_CR5_SMPSBOMSEL_Msk
#define PWR_CR5_SMPSBOMSEL_0                                               (0x1U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSBOMSEL_1                                               (0x2U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSLVL_Pos                                                (0UL)    /*!<PWR CR5: SMPSLVL (Bit 0) */
#define PWR_CR5_SMPSLVL_Msk                                                (0xfUL)    /*!< PWR CR5: SMPSLVL (Bitfield-Mask: 0x0f) */
#define PWR_CR5_SMPSLVL                                                    PWR_CR5_SMPSLVL_Msk
#define PWR_CR5_SMPSLVL_0                                                  (0x1U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_1                                                  (0x2U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_2                                                  (0x4U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_3                                                  (0x8U << PWR_CR5_SMPSLVL_Pos)

/* =====================================================    PUCRA    ===================================================== */
#define PWR_PUCRA_PA15_Pos                                                 (15UL)   /*!<PWR PUCRA: PA15 (Bit 15) */
#define PWR_PUCRA_PA15_Msk                                                 (0x8000UL)   /*!< PWR PUCRA: PA15 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA15                                                     PWR_PUCRA_PA15_Msk
#define PWR_PUCRA_PA14_Pos                                                 (14UL)   /*!<PWR PUCRA: PA14 (Bit 14) */
#define PWR_PUCRA_PA14_Msk                                                 (0x4000UL)   /*!< PWR PUCRA: PA14 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA14                                                     PWR_PUCRA_PA14_Msk
#define PWR_PUCRA_PA13_Pos                                                 (13UL)   /*!<PWR PUCRA: PA13 (Bit 13) */
#define PWR_PUCRA_PA13_Msk                                                 (0x2000UL)   /*!< PWR PUCRA: PA13 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA13                                                     PWR_PUCRA_PA13_Msk
#define PWR_PUCRA_PA12_Pos                                                 (12UL)   /*!<PWR PUCRA: PA12 (Bit 12) */
#define PWR_PUCRA_PA12_Msk                                                 (0x1000UL)   /*!< PWR PUCRA: PA12 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA12                                                     PWR_PUCRA_PA12_Msk
#define PWR_PUCRA_PA11_Pos                                                 (11UL)   /*!<PWR PUCRA: PA11 (Bit 11) */
#define PWR_PUCRA_PA11_Msk                                                 (0x800UL)    /*!< PWR PUCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA11                                                     PWR_PUCRA_PA11_Msk
#define PWR_PUCRA_PA10_Pos                                                 (10UL)   /*!<PWR PUCRA: PA10 (Bit 10) */
#define PWR_PUCRA_PA10_Msk                                                 (0x400UL)    /*!< PWR PUCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA10                                                     PWR_PUCRA_PA10_Msk
#define PWR_PUCRA_PA9_Pos                                                  (9UL)    /*!<PWR PUCRA: PA9 (Bit 9) */
#define PWR_PUCRA_PA9_Msk                                                  (0x200UL)    /*!< PWR PUCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA9                                                      PWR_PUCRA_PA9_Msk
#define PWR_PUCRA_PA8_Pos                                                  (8UL)    /*!<PWR PUCRA: PA8 (Bit 8) */
#define PWR_PUCRA_PA8_Msk                                                  (0x100UL)    /*!< PWR PUCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA8                                                      PWR_PUCRA_PA8_Msk
#define PWR_PUCRA_PA7_Pos                                                  (7UL)    /*!<PWR PUCRA: PA7 (Bit 7) */
#define PWR_PUCRA_PA7_Msk                                                  (0x80UL)   /*!< PWR PUCRA: PA7 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA7                                                      PWR_PUCRA_PA7_Msk
#define PWR_PUCRA_PA6_Pos                                                  (6UL)    /*!<PWR PUCRA: PA6 (Bit 6) */
#define PWR_PUCRA_PA6_Msk                                                  (0x40UL)   /*!< PWR PUCRA: PA6 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA6                                                      PWR_PUCRA_PA6_Msk
#define PWR_PUCRA_PA5_Pos                                                  (5UL)    /*!<PWR PUCRA: PA5 (Bit 5) */
#define PWR_PUCRA_PA5_Msk                                                  (0x20UL)   /*!< PWR PUCRA: PA5 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA5                                                      PWR_PUCRA_PA5_Msk
#define PWR_PUCRA_PA4_Pos                                                  (4UL)    /*!<PWR PUCRA: PA4 (Bit 4) */
#define PWR_PUCRA_PA4_Msk                                                  (0x10UL)   /*!< PWR PUCRA: PA4 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA4                                                      PWR_PUCRA_PA4_Msk
#define PWR_PUCRA_PA3_Pos                                                  (3UL)    /*!<PWR PUCRA: PA3 (Bit 3) */
#define PWR_PUCRA_PA3_Msk                                                  (0x8UL)    /*!< PWR PUCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA3                                                      PWR_PUCRA_PA3_Msk
#define PWR_PUCRA_PA2_Pos                                                  (2UL)    /*!<PWR PUCRA: PA2 (Bit 2) */
#define PWR_PUCRA_PA2_Msk                                                  (0x4UL)    /*!< PWR PUCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA2                                                      PWR_PUCRA_PA2_Msk
#define PWR_PUCRA_PA1_Pos                                                  (1UL)    /*!<PWR PUCRA: PA1 (Bit 1) */
#define PWR_PUCRA_PA1_Msk                                                  (0x2UL)    /*!< PWR PUCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA1                                                      PWR_PUCRA_PA1_Msk
#define PWR_PUCRA_PA0_Pos                                                  (0UL)    /*!<PWR PUCRA: PA0 (Bit 0) */
#define PWR_PUCRA_PA0_Msk                                                  (0x1UL)    /*!< PWR PUCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PUCRA_PA0                                                      PWR_PUCRA_PA0_Msk

/* =====================================================    PDCRA    ===================================================== */
#define PWR_PDCRA_PA15_Pos                                                 (15UL)   /*!<PWR PDCRA: PA15 (Bit 15) */
#define PWR_PDCRA_PA15_Msk                                                 (0x8000UL)   /*!< PWR PDCRA: PA15 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA15                                                     PWR_PDCRA_PA15_Msk
#define PWR_PDCRA_PA14_Pos                                                 (14UL)   /*!<PWR PDCRA: PA14 (Bit 14) */
#define PWR_PDCRA_PA14_Msk                                                 (0x4000UL)   /*!< PWR PDCRA: PA14 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA14                                                     PWR_PDCRA_PA14_Msk
#define PWR_PDCRA_PA13_Pos                                                 (13UL)   /*!<PWR PDCRA: PA13 (Bit 13) */
#define PWR_PDCRA_PA13_Msk                                                 (0x2000UL)   /*!< PWR PDCRA: PA13 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA13                                                     PWR_PDCRA_PA13_Msk
#define PWR_PDCRA_PA12_Pos                                                 (12UL)   /*!<PWR PDCRA: PA12 (Bit 12) */
#define PWR_PDCRA_PA12_Msk                                                 (0x1000UL)   /*!< PWR PDCRA: PA12 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA12                                                     PWR_PDCRA_PA12_Msk
#define PWR_PDCRA_PA11_Pos                                                 (11UL)   /*!<PWR PDCRA: PA11 (Bit 11) */
#define PWR_PDCRA_PA11_Msk                                                 (0x800UL)    /*!< PWR PDCRA: PA11 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA11                                                     PWR_PDCRA_PA11_Msk
#define PWR_PDCRA_PA10_Pos                                                 (10UL)   /*!<PWR PDCRA: PA10 (Bit 10) */
#define PWR_PDCRA_PA10_Msk                                                 (0x400UL)    /*!< PWR PDCRA: PA10 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA10                                                     PWR_PDCRA_PA10_Msk
#define PWR_PDCRA_PA9_Pos                                                  (9UL)    /*!<PWR PDCRA: PA9 (Bit 9) */
#define PWR_PDCRA_PA9_Msk                                                  (0x200UL)    /*!< PWR PDCRA: PA9 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA9                                                      PWR_PDCRA_PA9_Msk
#define PWR_PDCRA_PA8_Pos                                                  (8UL)    /*!<PWR PDCRA: PA8 (Bit 8) */
#define PWR_PDCRA_PA8_Msk                                                  (0x100UL)    /*!< PWR PDCRA: PA8 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA8                                                      PWR_PDCRA_PA8_Msk
#define PWR_PDCRA_PA7_Pos                                                  (7UL)    /*!<PWR PDCRA: PA7 (Bit 7) */
#define PWR_PDCRA_PA7_Msk                                                  (0x80UL)   /*!< PWR PDCRA: PA7 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA7                                                      PWR_PDCRA_PA7_Msk
#define PWR_PDCRA_PA6_Pos                                                  (6UL)    /*!<PWR PDCRA: PA6 (Bit 6) */
#define PWR_PDCRA_PA6_Msk                                                  (0x40UL)   /*!< PWR PDCRA: PA6 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA6                                                      PWR_PDCRA_PA6_Msk
#define PWR_PDCRA_PA5_Pos                                                  (5UL)    /*!<PWR PDCRA: PA5 (Bit 5) */
#define PWR_PDCRA_PA5_Msk                                                  (0x20UL)   /*!< PWR PDCRA: PA5 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA5                                                      PWR_PDCRA_PA5_Msk
#define PWR_PDCRA_PA4_Pos                                                  (4UL)    /*!<PWR PDCRA: PA4 (Bit 4) */
#define PWR_PDCRA_PA4_Msk                                                  (0x10UL)   /*!< PWR PDCRA: PA4 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA4                                                      PWR_PDCRA_PA4_Msk
#define PWR_PDCRA_PA3_Pos                                                  (3UL)    /*!<PWR PDCRA: PA3 (Bit 3) */
#define PWR_PDCRA_PA3_Msk                                                  (0x8UL)    /*!< PWR PDCRA: PA3 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA3                                                      PWR_PDCRA_PA3_Msk
#define PWR_PDCRA_PA2_Pos                                                  (2UL)    /*!<PWR PDCRA: PA2 (Bit 2) */
#define PWR_PDCRA_PA2_Msk                                                  (0x4UL)    /*!< PWR PDCRA: PA2 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA2                                                      PWR_PDCRA_PA2_Msk
#define PWR_PDCRA_PA1_Pos                                                  (1UL)    /*!<PWR PDCRA: PA1 (Bit 1) */
#define PWR_PDCRA_PA1_Msk                                                  (0x2UL)    /*!< PWR PDCRA: PA1 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA1                                                      PWR_PDCRA_PA1_Msk
#define PWR_PDCRA_PA0_Pos                                                  (0UL)    /*!<PWR PDCRA: PA0 (Bit 0) */
#define PWR_PDCRA_PA0_Msk                                                  (0x1UL)    /*!< PWR PDCRA: PA0 (Bitfield-Mask: 0x01) */
#define PWR_PDCRA_PA0                                                      PWR_PDCRA_PA0_Msk

/* =====================================================    PUCRB    ===================================================== */
#define PWR_PUCRB_PB15_Pos                                                 (15UL)   /*!<PWR PUCRB: PB15 (Bit 15) */
#define PWR_PUCRB_PB15_Msk                                                 (0x8000UL)   /*!< PWR PUCRB: PB15 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB15                                                     PWR_PUCRB_PB15_Msk
#define PWR_PUCRB_PB14_Pos                                                 (14UL)   /*!<PWR PUCRB: PB14 (Bit 14) */
#define PWR_PUCRB_PB14_Msk                                                 (0x4000UL)   /*!< PWR PUCRB: PB14 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB14                                                     PWR_PUCRB_PB14_Msk
#define PWR_PUCRB_PB13_Pos                                                 (13UL)   /*!<PWR PUCRB: PB13 (Bit 13) */
#define PWR_PUCRB_PB13_Msk                                                 (0x2000UL)   /*!< PWR PUCRB: PB13 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB13                                                     PWR_PUCRB_PB13_Msk
#define PWR_PUCRB_PB12_Pos                                                 (12UL)   /*!<PWR PUCRB: PB12 (Bit 12) */
#define PWR_PUCRB_PB12_Msk                                                 (0x1000UL)   /*!< PWR PUCRB: PB12 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB12                                                     PWR_PUCRB_PB12_Msk
#define PWR_PUCRB_PB11_Pos                                                 (11UL)   /*!<PWR PUCRB: PB11 (Bit 11) */
#define PWR_PUCRB_PB11_Msk                                                 (0x800UL)    /*!< PWR PUCRB: PB11 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB11                                                     PWR_PUCRB_PB11_Msk
#define PWR_PUCRB_PB10_Pos                                                 (10UL)   /*!<PWR PUCRB: PB10 (Bit 10) */
#define PWR_PUCRB_PB10_Msk                                                 (0x400UL)    /*!< PWR PUCRB: PB10 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB10                                                     PWR_PUCRB_PB10_Msk
#define PWR_PUCRB_PB9_Pos                                                  (9UL)    /*!<PWR PUCRB: PB9 (Bit 9) */
#define PWR_PUCRB_PB9_Msk                                                  (0x200UL)    /*!< PWR PUCRB: PB9 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB9                                                      PWR_PUCRB_PB9_Msk
#define PWR_PUCRB_PB8_Pos                                                  (8UL)    /*!<PWR PUCRB: PB8 (Bit 8) */
#define PWR_PUCRB_PB8_Msk                                                  (0x100UL)    /*!< PWR PUCRB: PB8 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB8                                                      PWR_PUCRB_PB8_Msk
#define PWR_PUCRB_PB7_Pos                                                  (7UL)    /*!<PWR PUCRB: PB7 (Bit 7) */
#define PWR_PUCRB_PB7_Msk                                                  (0x80UL)   /*!< PWR PUCRB: PB7 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB7                                                      PWR_PUCRB_PB7_Msk
#define PWR_PUCRB_PB6_Pos                                                  (6UL)    /*!<PWR PUCRB: PB6 (Bit 6) */
#define PWR_PUCRB_PB6_Msk                                                  (0x40UL)   /*!< PWR PUCRB: PB6 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB6                                                      PWR_PUCRB_PB6_Msk
#define PWR_PUCRB_PB5_Pos                                                  (5UL)    /*!<PWR PUCRB: PB5 (Bit 5) */
#define PWR_PUCRB_PB5_Msk                                                  (0x20UL)   /*!< PWR PUCRB: PB5 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB5                                                      PWR_PUCRB_PB5_Msk
#define PWR_PUCRB_PB4_Pos                                                  (4UL)    /*!<PWR PUCRB: PB4 (Bit 4) */
#define PWR_PUCRB_PB4_Msk                                                  (0x10UL)   /*!< PWR PUCRB: PB4 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB4                                                      PWR_PUCRB_PB4_Msk
#define PWR_PUCRB_PB3_Pos                                                  (3UL)    /*!<PWR PUCRB: PB3 (Bit 3) */
#define PWR_PUCRB_PB3_Msk                                                  (0x8UL)    /*!< PWR PUCRB: PB3 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB3                                                      PWR_PUCRB_PB3_Msk
#define PWR_PUCRB_PB2_Pos                                                  (2UL)    /*!<PWR PUCRB: PB2 (Bit 2) */
#define PWR_PUCRB_PB2_Msk                                                  (0x4UL)    /*!< PWR PUCRB: PB2 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB2                                                      PWR_PUCRB_PB2_Msk
#define PWR_PUCRB_PB1_Pos                                                  (1UL)    /*!<PWR PUCRB: PB1 (Bit 1) */
#define PWR_PUCRB_PB1_Msk                                                  (0x2UL)    /*!< PWR PUCRB: PB1 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB1                                                      PWR_PUCRB_PB1_Msk
#define PWR_PUCRB_PB0_Pos                                                  (0UL)    /*!<PWR PUCRB: PB0 (Bit 0) */
#define PWR_PUCRB_PB0_Msk                                                  (0x1UL)    /*!< PWR PUCRB: PB0 (Bitfield-Mask: 0x01) */
#define PWR_PUCRB_PB0                                                      PWR_PUCRB_PB0_Msk

