stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    PDCRB    ===================================================== */
#define PWR_PDCRB_PB15_Pos                                                 (15UL)   /*!<PWR PDCRB: PB15 (Bit 15) */
#define PWR_PDCRB_PB15_Msk                                                 (0x8000UL)   /*!< PWR PDCRB: PB15 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB15                                                     PWR_PDCRB_PB15_Msk
#define PWR_PDCRB_PB14_Pos                                                 (14UL)   /*!<PWR PDCRB: PB14 (Bit 14) */
#define PWR_PDCRB_PB14_Msk                                                 (0x4000UL)   /*!< PWR PDCRB: PB14 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB14                                                     PWR_PDCRB_PB14_Msk
#define PWR_PDCRB_PB13_Pos                                                 (13UL)   /*!<PWR PDCRB: PB13 (Bit 13) */
#define PWR_PDCRB_PB13_Msk                                                 (0x2000UL)   /*!< PWR PDCRB: PB13 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB13                                                     PWR_PDCRB_PB13_Msk
#define PWR_PDCRB_PB12_Pos                                                 (12UL)   /*!<PWR PDCRB: PB12 (Bit 12) */
#define PWR_PDCRB_PB12_Msk                                                 (0x1000UL)   /*!< PWR PDCRB: PB12 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB12                                                     PWR_PDCRB_PB12_Msk
#define PWR_PDCRB_PB11_Pos                                                 (11UL)   /*!<PWR PDCRB: PB11 (Bit 11) */
#define PWR_PDCRB_PB11_Msk                                                 (0x800UL)    /*!< PWR PDCRB: PB11 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB11                                                     PWR_PDCRB_PB11_Msk
#define PWR_PDCRB_PB10_Pos                                                 (10UL)   /*!<PWR PDCRB: PB10 (Bit 10) */
#define PWR_PDCRB_PB10_Msk                                                 (0x400UL)    /*!< PWR PDCRB: PB10 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB10                                                     PWR_PDCRB_PB10_Msk
#define PWR_PDCRB_PB9_Pos                                                  (9UL)    /*!<PWR PDCRB: PB9 (Bit 9) */
#define PWR_PDCRB_PB9_Msk                                                  (0x200UL)    /*!< PWR PDCRB: PB9 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB9                                                      PWR_PDCRB_PB9_Msk
#define PWR_PDCRB_PB8_Pos                                                  (8UL)    /*!<PWR PDCRB: PB8 (Bit 8) */
#define PWR_PDCRB_PB8_Msk                                                  (0x100UL)    /*!< PWR PDCRB: PB8 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB8                                                      PWR_PDCRB_PB8_Msk
#define PWR_PDCRB_PB7_Pos                                                  (7UL)    /*!<PWR PDCRB: PB7 (Bit 7) */
#define PWR_PDCRB_PB7_Msk                                                  (0x80UL)   /*!< PWR PDCRB: PB7 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB7                                                      PWR_PDCRB_PB7_Msk
#define PWR_PDCRB_PB6_Pos                                                  (6UL)    /*!<PWR PDCRB: PB6 (Bit 6) */
#define PWR_PDCRB_PB6_Msk                                                  (0x40UL)   /*!< PWR PDCRB: PB6 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB6                                                      PWR_PDCRB_PB6_Msk
#define PWR_PDCRB_PB5_Pos                                                  (5UL)    /*!<PWR PDCRB: PB5 (Bit 5) */
#define PWR_PDCRB_PB5_Msk                                                  (0x20UL)   /*!< PWR PDCRB: PB5 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB5                                                      PWR_PDCRB_PB5_Msk
#define PWR_PDCRB_PB4_Pos                                                  (4UL)    /*!<PWR PDCRB: PB4 (Bit 4) */
#define PWR_PDCRB_PB4_Msk                                                  (0x10UL)   /*!< PWR PDCRB: PB4 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB4                                                      PWR_PDCRB_PB4_Msk
#define PWR_PDCRB_PB3_Pos                                                  (3UL)    /*!<PWR PDCRB: PB3 (Bit 3) */
#define PWR_PDCRB_PB3_Msk                                                  (0x8UL)    /*!< PWR PDCRB: PB3 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB3                                                      PWR_PDCRB_PB3_Msk
#define PWR_PDCRB_PB2_Pos                                                  (2UL)    /*!<PWR PDCRB: PB2 (Bit 2) */
#define PWR_PDCRB_PB2_Msk                                                  (0x4UL)    /*!< PWR PDCRB: PB2 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB2                                                      PWR_PDCRB_PB2_Msk
#define PWR_PDCRB_PB1_Pos                                                  (1UL)    /*!<PWR PDCRB: PB1 (Bit 1) */
#define PWR_PDCRB_PB1_Msk                                                  (0x2UL)    /*!< PWR PDCRB: PB1 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB1                                                      PWR_PDCRB_PB1_Msk
#define PWR_PDCRB_PB0_Pos                                                  (0UL)    /*!<PWR PDCRB: PB0 (Bit 0) */
#define PWR_PDCRB_PB0_Msk                                                  (0x1UL)    /*!< PWR PDCRB: PB0 (Bitfield-Mask: 0x01) */
#define PWR_PDCRB_PB0                                                      PWR_PDCRB_PB0_Msk

/* =====================================================    CR6    ===================================================== */
#define PWR_CR6_EWU27_Pos                                                  (15UL)   /*!<PWR CR6: EWU27 (Bit 15) */
#define PWR_CR6_EWU27_Msk                                                  (0x8000UL)   /*!< PWR CR6: EWU27 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU27                                                      PWR_CR6_EWU27_Msk
#define PWR_CR6_EWU26_Pos                                                  (14UL)   /*!<PWR CR6: EWU26 (Bit 14) */
#define PWR_CR6_EWU26_Msk                                                  (0x4000UL)   /*!< PWR CR6: EWU26 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU26                                                      PWR_CR6_EWU26_Msk
#define PWR_CR6_EWU25_Pos                                                  (13UL)   /*!<PWR CR6: EWU25 (Bit 13) */
#define PWR_CR6_EWU25_Msk                                                  (0x2000UL)   /*!< PWR CR6: EWU25 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU25                                                      PWR_CR6_EWU25_Msk
#define PWR_CR6_EWU24_Pos                                                  (12UL)   /*!<PWR CR6: EWU24 (Bit 12) */
#define PWR_CR6_EWU24_Msk                                                  (0x1000UL)   /*!< PWR CR6: EWU24 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU24                                                      PWR_CR6_EWU24_Msk
#define PWR_CR6_EWU23_Pos                                                  (11UL)   /*!<PWR CR6: EWU23 (Bit 11) */
#define PWR_CR6_EWU23_Msk                                                  (0x800UL)    /*!< PWR CR6: EWU23 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU23                                                      PWR_CR6_EWU23_Msk
#define PWR_CR6_EWU22_Pos                                                  (10UL)   /*!<PWR CR6: EWU22 (Bit 10) */
#define PWR_CR6_EWU22_Msk                                                  (0x400UL)    /*!< PWR CR6: EWU22 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU22                                                      PWR_CR6_EWU22_Msk
#define PWR_CR6_EWU21_Pos                                                  (9UL)    /*!<PWR CR6: EWU21 (Bit 9) */
#define PWR_CR6_EWU21_Msk                                                  (0x200UL)    /*!< PWR CR6: EWU21 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU21                                                      PWR_CR6_EWU21_Msk
#define PWR_CR6_EWU20_Pos                                                  (8UL)    /*!<PWR CR6: EWU20 (Bit 8) */
#define PWR_CR6_EWU20_Msk                                                  (0x100UL)    /*!< PWR CR6: EWU20 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU20                                                      PWR_CR6_EWU20_Msk
#define PWR_CR6_EWU19_Pos                                                  (7UL)    /*!<PWR CR6: EWU19 (Bit 7) */
#define PWR_CR6_EWU19_Msk                                                  (0x80UL)   /*!< PWR CR6: EWU19 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU19                                                      PWR_CR6_EWU19_Msk
#define PWR_CR6_EWU18_Pos                                                  (6UL)    /*!<PWR CR6: EWU18 (Bit 6) */
#define PWR_CR6_EWU18_Msk                                                  (0x40UL)   /*!< PWR CR6: EWU18 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU18                                                      PWR_CR6_EWU18_Msk
#define PWR_CR6_EWU17_Pos                                                  (5UL)    /*!<PWR CR6: EWU17 (Bit 5) */
#define PWR_CR6_EWU17_Msk                                                  (0x20UL)   /*!< PWR CR6: EWU17 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU17                                                      PWR_CR6_EWU17_Msk
#define PWR_CR6_EWU16_Pos                                                  (4UL)    /*!<PWR CR6: EWU16 (Bit 4) */
#define PWR_CR6_EWU16_Msk                                                  (0x10UL)   /*!< PWR CR6: EWU16 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU16                                                      PWR_CR6_EWU16_Msk
#define PWR_CR6_EWU15_Pos                                                  (3UL)    /*!<PWR CR6: EWU15 (Bit 3) */
#define PWR_CR6_EWU15_Msk                                                  (0x8UL)    /*!< PWR CR6: EWU15 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU15                                                      PWR_CR6_EWU15_Msk
#define PWR_CR6_EWU14_Pos                                                  (2UL)    /*!<PWR CR6: EWU14 (Bit 2) */
#define PWR_CR6_EWU14_Msk                                                  (0x4UL)    /*!< PWR CR6: EWU14 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU14                                                      PWR_CR6_EWU14_Msk
#define PWR_CR6_EWU13_Pos                                                  (1UL)    /*!<PWR CR6: EWU13 (Bit 1) */
#define PWR_CR6_EWU13_Msk                                                  (0x2UL)    /*!< PWR CR6: EWU13 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU13                                                      PWR_CR6_EWU13_Msk
#define PWR_CR6_EWU12_Pos                                                  (0UL)    /*!<PWR CR6: EWU12 (Bit 0) */
#define PWR_CR6_EWU12_Msk                                                  (0x1UL)    /*!< PWR CR6: EWU12 (Bitfield-Mask: 0x01) */
#define PWR_CR6_EWU12                                                      PWR_CR6_EWU12_Msk

/* =====================================================    CR7    ===================================================== */
#define PWR_CR7_WUP27_Pos                                                  (15UL)   /*!<PWR CR7: WUP27 (Bit 15) */
#define PWR_CR7_WUP27_Msk                                                  (0x8000UL)   /*!< PWR CR7: WUP27 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP27                                                      PWR_CR7_WUP27_Msk
#define PWR_CR7_WUP26_Pos                                                  (14UL)   /*!<PWR CR7: WUP26 (Bit 14) */
#define PWR_CR7_WUP26_Msk                                                  (0x4000UL)   /*!< PWR CR7: WUP26 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP26                                                      PWR_CR7_WUP26_Msk
#define PWR_CR7_WUP25_Pos                                                  (13UL)   /*!<PWR CR7: WUP25 (Bit 13) */
#define PWR_CR7_WUP25_Msk                                                  (0x2000UL)   /*!< PWR CR7: WUP25 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP25                                                      PWR_CR7_WUP25_Msk
#define PWR_CR7_WUP24_Pos                                                  (12UL)   /*!<PWR CR7: WUP24 (Bit 12) */
#define PWR_CR7_WUP24_Msk                                                  (0x1000UL)   /*!< PWR CR7: WUP24 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP24                                                      PWR_CR7_WUP24_Msk
#define PWR_CR7_WUP23_Pos                                                  (11UL)   /*!<PWR CR7: WUP23 (Bit 11) */
#define PWR_CR7_WUP23_Msk                                                  (0x800UL)    /*!< PWR CR7: WUP23 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP23                                                      PWR_CR7_WUP23_Msk
#define PWR_CR7_WUP22_Pos                                                  (10UL)   /*!<PWR CR7: WUP22 (Bit 10) */
#define PWR_CR7_WUP22_Msk                                                  (0x400UL)    /*!< PWR CR7: WUP22 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP22                                                      PWR_CR7_WUP22_Msk
#define PWR_CR7_WUP21_Pos                                                  (9UL)    /*!<PWR CR7: WUP21 (Bit 9) */
#define PWR_CR7_WUP21_Msk                                                  (0x200UL)    /*!< PWR CR7: WUP21 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP21                                                      PWR_CR7_WUP21_Msk
#define PWR_CR7_WUP20_Pos                                                  (8UL)    /*!<PWR CR7: WUP20 (Bit 8) */
#define PWR_CR7_WUP20_Msk                                                  (0x100UL)    /*!< PWR CR7: WUP20 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP20                                                      PWR_CR7_WUP20_Msk
#define PWR_CR7_WUP19_Pos                                                  (7UL)    /*!<PWR CR7: WUP19 (Bit 7) */
#define PWR_CR7_WUP19_Msk                                                  (0x80UL)   /*!< PWR CR7: WUP19 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP19                                                      PWR_CR7_WUP19_Msk
#define PWR_CR7_WUP18_Pos                                                  (6UL)    /*!<PWR CR7: WUP18 (Bit 6) */
#define PWR_CR7_WUP18_Msk                                                  (0x40UL)   /*!< PWR CR7: WUP18 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP18                                                      PWR_CR7_WUP18_Msk
#define PWR_CR7_WUP17_Pos                                                  (5UL)    /*!<PWR CR7: WUP17 (Bit 5) */
#define PWR_CR7_WUP17_Msk                                                  (0x20UL)   /*!< PWR CR7: WUP17 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP17                                                      PWR_CR7_WUP17_Msk
#define PWR_CR7_WUP16_Pos                                                  (4UL)    /*!<PWR CR7: WUP16 (Bit 4) */
#define PWR_CR7_WUP16_Msk                                                  (0x10UL)   /*!< PWR CR7: WUP16 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP16                                                      PWR_CR7_WUP16_Msk
#define PWR_CR7_WUP15_Pos                                                  (3UL)    /*!<PWR CR7: WUP15 (Bit 3) */
#define PWR_CR7_WUP15_Msk                                                  (0x8UL)    /*!< PWR CR7: WUP15 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP15                                                      PWR_CR7_WUP15_Msk
#define PWR_CR7_WUP14_Pos                                                  (2UL)    /*!<PWR CR7: WUP14 (Bit 2) */
#define PWR_CR7_WUP14_Msk                                                  (0x4UL)    /*!< PWR CR7: WUP14 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP14                                                      PWR_CR7_WUP14_Msk
#define PWR_CR7_WUP13_Pos                                                  (1UL)    /*!<PWR CR7: WUP13 (Bit 1) */
#define PWR_CR7_WUP13_Msk                                                  (0x2UL)    /*!< PWR CR7: WUP13 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP13                                                      PWR_CR7_WUP13_Msk
#define PWR_CR7_WUP12_Pos                                                  (0UL)    /*!<PWR CR7: WUP12 (Bit 0) */
#define PWR_CR7_WUP12_Msk                                                  (0x1UL)    /*!< PWR CR7: WUP12 (Bitfield-Mask: 0x01) */
#define PWR_CR7_WUP12                                                      PWR_CR7_WUP12_Msk

