stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    IO_IEVR    ===================================================== */
#define SYSCFG_IO_IEVR_PB15_IEV_Pos                                        (31UL)   /*!<SYSCFG IO_IEVR: PB15_IEV (Bit 31) */
#define SYSCFG_IO_IEVR_PB15_IEV_Msk                                        (0x80000000UL)   /*!< SYSCFG IO_IEVR: PB15_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB15_IEV                                            SYSCFG_IO_IEVR_PB15_IEV_Msk
#define SYSCFG_IO_IEVR_PB14_IEV_Pos                                        (30UL)   /*!<SYSCFG IO_IEVR: PB14_IEV (Bit 30) */
#define SYSCFG_IO_IEVR_PB14_IEV_Msk                                        (0x40000000UL)   /*!< SYSCFG IO_IEVR: PB14_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB14_IEV                                            SYSCFG_IO_IEVR_PB14_IEV_Msk
#define SYSCFG_IO_IEVR_PB13_IEV_Pos                                        (29UL)   /*!<SYSCFG IO_IEVR: PB13_IEV (Bit 29) */
#define SYSCFG_IO_IEVR_PB13_IEV_Msk                                        (0x20000000UL)   /*!< SYSCFG IO_IEVR: PB13_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB13_IEV                                            SYSCFG_IO_IEVR_PB13_IEV_Msk
#define SYSCFG_IO_IEVR_PB12_IEV_Pos                                        (28UL)   /*!<SYSCFG IO_IEVR: PB12_IEV (Bit 28) */
#define SYSCFG_IO_IEVR_PB12_IEV_Msk                                        (0x10000000UL)   /*!< SYSCFG IO_IEVR: PB12_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB12_IEV                                            SYSCFG_IO_IEVR_PB12_IEV_Msk
#define SYSCFG_IO_IEVR_PB11_IEV_Pos                                        (27UL)   /*!<SYSCFG IO_IEVR: PB11_IEV (Bit 27) */
#define SYSCFG_IO_IEVR_PB11_IEV_Msk                                        (0x8000000UL)    /*!< SYSCFG IO_IEVR: PB11_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB11_IEV                                            SYSCFG_IO_IEVR_PB11_IEV_Msk
#define SYSCFG_IO_IEVR_PB10_IEV_Pos                                        (26UL)   /*!<SYSCFG IO_IEVR: PB10_IEV (Bit 26) */
#define SYSCFG_IO_IEVR_PB10_IEV_Msk                                        (0x4000000UL)    /*!< SYSCFG IO_IEVR: PB10_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB10_IEV                                            SYSCFG_IO_IEVR_PB10_IEV_Msk
#define SYSCFG_IO_IEVR_PB9_IEV_Pos                                         (25UL)   /*!<SYSCFG IO_IEVR: PB9_IEV (Bit 25) */
#define SYSCFG_IO_IEVR_PB9_IEV_Msk                                         (0x2000000UL)    /*!< SYSCFG IO_IEVR: PB9_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB9_IEV                                             SYSCFG_IO_IEVR_PB9_IEV_Msk
#define SYSCFG_IO_IEVR_PB8_IEV_Pos                                         (24UL)   /*!<SYSCFG IO_IEVR: PB8_IEV (Bit 24) */
#define SYSCFG_IO_IEVR_PB8_IEV_Msk                                         (0x1000000UL)    /*!< SYSCFG IO_IEVR: PB8_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB8_IEV                                             SYSCFG_IO_IEVR_PB8_IEV_Msk
#define SYSCFG_IO_IEVR_PB7_IEV_Pos                                         (23UL)   /*!<SYSCFG IO_IEVR: PB7_IEV (Bit 23) */
#define SYSCFG_IO_IEVR_PB7_IEV_Msk                                         (0x800000UL)   /*!< SYSCFG IO_IEVR: PB7_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB7_IEV                                             SYSCFG_IO_IEVR_PB7_IEV_Msk
#define SYSCFG_IO_IEVR_PB6_IEV_Pos                                         (22UL)   /*!<SYSCFG IO_IEVR: PB6_IEV (Bit 22) */
#define SYSCFG_IO_IEVR_PB6_IEV_Msk                                         (0x400000UL)   /*!< SYSCFG IO_IEVR: PB6_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB6_IEV                                             SYSCFG_IO_IEVR_PB6_IEV_Msk
#define SYSCFG_IO_IEVR_PB5_IEV_Pos                                         (21UL)   /*!<SYSCFG IO_IEVR: PB5_IEV (Bit 21) */
#define SYSCFG_IO_IEVR_PB5_IEV_Msk                                         (0x200000UL)   /*!< SYSCFG IO_IEVR: PB5_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB5_IEV                                             SYSCFG_IO_IEVR_PB5_IEV_Msk
#define SYSCFG_IO_IEVR_PB4_IEV_Pos                                         (20UL)   /*!<SYSCFG IO_IEVR: PB4_IEV (Bit 20) */
#define SYSCFG_IO_IEVR_PB4_IEV_Msk                                         (0x100000UL)   /*!< SYSCFG IO_IEVR: PB4_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB4_IEV                                             SYSCFG_IO_IEVR_PB4_IEV_Msk
#define SYSCFG_IO_IEVR_PB3_IEV_Pos                                         (19UL)   /*!<SYSCFG IO_IEVR: PB3_IEV (Bit 19) */
#define SYSCFG_IO_IEVR_PB3_IEV_Msk                                         (0x80000UL)    /*!< SYSCFG IO_IEVR: PB3_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB3_IEV                                             SYSCFG_IO_IEVR_PB3_IEV_Msk
#define SYSCFG_IO_IEVR_PB2_IEV_Pos                                         (18UL)   /*!<SYSCFG IO_IEVR: PB2_IEV (Bit 18) */
#define SYSCFG_IO_IEVR_PB2_IEV_Msk                                         (0x40000UL)    /*!< SYSCFG IO_IEVR: PB2_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB2_IEV                                             SYSCFG_IO_IEVR_PB2_IEV_Msk
#define SYSCFG_IO_IEVR_PB1_IEV_Pos                                         (17UL)   /*!<SYSCFG IO_IEVR: PB1_IEV (Bit 17) */
#define SYSCFG_IO_IEVR_PB1_IEV_Msk                                         (0x20000UL)    /*!< SYSCFG IO_IEVR: PB1_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB1_IEV                                             SYSCFG_IO_IEVR_PB1_IEV_Msk
#define SYSCFG_IO_IEVR_PB0_IEV_Pos                                         (16UL)   /*!<SYSCFG IO_IEVR: PB0_IEV (Bit 16) */
#define SYSCFG_IO_IEVR_PB0_IEV_Msk                                         (0x10000UL)    /*!< SYSCFG IO_IEVR: PB0_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB0_IEV                                             SYSCFG_IO_IEVR_PB0_IEV_Msk
#define SYSCFG_IO_IEVR_PA15_IEV_Pos                                        (15UL)   /*!<SYSCFG IO_IEVR: PA15_IEV (Bit 15) */
#define SYSCFG_IO_IEVR_PA15_IEV_Msk                                        (0x8000UL)   /*!< SYSCFG IO_IEVR: PA15_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA15_IEV                                            SYSCFG_IO_IEVR_PA15_IEV_Msk
#define SYSCFG_IO_IEVR_PA14_IEV_Pos                                        (14UL)   /*!<SYSCFG IO_IEVR: PA14_IEV (Bit 14) */
#define SYSCFG_IO_IEVR_PA14_IEV_Msk                                        (0x4000UL)   /*!< SYSCFG IO_IEVR: PA14_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA14_IEV                                            SYSCFG_IO_IEVR_PA14_IEV_Msk
#define SYSCFG_IO_IEVR_PA13_IEV_Pos                                        (13UL)   /*!<SYSCFG IO_IEVR: PA13_IEV (Bit 13) */
#define SYSCFG_IO_IEVR_PA13_IEV_Msk                                        (0x2000UL)   /*!< SYSCFG IO_IEVR: PA13_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA13_IEV                                            SYSCFG_IO_IEVR_PA13_IEV_Msk
#define SYSCFG_IO_IEVR_PA12_IEV_Pos                                        (12UL)   /*!<SYSCFG IO_IEVR: PA12_IEV (Bit 12) */
#define SYSCFG_IO_IEVR_PA12_IEV_Msk                                        (0x1000UL)   /*!< SYSCFG IO_IEVR: PA12_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA12_IEV                                            SYSCFG_IO_IEVR_PA12_IEV_Msk
#define SYSCFG_IO_IEVR_PA11_IEV_Pos                                        (11UL)   /*!<SYSCFG IO_IEVR: PA11_IEV (Bit 11) */
#define SYSCFG_IO_IEVR_PA11_IEV_Msk                                        (0x800UL)    /*!< SYSCFG IO_IEVR: PA11_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA11_IEV                                            SYSCFG_IO_IEVR_PA11_IEV_Msk
#define SYSCFG_IO_IEVR_PA10_IEV_Pos                                        (10UL)   /*!<SYSCFG IO_IEVR: PA10_IEV (Bit 10) */
#define SYSCFG_IO_IEVR_PA10_IEV_Msk                                        (0x400UL)    /*!< SYSCFG IO_IEVR: PA10_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA10_IEV                                            SYSCFG_IO_IEVR_PA10_IEV_Msk
#define SYSCFG_IO_IEVR_PA9_IEV_Pos                                         (9UL)    /*!<SYSCFG IO_IEVR: PA9_IEV (Bit 9) */
#define SYSCFG_IO_IEVR_PA9_IEV_Msk                                         (0x200UL)    /*!< SYSCFG IO_IEVR: PA9_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA9_IEV                                             SYSCFG_IO_IEVR_PA9_IEV_Msk
#define SYSCFG_IO_IEVR_PA8_IEV_Pos                                         (8UL)    /*!<SYSCFG IO_IEVR: PA8_IEV (Bit 8) */
#define SYSCFG_IO_IEVR_PA8_IEV_Msk                                         (0x100UL)    /*!< SYSCFG IO_IEVR: PA8_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA8_IEV                                             SYSCFG_IO_IEVR_PA8_IEV_Msk
#define SYSCFG_IO_IEVR_PA7_IEV_Pos                                         (7UL)    /*!<SYSCFG IO_IEVR: PA7_IEV (Bit 7) */
#define SYSCFG_IO_IEVR_PA7_IEV_Msk                                         (0x80UL)   /*!< SYSCFG IO_IEVR: PA7_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA7_IEV                                             SYSCFG_IO_IEVR_PA7_IEV_Msk
#define SYSCFG_IO_IEVR_PA6_IEV_Pos                                         (6UL)    /*!<SYSCFG IO_IEVR: PA6_IEV (Bit 6) */
#define SYSCFG_IO_IEVR_PA6_IEV_Msk                                         (0x40UL)   /*!< SYSCFG IO_IEVR: PA6_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA6_IEV                                             SYSCFG_IO_IEVR_PA6_IEV_Msk
#define SYSCFG_IO_IEVR_PA5_IEV_Pos                                         (5UL)    /*!<SYSCFG IO_IEVR: PA5_IEV (Bit 5) */
#define SYSCFG_IO_IEVR_PA5_IEV_Msk                                         (0x20UL)   /*!< SYSCFG IO_IEVR: PA5_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA5_IEV                                             SYSCFG_IO_IEVR_PA5_IEV_Msk
#define SYSCFG_IO_IEVR_PA4_IEV_Pos                                         (4UL)    /*!<SYSCFG IO_IEVR: PA4_IEV (Bit 4) */
#define SYSCFG_IO_IEVR_PA4_IEV_Msk                                         (0x10UL)   /*!< SYSCFG IO_IEVR: PA4_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA4_IEV                                             SYSCFG_IO_IEVR_PA4_IEV_Msk
#define SYSCFG_IO_IEVR_PA3_IEV_Pos                                         (3UL)    /*!<SYSCFG IO_IEVR: PA3_IEV (Bit 3) */
#define SYSCFG_IO_IEVR_PA3_IEV_Msk                                         (0x8UL)    /*!< SYSCFG IO_IEVR: PA3_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA3_IEV                                             SYSCFG_IO_IEVR_PA3_IEV_Msk
#define SYSCFG_IO_IEVR_PA2_IEV_Pos                                         (2UL)    /*!<SYSCFG IO_IEVR: PA2_IEV (Bit 2) */
#define SYSCFG_IO_IEVR_PA2_IEV_Msk                                         (0x4UL)    /*!< SYSCFG IO_IEVR: PA2_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA2_IEV                                             SYSCFG_IO_IEVR_PA2_IEV_Msk
#define SYSCFG_IO_IEVR_PA1_IEV_Pos                                         (1UL)    /*!<SYSCFG IO_IEVR: PA1_IEV (Bit 1) */
#define SYSCFG_IO_IEVR_PA1_IEV_Msk                                         (0x2UL)    /*!< SYSCFG IO_IEVR: PA1_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA1_IEV                                             SYSCFG_IO_IEVR_PA1_IEV_Msk
#define SYSCFG_IO_IEVR_PA0_IEV_Pos                                         (0UL)    /*!<SYSCFG IO_IEVR: PA0_IEV (Bit 0) */
#define SYSCFG_IO_IEVR_PA0_IEV_Msk                                         (0x1UL)    /*!< SYSCFG IO_IEVR: PA0_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA0_IEV                                             SYSCFG_IO_IEVR_PA0_IEV_Msk

/* =====================================================    IO_IER    ===================================================== */
#define SYSCFG_IO_IER_PB15_IE_Pos                                          (31UL)   /*!<SYSCFG IO_IER: PB15_IE (Bit 31) */
#define SYSCFG_IO_IER_PB15_IE_Msk                                          (0x80000000UL)   /*!< SYSCFG IO_IER: PB15_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB15_IE                                              SYSCFG_IO_IER_PB15_IE_Msk
#define SYSCFG_IO_IER_PB14_IE_Pos                                          (30UL)   /*!<SYSCFG IO_IER: PB14_IE (Bit 30) */
#define SYSCFG_IO_IER_PB14_IE_Msk                                          (0x40000000UL)   /*!< SYSCFG IO_IER: PB14_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB14_IE                                              SYSCFG_IO_IER_PB14_IE_Msk
#define SYSCFG_IO_IER_PB13_IE_Pos                                          (29UL)   /*!<SYSCFG IO_IER: PB13_IE (Bit 29) */
#define SYSCFG_IO_IER_PB13_IE_Msk                                          (0x20000000UL)   /*!< SYSCFG IO_IER: PB13_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB13_IE                                              SYSCFG_IO_IER_PB13_IE_Msk
#define SYSCFG_IO_IER_PB12_IE_Pos                                          (28UL)   /*!<SYSCFG IO_IER: PB12_IE (Bit 28) */
#define SYSCFG_IO_IER_PB12_IE_Msk                                          (0x10000000UL)   /*!< SYSCFG IO_IER: PB12_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB12_IE                                              SYSCFG_IO_IER_PB12_IE_Msk
#define SYSCFG_IO_IER_PB11_IE_Pos                                          (27UL)   /*!<SYSCFG IO_IER: PB11_IE (Bit 27) */
#define SYSCFG_IO_IER_PB11_IE_Msk                                          (0x8000000UL)    /*!< SYSCFG IO_IER: PB11_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB11_IE                                              SYSCFG_IO_IER_PB11_IE_Msk
#define SYSCFG_IO_IER_PB10_IE_Pos                                          (26UL)   /*!<SYSCFG IO_IER: PB10_IE (Bit 26) */
#define SYSCFG_IO_IER_PB10_IE_Msk                                          (0x4000000UL)    /*!< SYSCFG IO_IER: PB10_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB10_IE                                              SYSCFG_IO_IER_PB10_IE_Msk
#define SYSCFG_IO_IER_PB9_IE_Pos                                           (25UL)   /*!<SYSCFG IO_IER: PB9_IE (Bit 25) */
#define SYSCFG_IO_IER_PB9_IE_Msk                                           (0x2000000UL)    /*!< SYSCFG IO_IER: PB9_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB9_IE                                               SYSCFG_IO_IER_PB9_IE_Msk
#define SYSCFG_IO_IER_PB8_IE_Pos                                           (24UL)   /*!<SYSCFG IO_IER: PB8_IE (Bit 24) */
#define SYSCFG_IO_IER_PB8_IE_Msk                                           (0x1000000UL)    /*!< SYSCFG IO_IER: PB8_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB8_IE                                               SYSCFG_IO_IER_PB8_IE_Msk
#define SYSCFG_IO_IER_PB7_IE_Pos                                           (23UL)   /*!<SYSCFG IO_IER: PB7_IE (Bit 23) */
#define SYSCFG_IO_IER_PB7_IE_Msk                                           (0x800000UL)   /*!< SYSCFG IO_IER: PB7_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB7_IE                                               SYSCFG_IO_IER_PB7_IE_Msk
#define SYSCFG_IO_IER_PB6_IE_Pos                                           (22UL)   /*!<SYSCFG IO_IER: PB6_IE (Bit 22) */
#define SYSCFG_IO_IER_PB6_IE_Msk                                           (0x400000UL)   /*!< SYSCFG IO_IER: PB6_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB6_IE                                               SYSCFG_IO_IER_PB6_IE_Msk
#define SYSCFG_IO_IER_PB5_IE_Pos                                           (21UL)   /*!<SYSCFG IO_IER: PB5_IE (Bit 21) */
#define SYSCFG_IO_IER_PB5_IE_Msk                                           (0x200000UL)   /*!< SYSCFG IO_IER: PB5_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB5_IE                                               SYSCFG_IO_IER_PB5_IE_Msk
#define SYSCFG_IO_IER_PB4_IE_Pos                                           (20UL)   /*!<SYSCFG IO_IER: PB4_IE (Bit 20) */
#define SYSCFG_IO_IER_PB4_IE_Msk                                           (0x100000UL)   /*!< SYSCFG IO_IER: PB4_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB4_IE                                               SYSCFG_IO_IER_PB4_IE_Msk
#define SYSCFG_IO_IER_PB3_IE_Pos                                           (19UL)   /*!<SYSCFG IO_IER: PB3_IE (Bit 19) */
#define SYSCFG_IO_IER_PB3_IE_Msk                                           (0x80000UL)    /*!< SYSCFG IO_IER: PB3_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB3_IE                                               SYSCFG_IO_IER_PB3_IE_Msk
#define SYSCFG_IO_IER_PB2_IE_Pos                                           (18UL)   /*!<SYSCFG IO_IER: PB2_IE (Bit 18) */
#define SYSCFG_IO_IER_PB2_IE_Msk                                           (0x40000UL)    /*!< SYSCFG IO_IER: PB2_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB2_IE                                               SYSCFG_IO_IER_PB2_IE_Msk
#define SYSCFG_IO_IER_PB1_IE_Pos                                           (17UL)   /*!<SYSCFG IO_IER: PB1_IE (Bit 17) */
#define SYSCFG_IO_IER_PB1_IE_Msk                                           (0x20000UL)    /*!< SYSCFG IO_IER: PB1_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB1_IE                                               SYSCFG_IO_IER_PB1_IE_Msk
#define SYSCFG_IO_IER_PB0_IE_Pos                                           (16UL)   /*!<SYSCFG IO_IER: PB0_IE (Bit 16) */
#define SYSCFG_IO_IER_PB0_IE_Msk                                           (0x10000UL)    /*!< SYSCFG IO_IER: PB0_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PB0_IE                                               SYSCFG_IO_IER_PB0_IE_Msk
#define SYSCFG_IO_IER_PA15_IE_Pos                                          (15UL)   /*!<SYSCFG IO_IER: PA15_IE (Bit 15) */
#define SYSCFG_IO_IER_PA15_IE_Msk                                          (0x8000UL)   /*!< SYSCFG IO_IER: PA15_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA15_IE                                              SYSCFG_IO_IER_PA15_IE_Msk
#define SYSCFG_IO_IER_PA14_IE_Pos                                          (14UL)   /*!<SYSCFG IO_IER: PA14_IE (Bit 14) */
#define SYSCFG_IO_IER_PA14_IE_Msk                                          (0x4000UL)   /*!< SYSCFG IO_IER: PA14_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA14_IE                                              SYSCFG_IO_IER_PA14_IE_Msk
#define SYSCFG_IO_IER_PA13_IE_Pos                                          (13UL)   /*!<SYSCFG IO_IER: PA13_IE (Bit 13) */
#define SYSCFG_IO_IER_PA13_IE_Msk                                          (0x2000UL)   /*!< SYSCFG IO_IER: PA13_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA13_IE                                              SYSCFG_IO_IER_PA13_IE_Msk
#define SYSCFG_IO_IER_PA12_IE_Pos                                          (12UL)   /*!<SYSCFG IO_IER: PA12_IE (Bit 12) */
#define SYSCFG_IO_IER_PA12_IE_Msk                                          (0x1000UL)   /*!< SYSCFG IO_IER: PA12_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA12_IE                                              SYSCFG_IO_IER_PA12_IE_Msk
#define SYSCFG_IO_IER_PA11_IE_Pos                                          (11UL)   /*!<SYSCFG IO_IER: PA11_IE (Bit 11) */
#define SYSCFG_IO_IER_PA11_IE_Msk                                          (0x800UL)    /*!< SYSCFG IO_IER: PA11_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA11_IE                                              SYSCFG_IO_IER_PA11_IE_Msk
#define SYSCFG_IO_IER_PA10_IE_Pos                                          (10UL)   /*!<SYSCFG IO_IER: PA10_IE (Bit 10) */
#define SYSCFG_IO_IER_PA10_IE_Msk                                          (0x400UL)    /*!< SYSCFG IO_IER: PA10_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA10_IE                                              SYSCFG_IO_IER_PA10_IE_Msk
#define SYSCFG_IO_IER_PA9_IE_Pos                                           (9UL)    /*!<SYSCFG IO_IER: PA9_IE (Bit 9) */
#define SYSCFG_IO_IER_PA9_IE_Msk                                           (0x200UL)    /*!< SYSCFG IO_IER: PA9_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA9_IE                                               SYSCFG_IO_IER_PA9_IE_Msk
#define SYSCFG_IO_IER_PA8_IE_Pos                                           (8UL)    /*!<SYSCFG IO_IER: PA8_IE (Bit 8) */
#define SYSCFG_IO_IER_PA8_IE_Msk                                           (0x100UL)    /*!< SYSCFG IO_IER: PA8_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA8_IE                                               SYSCFG_IO_IER_PA8_IE_Msk
#define SYSCFG_IO_IER_PA7_IE_Pos                                           (7UL)    /*!<SYSCFG IO_IER: PA7_IE (Bit 7) */
#define SYSCFG_IO_IER_PA7_IE_Msk                                           (0x80UL)   /*!< SYSCFG IO_IER: PA7_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA7_IE                                               SYSCFG_IO_IER_PA7_IE_Msk
#define SYSCFG_IO_IER_PA6_IE_Pos                                           (6UL)    /*!<SYSCFG IO_IER: PA6_IE (Bit 6) */
#define SYSCFG_IO_IER_PA6_IE_Msk                                           (0x40UL)   /*!< SYSCFG IO_IER: PA6_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA6_IE                                               SYSCFG_IO_IER_PA6_IE_Msk
#define SYSCFG_IO_IER_PA5_IE_Pos                                           (5UL)    /*!<SYSCFG IO_IER: PA5_IE (Bit 5) */
#define SYSCFG_IO_IER_PA5_IE_Msk                                           (0x20UL)   /*!< SYSCFG IO_IER: PA5_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA5_IE                                               SYSCFG_IO_IER_PA5_IE_Msk
#define SYSCFG_IO_IER_PA4_IE_Pos                                           (4UL)    /*!<SYSCFG IO_IER: PA4_IE (Bit 4) */
#define SYSCFG_IO_IER_PA4_IE_Msk                                           (0x10UL)   /*!< SYSCFG IO_IER: PA4_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA4_IE                                               SYSCFG_IO_IER_PA4_IE_Msk
#define SYSCFG_IO_IER_PA3_IE_Pos                                           (3UL)    /*!<SYSCFG IO_IER: PA3_IE (Bit 3) */
#define SYSCFG_IO_IER_PA3_IE_Msk                                           (0x8UL)    /*!< SYSCFG IO_IER: PA3_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA3_IE                                               SYSCFG_IO_IER_PA3_IE_Msk
#define SYSCFG_IO_IER_PA2_IE_Pos                                           (2UL)    /*!<SYSCFG IO_IER: PA2_IE (Bit 2) */
#define SYSCFG_IO_IER_PA2_IE_Msk                                           (0x4UL)    /*!< SYSCFG IO_IER: PA2_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA2_IE                                               SYSCFG_IO_IER_PA2_IE_Msk
#define SYSCFG_IO_IER_PA1_IE_Pos                                           (1UL)    /*!<SYSCFG IO_IER: PA1_IE (Bit 1) */
#define SYSCFG_IO_IER_PA1_IE_Msk                                           (0x2UL)    /*!< SYSCFG IO_IER: PA1_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA1_IE                                               SYSCFG_IO_IER_PA1_IE_Msk
#define SYSCFG_IO_IER_PA0_IE_Pos                                           (0UL)    /*!<SYSCFG IO_IER: PA0_IE (Bit 0) */
#define SYSCFG_IO_IER_PA0_IE_Msk                                           (0x1UL)    /*!< SYSCFG IO_IER: PA0_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IER_PA0_IE                                               SYSCFG_IO_IER_PA0_IE_Msk

