stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    PUPDR    ===================================================== */
#define GPIO_PUPDR_PUPD15_Pos                                              (30UL)   /*!<GPIO PUPDR: PUPD15 (Bit 30) */
#define GPIO_PUPDR_PUPD15_Msk                                              (0xc0000000UL)   /*!< GPIO PUPDR: PUPD15 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD15                                                  GPIO_PUPDR_PUPD15_Msk
#define GPIO_PUPDR_PUPD15_0                                                (0x1U << GPIO_PUPDR_PUPD15_Pos)
#define GPIO_PUPDR_PUPD15_1                                                (0x2U << GPIO_PUPDR_PUPD15_Pos)
#define GPIO_PUPDR_PUPD14_Pos                                              (28UL)   /*!<GPIO PUPDR: PUPD14 (Bit 28) */
#define GPIO_PUPDR_PUPD14_Msk                                              (0x30000000UL)   /*!< GPIO PUPDR: PUPD14 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD14                                                  GPIO_PUPDR_PUPD14_Msk
#define GPIO_PUPDR_PUPD14_0                                                (0x1U << GPIO_PUPDR_PUPD14_Pos)
#define GPIO_PUPDR_PUPD14_1                                                (0x2U << GPIO_PUPDR_PUPD14_Pos)
#define GPIO_PUPDR_PUPD13_Pos                                              (26UL)   /*!<GPIO PUPDR: PUPD13 (Bit 26) */
#define GPIO_PUPDR_PUPD13_Msk                                              (0xc000000UL)    /*!< GPIO PUPDR: PUPD13 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD13                                                  GPIO_PUPDR_PUPD13_Msk
#define GPIO_PUPDR_PUPD13_0                                                (0x1U << GPIO_PUPDR_PUPD13_Pos)
#define GPIO_PUPDR_PUPD13_1                                                (0x2U << GPIO_PUPDR_PUPD13_Pos)
#define GPIO_PUPDR_PUPD12_Pos                                              (24UL)   /*!<GPIO PUPDR: PUPD12 (Bit 24) */
#define GPIO_PUPDR_PUPD12_Msk                                              (0x3000000UL)    /*!< GPIO PUPDR: PUPD12 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD12                                                  GPIO_PUPDR_PUPD12_Msk
#define GPIO_PUPDR_PUPD12_0                                                (0x1U << GPIO_PUPDR_PUPD12_Pos)
#define GPIO_PUPDR_PUPD12_1                                                (0x2U << GPIO_PUPDR_PUPD12_Pos)
#define GPIO_PUPDR_PUPD11_Pos                                              (22UL)   /*!<GPIO PUPDR: PUPD11 (Bit 22) */
#define GPIO_PUPDR_PUPD11_Msk                                              (0xc00000UL)   /*!< GPIO PUPDR: PUPD11 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD11                                                  GPIO_PUPDR_PUPD11_Msk
#define GPIO_PUPDR_PUPD11_0                                                (0x1U << GPIO_PUPDR_PUPD11_Pos)
#define GPIO_PUPDR_PUPD11_1                                                (0x2U << GPIO_PUPDR_PUPD11_Pos)
#define GPIO_PUPDR_PUPD10_Pos                                              (20UL)   /*!<GPIO PUPDR: PUPD10 (Bit 20) */
#define GPIO_PUPDR_PUPD10_Msk                                              (0x300000UL)   /*!< GPIO PUPDR: PUPD10 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD10                                                  GPIO_PUPDR_PUPD10_Msk
#define GPIO_PUPDR_PUPD10_0                                                (0x1U << GPIO_PUPDR_PUPD10_Pos)
#define GPIO_PUPDR_PUPD10_1                                                (0x2U << GPIO_PUPDR_PUPD10_Pos)
#define GPIO_PUPDR_PUPD9_Pos                                               (18UL)   /*!<GPIO PUPDR: PUPD9 (Bit 18) */
#define GPIO_PUPDR_PUPD9_Msk                                               (0xc0000UL)    /*!< GPIO PUPDR: PUPD9 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD9                                                   GPIO_PUPDR_PUPD9_Msk
#define GPIO_PUPDR_PUPD9_0                                                 (0x1U << GPIO_PUPDR_PUPD9_Pos)
#define GPIO_PUPDR_PUPD9_1                                                 (0x2U << GPIO_PUPDR_PUPD9_Pos)
#define GPIO_PUPDR_PUPD8_Pos                                               (16UL)   /*!<GPIO PUPDR: PUPD8 (Bit 16) */
#define GPIO_PUPDR_PUPD8_Msk                                               (0x30000UL)    /*!< GPIO PUPDR: PUPD8 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD8                                                   GPIO_PUPDR_PUPD8_Msk
#define GPIO_PUPDR_PUPD8_0                                                 (0x1U << GPIO_PUPDR_PUPD8_Pos)
#define GPIO_PUPDR_PUPD8_1                                                 (0x2U << GPIO_PUPDR_PUPD8_Pos)
#define GPIO_PUPDR_PUPD7_Pos                                               (14UL)   /*!<GPIO PUPDR: PUPD7 (Bit 14) */
#define GPIO_PUPDR_PUPD7_Msk                                               (0xc000UL)   /*!< GPIO PUPDR: PUPD7 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD7                                                   GPIO_PUPDR_PUPD7_Msk
#define GPIO_PUPDR_PUPD7_0                                                 (0x1U << GPIO_PUPDR_PUPD7_Pos)
#define GPIO_PUPDR_PUPD7_1                                                 (0x2U << GPIO_PUPDR_PUPD7_Pos)
#define GPIO_PUPDR_PUPD6_Pos                                               (12UL)   /*!<GPIO PUPDR: PUPD6 (Bit 12) */
#define GPIO_PUPDR_PUPD6_Msk                                               (0x3000UL)   /*!< GPIO PUPDR: PUPD6 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD6                                                   GPIO_PUPDR_PUPD6_Msk
#define GPIO_PUPDR_PUPD6_0                                                 (0x1U << GPIO_PUPDR_PUPD6_Pos)
#define GPIO_PUPDR_PUPD6_1                                                 (0x2U << GPIO_PUPDR_PUPD6_Pos)
#define GPIO_PUPDR_PUPD5_Pos                                               (10UL)   /*!<GPIO PUPDR: PUPD5 (Bit 10) */
#define GPIO_PUPDR_PUPD5_Msk                                               (0xc00UL)    /*!< GPIO PUPDR: PUPD5 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD5                                                   GPIO_PUPDR_PUPD5_Msk
#define GPIO_PUPDR_PUPD5_0                                                 (0x1U << GPIO_PUPDR_PUPD5_Pos)
#define GPIO_PUPDR_PUPD5_1                                                 (0x2U << GPIO_PUPDR_PUPD5_Pos)
#define GPIO_PUPDR_PUPD4_Pos                                               (8UL)    /*!<GPIO PUPDR: PUPD4 (Bit 8) */
#define GPIO_PUPDR_PUPD4_Msk                                               (0x300UL)    /*!< GPIO PUPDR: PUPD4 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD4                                                   GPIO_PUPDR_PUPD4_Msk
#define GPIO_PUPDR_PUPD4_0                                                 (0x1U << GPIO_PUPDR_PUPD4_Pos)
#define GPIO_PUPDR_PUPD4_1                                                 (0x2U << GPIO_PUPDR_PUPD4_Pos)
#define GPIO_PUPDR_PUPD3_Pos                                               (6UL)    /*!<GPIO PUPDR: PUPD3 (Bit 6) */
#define GPIO_PUPDR_PUPD3_Msk                                               (0xc0UL)   /*!< GPIO PUPDR: PUPD3 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD3                                                   GPIO_PUPDR_PUPD3_Msk
#define GPIO_PUPDR_PUPD3_0                                                 (0x1U << GPIO_PUPDR_PUPD3_Pos)
#define GPIO_PUPDR_PUPD3_1                                                 (0x2U << GPIO_PUPDR_PUPD3_Pos)
#define GPIO_PUPDR_PUPD2_Pos                                               (4UL)    /*!<GPIO PUPDR: PUPD2 (Bit 4) */
#define GPIO_PUPDR_PUPD2_Msk                                               (0x30UL)   /*!< GPIO PUPDR: PUPD2 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD2                                                   GPIO_PUPDR_PUPD2_Msk
#define GPIO_PUPDR_PUPD2_0                                                 (0x1U << GPIO_PUPDR_PUPD2_Pos)
#define GPIO_PUPDR_PUPD2_1                                                 (0x2U << GPIO_PUPDR_PUPD2_Pos)
#define GPIO_PUPDR_PUPD1_Pos                                               (2UL)    /*!<GPIO PUPDR: PUPD1 (Bit 2) */
#define GPIO_PUPDR_PUPD1_Msk                                               (0xcUL)    /*!< GPIO PUPDR: PUPD1 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD1                                                   GPIO_PUPDR_PUPD1_Msk
#define GPIO_PUPDR_PUPD1_0                                                 (0x1U << GPIO_PUPDR_PUPD1_Pos)
#define GPIO_PUPDR_PUPD1_1                                                 (0x2U << GPIO_PUPDR_PUPD1_Pos)
#define GPIO_PUPDR_PUPD0_Pos                                               (0UL)    /*!<GPIO PUPDR: PUPD0 (Bit 0) */
#define GPIO_PUPDR_PUPD0_Msk                                               (0x3UL)    /*!< GPIO PUPDR: PUPD0 (Bitfield-Mask: 0x03) */
#define GPIO_PUPDR_PUPD0                                                   GPIO_PUPDR_PUPD0_Msk
#define GPIO_PUPDR_PUPD0_0                                                 (0x1U << GPIO_PUPDR_PUPD0_Pos)
#define GPIO_PUPDR_PUPD0_1                                                 (0x2U << GPIO_PUPDR_PUPD0_Pos)

