stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    CCMR1    ===================================================== */
#define TIM_CCMR1_OC2CE_Pos                                                (15UL)   /*!<TIM CCMR1: OC2CE (Bit 15) */
#define TIM_CCMR1_OC2CE_Msk                                                (0x8000UL)   /*!< TIM CCMR1: OC2CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC2CE                                                    TIM_CCMR1_OC2CE_Msk
#define TIM_CCMR1_OC2M_Pos                                                 (12UL)   /*!<TIM CCMR1: OC2M (Bit 12) */
#define TIM_CCMR1_OC2M_Msk                                                 (0x1007000UL)    /*!< TIM CCMR1: OC2M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR1_OC2M                                                     TIM_CCMR1_OC2M_Msk
#define TIM_CCMR1_OC2M_0                                                   (0x1U << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR1_OC2M_1                                                   (0x2U << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR1_OC2M_2                                                   (0x4U << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR1_OC2M_3                                                   (0x1000U << TIM_CCMR1_OC2M_Pos)
#define TIM_CCMR1_OC2PE_Pos                                                (11UL)   /*!<TIM CCMR1: OC2PE (Bit 11) */
#define TIM_CCMR1_OC2PE_Msk                                                (0x800UL)    /*!< TIM CCMR1: OC2PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC2PE                                                    TIM_CCMR1_OC2PE_Msk
#define TIM_CCMR1_OC2FE_Pos                                                (10UL)   /*!<TIM CCMR1: OC2FE (Bit 10) */
#define TIM_CCMR1_OC2FE_Msk                                                (0x400UL)    /*!< TIM CCMR1: OC2FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC2FE                                                    TIM_CCMR1_OC2FE_Msk
#define TIM_CCMR1_CC2S_Pos                                                 (8UL)    /*!<TIM CCMR1: CC2S (Bit 8) */
#define TIM_CCMR1_CC2S_Msk                                                 (0x300UL)    /*!< TIM CCMR1: CC2S (Bitfield-Mask: 0x03) */
#define TIM_CCMR1_CC2S                                                     TIM_CCMR1_CC2S_Msk
#define TIM_CCMR1_CC2S_0                                                   (0x1U << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR1_CC2S_1                                                   (0x2U << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR1_OC1CE_Pos                                                (7UL)    /*!<TIM CCMR1: OC1CE (Bit 7) */
#define TIM_CCMR1_OC1CE_Msk                                                (0x80UL)   /*!< TIM CCMR1: OC1CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC1CE                                                    TIM_CCMR1_OC1CE_Msk
#define TIM_CCMR1_OC1M_Pos                                                 (4UL)    /*!<TIM CCMR1: OC1M (Bit 4) */
#define TIM_CCMR1_OC1M_Msk                                                 (0x10070UL)    /*!< TIM CCMR1: OC1M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR1_OC1M                                                     TIM_CCMR1_OC1M_Msk
#define TIM_CCMR1_OC1M_0                                                   (0x1U << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC1M_1                                                   (0x2U << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC1M_2                                                   (0x4U << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC1M_3                                                   (0x1000U << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC1PE_Pos                                                (3UL)    /*!<TIM CCMR1: OC1PE (Bit 3) */
#define TIM_CCMR1_OC1PE_Msk                                                (0x8UL)    /*!< TIM CCMR1: OC1PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC1PE                                                    TIM_CCMR1_OC1PE_Msk
#define TIM_CCMR1_OC1FE_Pos                                                (2UL)    /*!<TIM CCMR1: OC1FE (Bit 2) */
#define TIM_CCMR1_OC1FE_Msk                                                (0x4UL)    /*!< TIM CCMR1: OC1FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR1_OC1FE                                                    TIM_CCMR1_OC1FE_Msk
#define TIM_CCMR1_CC1S_Pos                                                 (0UL)    /*!<TIM CCMR1: CC1S (Bit 0) */
#define TIM_CCMR1_CC1S_Msk                                                 (0x3UL)    /*!< TIM CCMR1: CC1S (Bitfield-Mask: 0x03) */
#define TIM_CCMR1_CC1S                                                     TIM_CCMR1_CC1S_Msk
#define TIM_CCMR1_CC1S_0                                                   (0x1U << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC1S_1                                                   (0x2U << TIM_CCMR1_CC1S_Pos)

/* =====================================================    CCMR1    ===================================================== */
#define TIM_CCMR1_IC2F_Pos                                                 (12UL)   /*!<TIM CCMR1: IC2F (Bit 12) */
#define TIM_CCMR1_IC2F_Msk                                                 (0xf000UL)   /*!< TIM CCMR1: IC2F (Bitfield-Mask: 0x0f) */
#define TIM_CCMR1_IC2F                                                     TIM_CCMR1_IC2F_Msk
#define TIM_CCMR1_IC2F_0                                                   (0x1U << TIM_CCMR1_IC2F_Pos)
#define TIM_CCMR1_IC2F_1                                                   (0x2U << TIM_CCMR1_IC2F_Pos)
#define TIM_CCMR1_IC2F_2                                                   (0x4U << TIM_CCMR1_IC2F_Pos)
#define TIM_CCMR1_IC2F_3                                                   (0x8U << TIM_CCMR1_IC2F_Pos)
#define TIM_CCMR1_IC2PSC_Pos                                               (10UL)   /*!<TIM CCMR1: IC2PSC (Bit 10) */
#define TIM_CCMR1_IC2PSC_Msk                                               (0xc00UL)    /*!< TIM CCMR1: IC2PSC (Bitfield-Mask: 0x03) */
#define TIM_CCMR1_IC2PSC                                                   TIM_CCMR1_IC2PSC_Msk
#define TIM_CCMR1_IC2PSC_0                                                 (0x1U << TIM_CCMR1_IC2PSC_Pos)
#define TIM_CCMR1_IC2PSC_1                                                 (0x2U << TIM_CCMR1_IC2PSC_Pos)
#define TIM_CCMR1_IC1F_Pos                                                 (4UL)    /*!<TIM CCMR1: IC1F (Bit 4) */
#define TIM_CCMR1_IC1F_Msk                                                 (0xf0UL)   /*!< TIM CCMR1: IC1F (Bitfield-Mask: 0x0f) */
#define TIM_CCMR1_IC1F                                                     TIM_CCMR1_IC1F_Msk
#define TIM_CCMR1_IC1F_0                                                   (0x1U << TIM_CCMR1_IC1F_Pos)
#define TIM_CCMR1_IC1F_1                                                   (0x2U << TIM_CCMR1_IC1F_Pos)
#define TIM_CCMR1_IC1F_2                                                   (0x4U << TIM_CCMR1_IC1F_Pos)
#define TIM_CCMR1_IC1F_3                                                   (0x8U << TIM_CCMR1_IC1F_Pos)
#define TIM_CCMR1_IC1PSC_Pos                                               (2UL)    /*!<TIM CCMR1: IC1PSC (Bit 2) */
#define TIM_CCMR1_IC1PSC_Msk                                               (0xcUL)    /*!< TIM CCMR1: IC1PSC (Bitfield-Mask: 0x03) */
#define TIM_CCMR1_IC1PSC                                                   TIM_CCMR1_IC1PSC_Msk
#define TIM_CCMR1_IC1PSC_0                                                 (0x1U << TIM_CCMR1_IC1PSC_Pos)
#define TIM_CCMR1_IC1PSC_1                                                 (0x2U << TIM_CCMR1_IC1PSC_Pos)

/* =====================================================    CCMR2    ===================================================== */
#define TIM_CCMR2_OC4CE_Pos                                                (15UL)   /*!<TIM CCMR2: OC4CE (Bit 15) */
#define TIM_CCMR2_OC4CE_Msk                                                (0x8000UL)   /*!< TIM CCMR2: OC4CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC4CE                                                    TIM_CCMR2_OC4CE_Msk
#define TIM_CCMR2_OC4M_Pos                                                 (12UL)   /*!<TIM CCMR2: OC4M (Bit 12) */
#define TIM_CCMR2_OC4M_Msk                                                 (0x1007000UL)    /*!< TIM CCMR2: OC4M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR2_OC4M                                                     TIM_CCMR2_OC4M_Msk
#define TIM_CCMR2_OC4M_0                                                   (0x1U << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR2_OC4M_1                                                   (0x2U << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR2_OC4M_2                                                   (0x4U << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR2_OC4M_3                                                   (0x1000U << TIM_CCMR2_OC4M_Pos)
#define TIM_CCMR2_OC4PE_Pos                                                (11UL)   /*!<TIM CCMR2: OC4PE (Bit 11) */
#define TIM_CCMR2_OC4PE_Msk                                                (0x800UL)    /*!< TIM CCMR2: OC4PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC4PE                                                    TIM_CCMR2_OC4PE_Msk
#define TIM_CCMR2_OC4FE_Pos                                                (10UL)   /*!<TIM CCMR2: OC4FE (Bit 10) */
#define TIM_CCMR2_OC4FE_Msk                                                (0x400UL)    /*!< TIM CCMR2: OC4FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC4FE                                                    TIM_CCMR2_OC4FE_Msk
#define TIM_CCMR2_CC4S_Pos                                                 (8UL)    /*!<TIM CCMR2: CC4S (Bit 8) */
#define TIM_CCMR2_CC4S_Msk                                                 (0x300UL)    /*!< TIM CCMR2: CC4S (Bitfield-Mask: 0x03) */
#define TIM_CCMR2_CC4S                                                     TIM_CCMR2_CC4S_Msk
#define TIM_CCMR2_CC4S_0                                                   (0x1U << TIM_CCMR2_CC4S_Pos)
#define TIM_CCMR2_CC4S_1                                                   (0x2U << TIM_CCMR2_CC4S_Pos)
#define TIM_CCMR2_OC3CE_Pos                                                (7UL)    /*!<TIM CCMR2: OC3CE (Bit 7) */
#define TIM_CCMR2_OC3CE_Msk                                                (0x80UL)   /*!< TIM CCMR2: OC3CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC3CE                                                    TIM_CCMR2_OC3CE_Msk
#define TIM_CCMR2_OC3M_Pos                                                 (4UL)    /*!<TIM CCMR2: OC3M (Bit 4) */
#define TIM_CCMR2_OC3M_Msk                                                 (0x10070UL)    /*!< TIM CCMR2: OC3M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR2_OC3M                                                     TIM_CCMR2_OC3M_Msk
#define TIM_CCMR2_OC3M_0                                                   (0x1U << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC3M_1                                                   (0x2U << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC3M_2                                                   (0x4U << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC3M_3                                                   (0x1000U << TIM_CCMR2_OC3M_Pos)
#define TIM_CCMR2_OC3PE_Pos                                                (3UL)    /*!<TIM CCMR2: OC3PE (Bit 3) */
#define TIM_CCMR2_OC3PE_Msk                                                (0x8UL)    /*!< TIM CCMR2: OC3PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC3PE                                                    TIM_CCMR2_OC3PE_Msk
#define TIM_CCMR2_OC3FE_Pos                                                (2UL)    /*!<TIM CCMR2: OC3FE (Bit 2) */
#define TIM_CCMR2_OC3FE_Msk                                                (0x4UL)    /*!< TIM CCMR2: OC3FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR2_OC3FE                                                    TIM_CCMR2_OC3FE_Msk
#define TIM_CCMR2_CC3S_Pos                                                 (0UL)    /*!<TIM CCMR2: CC3S (Bit 0) */
#define TIM_CCMR2_CC3S_Msk                                                 (0x3UL)    /*!< TIM CCMR2: CC3S (Bitfield-Mask: 0x03) */
#define TIM_CCMR2_CC3S                                                     TIM_CCMR2_CC3S_Msk
#define TIM_CCMR2_CC3S_0                                                   (0x1U << TIM_CCMR2_CC3S_Pos)
#define TIM_CCMR2_CC3S_1                                                   (0x2U << TIM_CCMR2_CC3S_Pos)

/* =====================================================    CCMR2    ===================================================== */
#define TIM_CCMR2_IC4F_Pos                                                 (12UL)   /*!<TIM CCMR2: IC4F (Bit 12) */
#define TIM_CCMR2_IC4F_Msk                                                 (0xf000UL)   /*!< TIM CCMR2: IC4F (Bitfield-Mask: 0x0f) */
#define TIM_CCMR2_IC4F                                                     TIM_CCMR2_IC4F_Msk
#define TIM_CCMR2_IC4F_0                                                   (0x1U << TIM_CCMR2_IC4F_Pos)
#define TIM_CCMR2_IC4F_1                                                   (0x2U << TIM_CCMR2_IC4F_Pos)
#define TIM_CCMR2_IC4F_2                                                   (0x4U << TIM_CCMR2_IC4F_Pos)
#define TIM_CCMR2_IC4F_3                                                   (0x8U << TIM_CCMR2_IC4F_Pos)
#define TIM_CCMR2_IC4PSC_Pos                                               (10UL)   /*!<TIM CCMR2: IC4PSC (Bit 10) */
#define TIM_CCMR2_IC4PSC_Msk                                               (0xc00UL)    /*!< TIM CCMR2: IC4PSC (Bitfield-Mask: 0x03) */
#define TIM_CCMR2_IC4PSC                                                   TIM_CCMR2_IC4PSC_Msk
#define TIM_CCMR2_IC4PSC_0                                                 (0x1U << TIM_CCMR2_IC4PSC_Pos)
#define TIM_CCMR2_IC4PSC_1                                                 (0x2U << TIM_CCMR2_IC4PSC_Pos)
#define TIM_CCMR2_IC3F_Pos                                                 (4UL)    /*!<TIM CCMR2: IC3F (Bit 4) */
#define TIM_CCMR2_IC3F_Msk                                                 (0xf0UL)   /*!< TIM CCMR2: IC3F (Bitfield-Mask: 0x0f) */
#define TIM_CCMR2_IC3F                                                     TIM_CCMR2_IC3F_Msk
#define TIM_CCMR2_IC3F_0                                                   (0x1U << TIM_CCMR2_IC3F_Pos)
#define TIM_CCMR2_IC3F_1                                                   (0x2U << TIM_CCMR2_IC3F_Pos)
#define TIM_CCMR2_IC3F_2                                                   (0x4U << TIM_CCMR2_IC3F_Pos)
#define TIM_CCMR2_IC3F_3                                                   (0x8U << TIM_CCMR2_IC3F_Pos)
#define TIM_CCMR2_IC3PSC_Pos                                               (2UL)    /*!<TIM CCMR2: IC3PSC (Bit 2) */
#define TIM_CCMR2_IC3PSC_Msk                                               (0xcUL)    /*!< TIM CCMR2: IC3PSC (Bitfield-Mask: 0x03) */
#define TIM_CCMR2_IC3PSC                                                   TIM_CCMR2_IC3PSC_Msk
#define TIM_CCMR2_IC3PSC_0                                                 (0x1U << TIM_CCMR2_IC3PSC_Pos)
#define TIM_CCMR2_IC3PSC_1                                                 (0x2U << TIM_CCMR2_IC3PSC_Pos)

/* =====================================================    CCER    ===================================================== */
#define TIM_CCER_CC6P_Pos                                                  (21UL)   /*!<TIM CCER: CC6P (Bit 21) */
#define TIM_CCER_CC6P_Msk                                                  (0x200000UL)   /*!< TIM CCER: CC6P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC6P                                                      TIM_CCER_CC6P_Msk
#define TIM_CCER_CC6E_Pos                                                  (20UL)   /*!<TIM CCER: CC6E (Bit 20) */
#define TIM_CCER_CC6E_Msk                                                  (0x100000UL)   /*!< TIM CCER: CC6E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC6E                                                      TIM_CCER_CC6E_Msk
#define TIM_CCER_CC5P_Pos                                                  (17UL)   /*!<TIM CCER: CC5P (Bit 17) */
#define TIM_CCER_CC5P_Msk                                                  (0x20000UL)    /*!< TIM CCER: CC5P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC5P                                                      TIM_CCER_CC5P_Msk
#define TIM_CCER_CC5E_Pos                                                  (16UL)   /*!<TIM CCER: CC5E (Bit 16) */
#define TIM_CCER_CC5E_Msk                                                  (0x10000UL)    /*!< TIM CCER: CC5E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC5E                                                      TIM_CCER_CC5E_Msk
#define TIM_CCER_CC4NP_Pos                                                 (15UL)   /*!<TIM CCER: CC4NP (Bit 15) */
#define TIM_CCER_CC4NP_Msk                                                 (0x8000UL)   /*!< TIM CCER: CC4NP (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC4NP                                                     TIM_CCER_CC4NP_Msk
#define TIM_CCER_CC4NE_Pos                                                 (14UL)   /*!<TIM CCER: CC4NE (Bit 14) */
#define TIM_CCER_CC4NE_Msk                                                 (0x4000UL)   /*!< TIM CCER: CC4NE (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC4NE                                                     TIM_CCER_CC4NE_Msk
#define TIM_CCER_CC4P_Pos                                                  (13UL)   /*!<TIM CCER: CC4P (Bit 13) */
#define TIM_CCER_CC4P_Msk                                                  (0x2000UL)   /*!< TIM CCER: CC4P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC4P                                                      TIM_CCER_CC4P_Msk
#define TIM_CCER_CC4E_Pos                                                  (12UL)   /*!<TIM CCER: CC4E (Bit 12) */
#define TIM_CCER_CC4E_Msk                                                  (0x1000UL)   /*!< TIM CCER: CC4E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC4E                                                      TIM_CCER_CC4E_Msk
#define TIM_CCER_CC3NP_Pos                                                 (11UL)   /*!<TIM CCER: CC3NP (Bit 11) */
#define TIM_CCER_CC3NP_Msk                                                 (0x800UL)    /*!< TIM CCER: CC3NP (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC3NP                                                     TIM_CCER_CC3NP_Msk
#define TIM_CCER_CC3NE_Pos                                                 (10UL)   /*!<TIM CCER: CC3NE (Bit 10) */
#define TIM_CCER_CC3NE_Msk                                                 (0x400UL)    /*!< TIM CCER: CC3NE (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC3NE                                                     TIM_CCER_CC3NE_Msk
#define TIM_CCER_CC3P_Pos                                                  (9UL)    /*!<TIM CCER: CC3P (Bit 9) */
#define TIM_CCER_CC3P_Msk                                                  (0x200UL)    /*!< TIM CCER: CC3P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC3P                                                      TIM_CCER_CC3P_Msk
#define TIM_CCER_CC3E_Pos                                                  (8UL)    /*!<TIM CCER: CC3E (Bit 8) */
#define TIM_CCER_CC3E_Msk                                                  (0x100UL)    /*!< TIM CCER: CC3E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC3E                                                      TIM_CCER_CC3E_Msk
#define TIM_CCER_CC2NP_Pos                                                 (7UL)    /*!<TIM CCER: CC2NP (Bit 7) */
#define TIM_CCER_CC2NP_Msk                                                 (0x80UL)   /*!< TIM CCER: CC2NP (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC2NP                                                     TIM_CCER_CC2NP_Msk
#define TIM_CCER_CC2NE_Pos                                                 (6UL)    /*!<TIM CCER: CC2NE (Bit 6) */
#define TIM_CCER_CC2NE_Msk                                                 (0x40UL)   /*!< TIM CCER: CC2NE (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC2NE                                                     TIM_CCER_CC2NE_Msk
#define TIM_CCER_CC2P_Pos                                                  (5UL)    /*!<TIM CCER: CC2P (Bit 5) */
#define TIM_CCER_CC2P_Msk                                                  (0x20UL)   /*!< TIM CCER: CC2P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC2P                                                      TIM_CCER_CC2P_Msk
#define TIM_CCER_CC2E_Pos                                                  (4UL)    /*!<TIM CCER: CC2E (Bit 4) */
#define TIM_CCER_CC2E_Msk                                                  (0x10UL)   /*!< TIM CCER: CC2E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC2E                                                      TIM_CCER_CC2E_Msk
#define TIM_CCER_CC1NP_Pos                                                 (3UL)    /*!<TIM CCER: CC1NP (Bit 3) */
#define TIM_CCER_CC1NP_Msk                                                 (0x8UL)    /*!< TIM CCER: CC1NP (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC1NP                                                     TIM_CCER_CC1NP_Msk
#define TIM_CCER_CC1NE_Pos                                                 (2UL)    /*!<TIM CCER: CC1NE (Bit 2) */
#define TIM_CCER_CC1NE_Msk                                                 (0x4UL)    /*!< TIM CCER: CC1NE (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC1NE                                                     TIM_CCER_CC1NE_Msk
#define TIM_CCER_CC1P_Pos                                                  (1UL)    /*!<TIM CCER: CC1P (Bit 1) */
#define TIM_CCER_CC1P_Msk                                                  (0x2UL)    /*!< TIM CCER: CC1P (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC1P                                                      TIM_CCER_CC1P_Msk
#define TIM_CCER_CC1E_Pos                                                  (0UL)    /*!<TIM CCER: CC1E (Bit 0) */
#define TIM_CCER_CC1E_Msk                                                  (0x1UL)    /*!< TIM CCER: CC1E (Bitfield-Mask: 0x01) */
#define TIM_CCER_CC1E                                                      TIM_CCER_CC1E_Msk

