stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    CNT    ===================================================== */
#define TIM_CNT_UIFCPY_Pos                                                 (31UL)   /*!<TIM CNT: UIFCPY (Bit 31) */
#define TIM_CNT_UIFCPY_Msk                                                 (0x80000000UL)   /*!< TIM CNT: UIFCPY (Bitfield-Mask: 0x01) */
#define TIM_CNT_UIFCPY                                                     TIM_CNT_UIFCPY_Msk
#define TIM_CNT_CNT_Pos                                                    (0UL)    /*!<TIM CNT: CNT (Bit 0) */
#define TIM_CNT_CNT_Msk                                                    (0xffffUL)   /*!< TIM CNT: CNT (Bitfield-Mask: 0xffff) */
#define TIM_CNT_CNT                                                        TIM_CNT_CNT_Msk
#define TIM_CNT_CNT_0                                                      (0x1U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_1                                                      (0x2U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_2                                                      (0x4U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_3                                                      (0x8U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_4                                                      (0x10U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_5                                                      (0x20U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_6                                                      (0x40U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_7                                                      (0x80U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_8                                                      (0x100U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_9                                                      (0x200U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_10                                                     (0x400U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_11                                                     (0x800U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_12                                                     (0x1000U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_13                                                     (0x2000U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_14                                                     (0x4000U << TIM_CNT_CNT_Pos)
#define TIM_CNT_CNT_15                                                     (0x8000U << TIM_CNT_CNT_Pos)

/* =====================================================    PSC    ===================================================== */
#define TIM_PSC_PSC_Pos                                                    (0UL)    /*!<TIM PSC: PSC (Bit 0) */
#define TIM_PSC_PSC_Msk                                                    (0xffffUL)   /*!< TIM PSC: PSC (Bitfield-Mask: 0xffff) */
#define TIM_PSC_PSC                                                        TIM_PSC_PSC_Msk
#define TIM_PSC_PSC_0                                                      (0x1U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_1                                                      (0x2U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_2                                                      (0x4U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_3                                                      (0x8U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_4                                                      (0x10U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_5                                                      (0x20U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_6                                                      (0x40U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_7                                                      (0x80U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_8                                                      (0x100U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_9                                                      (0x200U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_10                                                     (0x400U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_11                                                     (0x800U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_12                                                     (0x1000U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_13                                                     (0x2000U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_14                                                     (0x4000U << TIM_PSC_PSC_Pos)
#define TIM_PSC_PSC_15                                                     (0x8000U << TIM_PSC_PSC_Pos)

/* =====================================================    ARR    ===================================================== */
#define TIM_ARR_ARR_Pos                                                    (0UL)    /*!<TIM ARR: ARR (Bit 0) */
#define TIM_ARR_ARR_Msk                                                    (0xffffUL)   /*!< TIM ARR: ARR (Bitfield-Mask: 0xffff) */
#define TIM_ARR_ARR                                                        TIM_ARR_ARR_Msk
#define TIM_ARR_ARR_0                                                      (0x1U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_1                                                      (0x2U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_2                                                      (0x4U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_3                                                      (0x8U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_4                                                      (0x10U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_5                                                      (0x20U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_6                                                      (0x40U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_7                                                      (0x80U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_8                                                      (0x100U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_9                                                      (0x200U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_10                                                     (0x400U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_11                                                     (0x800U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_12                                                     (0x1000U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_13                                                     (0x2000U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_14                                                     (0x4000U << TIM_ARR_ARR_Pos)
#define TIM_ARR_ARR_15                                                     (0x8000U << TIM_ARR_ARR_Pos)

/* =====================================================    RCR    ===================================================== */
#define TIM_RCR_REP_Pos                                                    (0UL)    /*!<TIM RCR: REP (Bit 0) */
#define TIM_RCR_REP_Msk                                                    (0xffffUL)   /*!< TIM RCR: REP (Bitfield-Mask: 0xffff) */
#define TIM_RCR_REP                                                        TIM_RCR_REP_Msk
#define TIM_RCR_REP_0                                                      (0x1U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_1                                                      (0x2U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_2                                                      (0x4U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_3                                                      (0x8U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_4                                                      (0x10U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_5                                                      (0x20U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_6                                                      (0x40U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_7                                                      (0x80U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_8                                                      (0x100U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_9                                                      (0x200U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_10                                                     (0x400U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_11                                                     (0x800U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_12                                                     (0x1000U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_13                                                     (0x2000U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_14                                                     (0x4000U << TIM_RCR_REP_Pos)
#define TIM_RCR_REP_15                                                     (0x8000U << TIM_RCR_REP_Pos)

/* =====================================================    CCR1    ===================================================== */
#define TIM_CCR1_CCR1_Pos                                                  (0UL)    /*!<TIM CCR1: CCR1 (Bit 0) */
#define TIM_CCR1_CCR1_Msk                                                  (0xffffUL)   /*!< TIM CCR1: CCR1 (Bitfield-Mask: 0xffff) */
#define TIM_CCR1_CCR1                                                      TIM_CCR1_CCR1_Msk
#define TIM_CCR1_CCR1_0                                                    (0x1U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_1                                                    (0x2U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_2                                                    (0x4U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_3                                                    (0x8U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_4                                                    (0x10U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_5                                                    (0x20U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_6                                                    (0x40U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_7                                                    (0x80U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_8                                                    (0x100U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_9                                                    (0x200U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_10                                                   (0x400U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_11                                                   (0x800U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_12                                                   (0x1000U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_13                                                   (0x2000U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_14                                                   (0x4000U << TIM_CCR1_CCR1_Pos)
#define TIM_CCR1_CCR1_15                                                   (0x8000U << TIM_CCR1_CCR1_Pos)

