stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    CR2    ===================================================== */
#define USART_CR2_ADD_Pos                                                  (24UL)   /*!<USART CR2: ADD (Bit 24) */
#define USART_CR2_ADD_Msk                                                  (0xff000000UL)   /*!< USART CR2: ADD (Bitfield-Mask: 0xff) */
#define USART_CR2_ADD                                                      USART_CR2_ADD_Msk
#define USART_CR2_ADD_0                                                    (0x1U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_1                                                    (0x2U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_2                                                    (0x4U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_3                                                    (0x8U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_4                                                    (0x10U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_5                                                    (0x20U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_6                                                    (0x40U << USART_CR2_ADD_Pos)
#define USART_CR2_ADD_7                                                    (0x80U << USART_CR2_ADD_Pos)
#define USART_CR2_RTOEN_Pos                                                (23UL)   /*!<USART CR2: RTOEN (Bit 23) */
#define USART_CR2_RTOEN_Msk                                                (0x800000UL)   /*!< USART CR2: RTOEN (Bitfield-Mask: 0x01) */
#define USART_CR2_RTOEN                                                    USART_CR2_RTOEN_Msk
#define USART_CR2_ABRMODE_Pos                                              (21UL)   /*!<USART CR2: ABRMODE (Bit 21) */
#define USART_CR2_ABRMODE_Msk                                              (0x600000UL)   /*!< USART CR2: ABRMODE (Bitfield-Mask: 0x03) */
#define USART_CR2_ABRMODE                                                  USART_CR2_ABRMODE_Msk
#define USART_CR2_ABRMODE_0                                                (0x1U << USART_CR2_ABRMODE_Pos)
#define USART_CR2_ABRMODE_1                                                (0x2U << USART_CR2_ABRMODE_Pos)
#define USART_CR2_ABREN_Pos                                                (20UL)   /*!<USART CR2: ABREN (Bit 20) */
#define USART_CR2_ABREN_Msk                                                (0x100000UL)   /*!< USART CR2: ABREN (Bitfield-Mask: 0x01) */
#define USART_CR2_ABREN                                                    USART_CR2_ABREN_Msk
#define USART_CR2_MSBFIRST_Pos                                             (19UL)   /*!<USART CR2: MSBFIRST (Bit 19) */
#define USART_CR2_MSBFIRST_Msk                                             (0x80000UL)    /*!< USART CR2: MSBFIRST (Bitfield-Mask: 0x01) */
#define USART_CR2_MSBFIRST                                                 USART_CR2_MSBFIRST_Msk
#define USART_CR2_DATAINV_Pos                                              (18UL)   /*!<USART CR2: DATAINV (Bit 18) */
#define USART_CR2_DATAINV_Msk                                              (0x40000UL)    /*!< USART CR2: DATAINV (Bitfield-Mask: 0x01) */
#define USART_CR2_DATAINV                                                  USART_CR2_DATAINV_Msk
#define USART_CR2_TXINV_Pos                                                (17UL)   /*!<USART CR2: TXINV (Bit 17) */
#define USART_CR2_TXINV_Msk                                                (0x20000UL)    /*!< USART CR2: TXINV (Bitfield-Mask: 0x01) */
#define USART_CR2_TXINV                                                    USART_CR2_TXINV_Msk
#define USART_CR2_RXINV_Pos                                                (16UL)   /*!<USART CR2: RXINV (Bit 16) */
#define USART_CR2_RXINV_Msk                                                (0x10000UL)    /*!< USART CR2: RXINV (Bitfield-Mask: 0x01) */
#define USART_CR2_RXINV                                                    USART_CR2_RXINV_Msk
#define USART_CR2_SWAP_Pos                                                 (15UL)   /*!<USART CR2: SWAP (Bit 15) */
#define USART_CR2_SWAP_Msk                                                 (0x8000UL)   /*!< USART CR2: SWAP (Bitfield-Mask: 0x01) */
#define USART_CR2_SWAP                                                     USART_CR2_SWAP_Msk
#define USART_CR2_LINEN_Pos                                                (14UL)   /*!<USART CR2: LINEN (Bit 14) */
#define USART_CR2_LINEN_Msk                                                (0x4000UL)   /*!< USART CR2: LINEN (Bitfield-Mask: 0x01) */
#define USART_CR2_LINEN                                                    USART_CR2_LINEN_Msk
#define USART_CR2_STOP_Pos                                                 (12UL)   /*!<USART CR2: STOP (Bit 12) */
#define USART_CR2_STOP_Msk                                                 (0x3000UL)   /*!< USART CR2: STOP (Bitfield-Mask: 0x03) */
#define USART_CR2_STOP                                                     USART_CR2_STOP_Msk
#define USART_CR2_STOP_0                                                   (0x1U << USART_CR2_STOP_Pos)
#define USART_CR2_STOP_1                                                   (0x2U << USART_CR2_STOP_Pos)
#define USART_CR2_CLKEN_Pos                                                (11UL)   /*!<USART CR2: CLKEN (Bit 11) */
#define USART_CR2_CLKEN_Msk                                                (0x800UL)    /*!< USART CR2: CLKEN (Bitfield-Mask: 0x01) */
#define USART_CR2_CLKEN                                                    USART_CR2_CLKEN_Msk
#define USART_CR2_CPOL_Pos                                                 (10UL)   /*!<USART CR2: CPOL (Bit 10) */
#define USART_CR2_CPOL_Msk                                                 (0x400UL)    /*!< USART CR2: CPOL (Bitfield-Mask: 0x01) */
#define USART_CR2_CPOL                                                     USART_CR2_CPOL_Msk
#define USART_CR2_CPHA_Pos                                                 (9UL)    /*!<USART CR2: CPHA (Bit 9) */
#define USART_CR2_CPHA_Msk                                                 (0x200UL)    /*!< USART CR2: CPHA (Bitfield-Mask: 0x01) */
#define USART_CR2_CPHA                                                     USART_CR2_CPHA_Msk
#define USART_CR2_LBCL_Pos                                                 (8UL)    /*!<USART CR2: LBCL (Bit 8) */
#define USART_CR2_LBCL_Msk                                                 (0x100UL)    /*!< USART CR2: LBCL (Bitfield-Mask: 0x01) */
#define USART_CR2_LBCL                                                     USART_CR2_LBCL_Msk
#define USART_CR2_LBDIE_Pos                                                (6UL)    /*!<USART CR2: LBDIE (Bit 6) */
#define USART_CR2_LBDIE_Msk                                                (0x40UL)   /*!< USART CR2: LBDIE (Bitfield-Mask: 0x01) */
#define USART_CR2_LBDIE                                                    USART_CR2_LBDIE_Msk
#define USART_CR2_LBDL_Pos                                                 (5UL)    /*!<USART CR2: LBDL (Bit 5) */
#define USART_CR2_LBDL_Msk                                                 (0x20UL)   /*!< USART CR2: LBDL (Bitfield-Mask: 0x01) */
#define USART_CR2_LBDL                                                     USART_CR2_LBDL_Msk
#define USART_CR2_ADDM7_Pos                                                (4UL)    /*!<USART CR2: ADDM7 (Bit 4) */
#define USART_CR2_ADDM7_Msk                                                (0x10UL)   /*!< USART CR2: ADDM7 (Bitfield-Mask: 0x01) */
#define USART_CR2_ADDM7                                                    USART_CR2_ADDM7_Msk
#define USART_CR2_DIS_NSS_Pos                                              (3UL)    /*!<USART CR2: DIS_NSS (Bit 3) */
#define USART_CR2_DIS_NSS_Msk                                              (0x8UL)    /*!< USART CR2: DIS_NSS (Bitfield-Mask: 0x01) */
#define USART_CR2_DIS_NSS                                                  USART_CR2_DIS_NSS_Msk
#define USART_CR2_SLVEN_Pos                                                (0UL)    /*!<USART CR2: SLVEN (Bit 0) */
#define USART_CR2_SLVEN_Msk                                                (0x1UL)    /*!< USART CR2: SLVEN (Bitfield-Mask: 0x01) */
#define USART_CR2_SLVEN                                                    USART_CR2_SLVEN_Msk

/* =====================================================    CR3    ===================================================== */
#define USART_CR3_TXFTCFG_Pos                                              (29UL)   /*!<USART CR3: TXFTCFG (Bit 29) */
#define USART_CR3_TXFTCFG_Msk                                              (0xe0000000UL)   /*!< USART CR3: TXFTCFG (Bitfield-Mask: 0x07) */
#define USART_CR3_TXFTCFG                                                  USART_CR3_TXFTCFG_Msk
#define USART_CR3_TXFTCFG_0                                                (0x1U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_TXFTCFG_1                                                (0x2U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_TXFTCFG_2                                                (0x4U << USART_CR3_TXFTCFG_Pos)
#define USART_CR3_RXFTIE_Pos                                               (28UL)   /*!<USART CR3: RXFTIE (Bit 28) */
#define USART_CR3_RXFTIE_Msk                                               (0x10000000UL)   /*!< USART CR3: RXFTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_RXFTIE                                                   USART_CR3_RXFTIE_Msk
#define USART_CR3_RXFTCFG_Pos                                              (25UL)   /*!<USART CR3: RXFTCFG (Bit 25) */
#define USART_CR3_RXFTCFG_Msk                                              (0xe000000UL)    /*!< USART CR3: RXFTCFG (Bitfield-Mask: 0x07) */
#define USART_CR3_RXFTCFG                                                  USART_CR3_RXFTCFG_Msk
#define USART_CR3_RXFTCFG_0                                                (0x1U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_RXFTCFG_1                                                (0x2U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_RXFTCFG_2                                                (0x4U << USART_CR3_RXFTCFG_Pos)
#define USART_CR3_TCBGTIE_Pos                                              (24UL)   /*!<USART CR3: TCBGTIE (Bit 24) */
#define USART_CR3_TCBGTIE_Msk                                              (0x1000000UL)    /*!< USART CR3: TCBGTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_TCBGTIE                                                  USART_CR3_TCBGTIE_Msk
#define USART_CR3_TXFTIE_Pos                                               (23UL)   /*!<USART CR3: TXFTIE (Bit 23) */
#define USART_CR3_TXFTIE_Msk                                               (0x800000UL)   /*!< USART CR3: TXFTIE (Bitfield-Mask: 0x01) */
#define USART_CR3_TXFTIE                                                   USART_CR3_TXFTIE_Msk
#define USART_CR3_SCARCNT_Pos                                              (17UL)   /*!<USART CR3: SCARCNT (Bit 17) */
#define USART_CR3_SCARCNT_Msk                                              (0xe0000UL)    /*!< USART CR3: SCARCNT (Bitfield-Mask: 0x07) */
#define USART_CR3_SCARCNT                                                  USART_CR3_SCARCNT_Msk
#define USART_CR3_SCARCNT_0                                                (0x1U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_SCARCNT_1                                                (0x2U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_SCARCNT_2                                                (0x4U << USART_CR3_SCARCNT_Pos)
#define USART_CR3_DEP_Pos                                                  (15UL)   /*!<USART CR3: DEP (Bit 15) */
#define USART_CR3_DEP_Msk                                                  (0x8000UL)   /*!< USART CR3: DEP (Bitfield-Mask: 0x01) */
#define USART_CR3_DEP                                                      USART_CR3_DEP_Msk
#define USART_CR3_DEM_Pos                                                  (14UL)   /*!<USART CR3: DEM (Bit 14) */
#define USART_CR3_DEM_Msk                                                  (0x4000UL)   /*!< USART CR3: DEM (Bitfield-Mask: 0x01) */
#define USART_CR3_DEM                                                      USART_CR3_DEM_Msk
#define USART_CR3_DDRE_Pos                                                 (13UL)   /*!<USART CR3: DDRE (Bit 13) */
#define USART_CR3_DDRE_Msk                                                 (0x2000UL)   /*!< USART CR3: DDRE (Bitfield-Mask: 0x01) */
#define USART_CR3_DDRE                                                     USART_CR3_DDRE_Msk
#define USART_CR3_OVRDIS_Pos                                               (12UL)   /*!<USART CR3: OVRDIS (Bit 12) */
#define USART_CR3_OVRDIS_Msk                                               (0x1000UL)   /*!< USART CR3: OVRDIS (Bitfield-Mask: 0x01) */
#define USART_CR3_OVRDIS                                                   USART_CR3_OVRDIS_Msk
#define USART_CR3_ONEBIT_Pos                                               (11UL)   /*!<USART CR3: ONEBIT (Bit 11) */
#define USART_CR3_ONEBIT_Msk                                               (0x800UL)    /*!< USART CR3: ONEBIT (Bitfield-Mask: 0x01) */
#define USART_CR3_ONEBIT                                                   USART_CR3_ONEBIT_Msk
#define USART_CR3_CTSIE_Pos                                                (10UL)   /*!<USART CR3: CTSIE (Bit 10) */
#define USART_CR3_CTSIE_Msk                                                (0x400UL)    /*!< USART CR3: CTSIE (Bitfield-Mask: 0x01) */
#define USART_CR3_CTSIE                                                    USART_CR3_CTSIE_Msk
#define USART_CR3_CTSE_Pos                                                 (9UL)    /*!<USART CR3: CTSE (Bit 9) */
#define USART_CR3_CTSE_Msk                                                 (0x200UL)    /*!< USART CR3: CTSE (Bitfield-Mask: 0x01) */
#define USART_CR3_CTSE                                                     USART_CR3_CTSE_Msk
#define USART_CR3_RTSE_Pos                                                 (8UL)    /*!<USART CR3: RTSE (Bit 8) */
#define USART_CR3_RTSE_Msk                                                 (0x100UL)    /*!< USART CR3: RTSE (Bitfield-Mask: 0x01) */
#define USART_CR3_RTSE                                                     USART_CR3_RTSE_Msk
#define USART_CR3_DMAT_Pos                                                 (7UL)    /*!<USART CR3: DMAT (Bit 7) */
#define USART_CR3_DMAT_Msk                                                 (0x80UL)   /*!< USART CR3: DMAT (Bitfield-Mask: 0x01) */
#define USART_CR3_DMAT                                                     USART_CR3_DMAT_Msk
#define USART_CR3_DMAR_Pos                                                 (6UL)    /*!<USART CR3: DMAR (Bit 6) */
#define USART_CR3_DMAR_Msk                                                 (0x40UL)   /*!< USART CR3: DMAR (Bitfield-Mask: 0x01) */
#define USART_CR3_DMAR                                                     USART_CR3_DMAR_Msk
#define USART_CR3_SCEN_Pos                                                 (5UL)    /*!<USART CR3: SCEN (Bit 5) */
#define USART_CR3_SCEN_Msk                                                 (0x20UL)   /*!< USART CR3: SCEN (Bitfield-Mask: 0x01) */
#define USART_CR3_SCEN                                                     USART_CR3_SCEN_Msk
#define USART_CR3_NACK_Pos                                                 (4UL)    /*!<USART CR3: NACK (Bit 4) */
#define USART_CR3_NACK_Msk                                                 (0x10UL)   /*!< USART CR3: NACK (Bitfield-Mask: 0x01) */
#define USART_CR3_NACK                                                     USART_CR3_NACK_Msk
#define USART_CR3_HDSEL_Pos                                                (3UL)    /*!<USART CR3: HDSEL (Bit 3) */
#define USART_CR3_HDSEL_Msk                                                (0x8UL)    /*!< USART CR3: HDSEL (Bitfield-Mask: 0x01) */
#define USART_CR3_HDSEL                                                    USART_CR3_HDSEL_Msk
#define USART_CR3_IRLP_Pos                                                 (2UL)    /*!<USART CR3: IRLP (Bit 2) */
#define USART_CR3_IRLP_Msk                                                 (0x4UL)    /*!< USART CR3: IRLP (Bitfield-Mask: 0x01) */
#define USART_CR3_IRLP                                                     USART_CR3_IRLP_Msk
#define USART_CR3_IREN_Pos                                                 (1UL)    /*!<USART CR3: IREN (Bit 1) */
#define USART_CR3_IREN_Msk                                                 (0x2UL)    /*!< USART CR3: IREN (Bitfield-Mask: 0x01) */
#define USART_CR3_IREN                                                     USART_CR3_IREN_Msk
#define USART_CR3_EIE_Pos                                                  (0UL)    /*!<USART CR3: EIE (Bit 0) */
#define USART_CR3_EIE_Msk                                                  (0x1UL)    /*!< USART CR3: EIE (Bitfield-Mask: 0x01) */
#define USART_CR3_EIE                                                      USART_CR3_EIE_Msk

/* =====================================================    BRR    ===================================================== */
#define USART_BRR_BRR_Pos                                                  (0UL)    /*!<USART BRR: BRR (Bit 0) */
#define USART_BRR_BRR_Msk                                                  (0xfffffUL)    /*!< USART BRR: BRR (Bitfield-Mask: 0xfffff) */
#define USART_BRR_BRR                                                      USART_BRR_BRR_Msk
#define USART_BRR_BRR_0                                                    (0x1U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_1                                                    (0x2U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_2                                                    (0x4U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_3                                                    (0x8U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_4                                                    (0x10U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_5                                                    (0x20U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_6                                                    (0x40U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_7                                                    (0x80U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_8                                                    (0x100U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_9                                                    (0x200U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_10                                                   (0x400U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_11                                                   (0x800U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_12                                                   (0x1000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_13                                                   (0x2000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_14                                                   (0x4000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_15                                                   (0x8000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_16                                                   (0x10000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_17                                                   (0x20000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_18                                                   (0x40000U << USART_BRR_BRR_Pos)
#define USART_BRR_BRR_19                                                   (0x80000U << USART_BRR_BRR_Pos)

/* =====================================================    GTPR    ===================================================== */
#define USART_GTPR_GT_Pos                                                  (8UL)    /*!<USART GTPR: GT (Bit 8) */
#define USART_GTPR_GT_Msk                                                  (0xff00UL)   /*!< USART GTPR: GT (Bitfield-Mask: 0xff) */
#define USART_GTPR_GT                                                      USART_GTPR_GT_Msk
#define USART_GTPR_GT_0                                                    (0x1U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_1                                                    (0x2U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_2                                                    (0x4U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_3                                                    (0x8U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_4                                                    (0x10U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_5                                                    (0x20U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_6                                                    (0x40U << USART_GTPR_GT_Pos)
#define USART_GTPR_GT_7                                                    (0x80U << USART_GTPR_GT_Pos)
#define USART_GTPR_PSC_Pos                                                 (0UL)    /*!<USART GTPR: PSC (Bit 0) */
#define USART_GTPR_PSC_Msk                                                 (0xffUL)   /*!< USART GTPR: PSC (Bitfield-Mask: 0xff) */
#define USART_GTPR_PSC                                                     USART_GTPR_PSC_Msk
#define USART_GTPR_PSC_0                                                   (0x1U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_1                                                   (0x2U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_2                                                   (0x4U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_3                                                   (0x8U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_4                                                   (0x10U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_5                                                   (0x20U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_6                                                   (0x40U << USART_GTPR_PSC_Pos)
#define USART_GTPR_PSC_7                                                   (0x80U << USART_GTPR_PSC_Pos)

