stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    RTOR    ===================================================== */
#define USART_RTOR_BLEN_Pos                                                (24UL)   /*!<USART RTOR: BLEN (Bit 24) */
#define USART_RTOR_BLEN_Msk                                                (0xff000000UL)   /*!< USART RTOR: BLEN (Bitfield-Mask: 0xff) */
#define USART_RTOR_BLEN                                                    USART_RTOR_BLEN_Msk
#define USART_RTOR_BLEN_0                                                  (0x1U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_1                                                  (0x2U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_2                                                  (0x4U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_3                                                  (0x8U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_4                                                  (0x10U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_5                                                  (0x20U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_6                                                  (0x40U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_BLEN_7                                                  (0x80U << USART_RTOR_BLEN_Pos)
#define USART_RTOR_RTO_Pos                                                 (0UL)    /*!<USART RTOR: RTO (Bit 0) */
#define USART_RTOR_RTO_Msk                                                 (0xffffffUL)   /*!< USART RTOR: RTO (Bitfield-Mask: 0xffffff) */
#define USART_RTOR_RTO                                                     USART_RTOR_RTO_Msk
#define USART_RTOR_RTO_0                                                   (0x1U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_1                                                   (0x2U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_2                                                   (0x4U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_3                                                   (0x8U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_4                                                   (0x10U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_5                                                   (0x20U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_6                                                   (0x40U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_7                                                   (0x80U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_8                                                   (0x100U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_9                                                   (0x200U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_10                                                  (0x400U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_11                                                  (0x800U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_12                                                  (0x1000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_13                                                  (0x2000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_14                                                  (0x4000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_15                                                  (0x8000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_16                                                  (0x10000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_17                                                  (0x20000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_18                                                  (0x40000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_19                                                  (0x80000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_20                                                  (0x100000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_21                                                  (0x200000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_22                                                  (0x400000U << USART_RTOR_RTO_Pos)
#define USART_RTOR_RTO_23                                                  (0x800000U << USART_RTOR_RTO_Pos)

/* =====================================================    RQR    ===================================================== */
#define USART_RQR_TXFRQ_Pos                                                (4UL)    /*!<USART RQR: TXFRQ (Bit 4) */
#define USART_RQR_TXFRQ_Msk                                                (0x10UL)   /*!< USART RQR: TXFRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_TXFRQ                                                    USART_RQR_TXFRQ_Msk
#define USART_RQR_RXFRQ_Pos                                                (3UL)    /*!<USART RQR: RXFRQ (Bit 3) */
#define USART_RQR_RXFRQ_Msk                                                (0x8UL)    /*!< USART RQR: RXFRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_RXFRQ                                                    USART_RQR_RXFRQ_Msk
#define USART_RQR_MMRQ_Pos                                                 (2UL)    /*!<USART RQR: MMRQ (Bit 2) */
#define USART_RQR_MMRQ_Msk                                                 (0x4UL)    /*!< USART RQR: MMRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_MMRQ                                                     USART_RQR_MMRQ_Msk
#define USART_RQR_SBKRQ_Pos                                                (1UL)    /*!<USART RQR: SBKRQ (Bit 1) */
#define USART_RQR_SBKRQ_Msk                                                (0x2UL)    /*!< USART RQR: SBKRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_SBKRQ                                                    USART_RQR_SBKRQ_Msk
#define USART_RQR_ABRRQ_Pos                                                (0UL)    /*!<USART RQR: ABRRQ (Bit 0) */
#define USART_RQR_ABRRQ_Msk                                                (0x1UL)    /*!< USART RQR: ABRRQ (Bitfield-Mask: 0x01) */
#define USART_RQR_ABRRQ                                                    USART_RQR_ABRRQ_Msk

/* =====================================================    ISR    ===================================================== */
#define USART_ISR_TXFT_Pos                                                 (27UL)   /*!<USART ISR: TXFT (Bit 27) */
#define USART_ISR_TXFT_Msk                                                 (0x8000000UL)    /*!< USART ISR: TXFT (Bitfield-Mask: 0x01) */
#define USART_ISR_TXFT                                                     USART_ISR_TXFT_Msk
#define USART_ISR_RXFT_Pos                                                 (26UL)   /*!<USART ISR: RXFT (Bit 26) */
#define USART_ISR_RXFT_Msk                                                 (0x4000000UL)    /*!< USART ISR: RXFT (Bitfield-Mask: 0x01) */
#define USART_ISR_RXFT                                                     USART_ISR_RXFT_Msk
#define USART_ISR_TCBGT_Pos                                                (25UL)   /*!<USART ISR: TCBGT (Bit 25) */
#define USART_ISR_TCBGT_Msk                                                (0x2000000UL)    /*!< USART ISR: TCBGT (Bitfield-Mask: 0x01) */
#define USART_ISR_TCBGT                                                    USART_ISR_TCBGT_Msk
#define USART_ISR_RXFF_Pos                                                 (24UL)   /*!<USART ISR: RXFF (Bit 24) */
#define USART_ISR_RXFF_Msk                                                 (0x1000000UL)    /*!< USART ISR: RXFF (Bitfield-Mask: 0x01) */
#define USART_ISR_RXFF                                                     USART_ISR_RXFF_Msk
#define USART_ISR_TXFE_Pos                                                 (23UL)   /*!<USART ISR: TXFE (Bit 23) */
#define USART_ISR_TXFE_Msk                                                 (0x800000UL)   /*!< USART ISR: TXFE (Bitfield-Mask: 0x01) */
#define USART_ISR_TXFE                                                     USART_ISR_TXFE_Msk
#define USART_ISR_REACK_Pos                                                (22UL)   /*!<USART ISR: REACK (Bit 22) */
#define USART_ISR_REACK_Msk                                                (0x400000UL)   /*!< USART ISR: REACK (Bitfield-Mask: 0x01) */
#define USART_ISR_REACK                                                    USART_ISR_REACK_Msk
#define USART_ISR_TEACK_Pos                                                (21UL)   /*!<USART ISR: TEACK (Bit 21) */
#define USART_ISR_TEACK_Msk                                                (0x200000UL)   /*!< USART ISR: TEACK (Bitfield-Mask: 0x01) */
#define USART_ISR_TEACK                                                    USART_ISR_TEACK_Msk
#define USART_ISR_RWU_Pos                                                  (19UL)   /*!<USART ISR: RWU (Bit 19) */
#define USART_ISR_RWU_Msk                                                  (0x80000UL)    /*!< USART ISR: RWU (Bitfield-Mask: 0x01) */
#define USART_ISR_RWU                                                      USART_ISR_RWU_Msk
#define USART_ISR_SBKF_Pos                                                 (18UL)   /*!<USART ISR: SBKF (Bit 18) */
#define USART_ISR_SBKF_Msk                                                 (0x40000UL)    /*!< USART ISR: SBKF (Bitfield-Mask: 0x01) */
#define USART_ISR_SBKF                                                     USART_ISR_SBKF_Msk
#define USART_ISR_CMF_Pos                                                  (17UL)   /*!<USART ISR: CMF (Bit 17) */
#define USART_ISR_CMF_Msk                                                  (0x20000UL)    /*!< USART ISR: CMF (Bitfield-Mask: 0x01) */
#define USART_ISR_CMF                                                      USART_ISR_CMF_Msk
#define USART_ISR_BUSY_Pos                                                 (16UL)   /*!<USART ISR: BUSY (Bit 16) */
#define USART_ISR_BUSY_Msk                                                 (0x10000UL)    /*!< USART ISR: BUSY (Bitfield-Mask: 0x01) */
#define USART_ISR_BUSY                                                     USART_ISR_BUSY_Msk
#define USART_ISR_ABRF_Pos                                                 (15UL)   /*!<USART ISR: ABRF (Bit 15) */
#define USART_ISR_ABRF_Msk                                                 (0x8000UL)   /*!< USART ISR: ABRF (Bitfield-Mask: 0x01) */
#define USART_ISR_ABRF                                                     USART_ISR_ABRF_Msk
#define USART_ISR_ABRE_Pos                                                 (14UL)   /*!<USART ISR: ABRE (Bit 14) */
#define USART_ISR_ABRE_Msk                                                 (0x4000UL)   /*!< USART ISR: ABRE (Bitfield-Mask: 0x01) */
#define USART_ISR_ABRE                                                     USART_ISR_ABRE_Msk
#define USART_ISR_UDR_Pos                                                  (13UL)   /*!<USART ISR: UDR (Bit 13) */
#define USART_ISR_UDR_Msk                                                  (0x2000UL)   /*!< USART ISR: UDR (Bitfield-Mask: 0x01) */
#define USART_ISR_UDR                                                      USART_ISR_UDR_Msk
#define USART_ISR_EOBF_Pos                                                 (12UL)   /*!<USART ISR: EOBF (Bit 12) */
#define USART_ISR_EOBF_Msk                                                 (0x1000UL)   /*!< USART ISR: EOBF (Bitfield-Mask: 0x01) */
#define USART_ISR_EOBF                                                     USART_ISR_EOBF_Msk
#define USART_ISR_RTOF_Pos                                                 (11UL)   /*!<USART ISR: RTOF (Bit 11) */
#define USART_ISR_RTOF_Msk                                                 (0x800UL)    /*!< USART ISR: RTOF (Bitfield-Mask: 0x01) */
#define USART_ISR_RTOF                                                     USART_ISR_RTOF_Msk
#define USART_ISR_CTS_Pos                                                  (10UL)   /*!<USART ISR: CTS (Bit 10) */
#define USART_ISR_CTS_Msk                                                  (0x400UL)    /*!< USART ISR: CTS (Bitfield-Mask: 0x01) */
#define USART_ISR_CTS                                                      USART_ISR_CTS_Msk
#define USART_ISR_CTSIF_Pos                                                (9UL)    /*!<USART ISR: CTSIF (Bit 9) */
#define USART_ISR_CTSIF_Msk                                                (0x200UL)    /*!< USART ISR: CTSIF (Bitfield-Mask: 0x01) */
#define USART_ISR_CTSIF                                                    USART_ISR_CTSIF_Msk
#define USART_ISR_LBDF_Pos                                                 (8UL)    /*!<USART ISR: LBDF (Bit 8) */
#define USART_ISR_LBDF_Msk                                                 (0x100UL)    /*!< USART ISR: LBDF (Bitfield-Mask: 0x01) */
#define USART_ISR_LBDF                                                     USART_ISR_LBDF_Msk
#define USART_ISR_TXE_TXFNF_Pos                                            (7UL)    /*!<USART ISR: TXE_TXFNF (Bit 7) */
#define USART_ISR_TXE_TXFNF_Msk                                            (0x80UL)   /*!< USART ISR: TXE_TXFNF (Bitfield-Mask: 0x01) */
#define USART_ISR_TXE_TXFNF                                                USART_ISR_TXE_TXFNF_Msk
#define USART_ISR_TC_Pos                                                   (6UL)    /*!<USART ISR: TC (Bit 6) */
#define USART_ISR_TC_Msk                                                   (0x40UL)   /*!< USART ISR: TC (Bitfield-Mask: 0x01) */
#define USART_ISR_TC                                                       USART_ISR_TC_Msk
#define USART_ISR_RXNE_RXFNE_Pos                                           (5UL)    /*!<USART ISR: RXNE_RXFNE (Bit 5) */
#define USART_ISR_RXNE_RXFNE_Msk                                           (0x20UL)   /*!< USART ISR: RXNE_RXFNE (Bitfield-Mask: 0x01) */
#define USART_ISR_RXNE_RXFNE                                               USART_ISR_RXNE_RXFNE_Msk
#define USART_ISR_IDLE_Pos                                                 (4UL)    /*!<USART ISR: IDLE (Bit 4) */
#define USART_ISR_IDLE_Msk                                                 (0x10UL)   /*!< USART ISR: IDLE (Bitfield-Mask: 0x01) */
#define USART_ISR_IDLE                                                     USART_ISR_IDLE_Msk
#define USART_ISR_ORE_Pos                                                  (3UL)    /*!<USART ISR: ORE (Bit 3) */
#define USART_ISR_ORE_Msk                                                  (0x8UL)    /*!< USART ISR: ORE (Bitfield-Mask: 0x01) */
#define USART_ISR_ORE                                                      USART_ISR_ORE_Msk
#define USART_ISR_NE_Pos                                                   (2UL)    /*!<USART ISR: NE (Bit 2) */
#define USART_ISR_NE_Msk                                                   (0x4UL)    /*!< USART ISR: NE (Bitfield-Mask: 0x01) */
#define USART_ISR_NE                                                       USART_ISR_NE_Msk
#define USART_ISR_FE_Pos                                                   (1UL)    /*!<USART ISR: FE (Bit 1) */
#define USART_ISR_FE_Msk                                                   (0x2UL)    /*!< USART ISR: FE (Bitfield-Mask: 0x01) */
#define USART_ISR_FE                                                       USART_ISR_FE_Msk
#define USART_ISR_PE_Pos                                                   (0UL)    /*!<USART ISR: PE (Bit 0) */
#define USART_ISR_PE_Msk                                                   (0x1UL)    /*!< USART ISR: PE (Bitfield-Mask: 0x01) */
#define USART_ISR_PE                                                       USART_ISR_PE_Msk

/* =====================================================    ICR    ===================================================== */
#define USART_ICR_CMCF_Pos                                                 (17UL)   /*!<USART ICR: CMCF (Bit 17) */
#define USART_ICR_CMCF_Msk                                                 (0x20000UL)    /*!< USART ICR: CMCF (Bitfield-Mask: 0x01) */
#define USART_ICR_CMCF                                                     USART_ICR_CMCF_Msk
#define USART_ICR_UDRCF_Pos                                                (13UL)   /*!<USART ICR: UDRCF (Bit 13) */
#define USART_ICR_UDRCF_Msk                                                (0x2000UL)   /*!< USART ICR: UDRCF (Bitfield-Mask: 0x01) */
#define USART_ICR_UDRCF                                                    USART_ICR_UDRCF_Msk
#define USART_ICR_EOBCF_Pos                                                (12UL)   /*!<USART ICR: EOBCF (Bit 12) */
#define USART_ICR_EOBCF_Msk                                                (0x1000UL)   /*!< USART ICR: EOBCF (Bitfield-Mask: 0x01) */
#define USART_ICR_EOBCF                                                    USART_ICR_EOBCF_Msk
#define USART_ICR_RTOCF_Pos                                                (11UL)   /*!<USART ICR: RTOCF (Bit 11) */
#define USART_ICR_RTOCF_Msk                                                (0x800UL)    /*!< USART ICR: RTOCF (Bitfield-Mask: 0x01) */
#define USART_ICR_RTOCF                                                    USART_ICR_RTOCF_Msk
#define USART_ICR_CTSCF_Pos                                                (9UL)    /*!<USART ICR: CTSCF (Bit 9) */
#define USART_ICR_CTSCF_Msk                                                (0x200UL)    /*!< USART ICR: CTSCF (Bitfield-Mask: 0x01) */
#define USART_ICR_CTSCF                                                    USART_ICR_CTSCF_Msk
#define USART_ICR_LBDCF_Pos                                                (8UL)    /*!<USART ICR: LBDCF (Bit 8) */
#define USART_ICR_LBDCF_Msk                                                (0x100UL)    /*!< USART ICR: LBDCF (Bitfield-Mask: 0x01) */
#define USART_ICR_LBDCF                                                    USART_ICR_LBDCF_Msk
#define USART_ICR_TCBGTCF_Pos                                              (7UL)    /*!<USART ICR: TCBGTCF (Bit 7) */
#define USART_ICR_TCBGTCF_Msk                                              (0x80UL)   /*!< USART ICR: TCBGTCF (Bitfield-Mask: 0x01) */
#define USART_ICR_TCBGTCF                                                  USART_ICR_TCBGTCF_Msk
#define USART_ICR_TCCF_Pos                                                 (6UL)    /*!<USART ICR: TCCF (Bit 6) */
#define USART_ICR_TCCF_Msk                                                 (0x40UL)   /*!< USART ICR: TCCF (Bitfield-Mask: 0x01) */
#define USART_ICR_TCCF                                                     USART_ICR_TCCF_Msk
#define USART_ICR_TXFECF_Pos                                               (5UL)    /*!<USART ICR: TXFECF (Bit 5) */
#define USART_ICR_TXFECF_Msk                                               (0x20UL)   /*!< USART ICR: TXFECF (Bitfield-Mask: 0x01) */
#define USART_ICR_TXFECF                                                   USART_ICR_TXFECF_Msk
#define USART_ICR_IDLECF_Pos                                               (4UL)    /*!<USART ICR: IDLECF (Bit 4) */
#define USART_ICR_IDLECF_Msk                                               (0x10UL)   /*!< USART ICR: IDLECF (Bitfield-Mask: 0x01) */
#define USART_ICR_IDLECF                                                   USART_ICR_IDLECF_Msk
#define USART_ICR_ORECF_Pos                                                (3UL)    /*!<USART ICR: ORECF (Bit 3) */
#define USART_ICR_ORECF_Msk                                                (0x8UL)    /*!< USART ICR: ORECF (Bitfield-Mask: 0x01) */
#define USART_ICR_ORECF                                                    USART_ICR_ORECF_Msk
#define USART_ICR_NECF_Pos                                                 (2UL)    /*!<USART ICR: NECF (Bit 2) */
#define USART_ICR_NECF_Msk                                                 (0x4UL)    /*!< USART ICR: NECF (Bitfield-Mask: 0x01) */
#define USART_ICR_NECF                                                     USART_ICR_NECF_Msk
#define USART_ICR_FECF_Pos                                                 (1UL)    /*!<USART ICR: FECF (Bit 1) */
#define USART_ICR_FECF_Msk                                                 (0x2UL)    /*!< USART ICR: FECF (Bitfield-Mask: 0x01) */
#define USART_ICR_FECF                                                     USART_ICR_FECF_Msk
#define USART_ICR_PECF_Pos                                                 (0UL)    /*!<USART ICR: PECF (Bit 0) */
#define USART_ICR_PECF_Msk                                                 (0x1UL)    /*!< USART ICR: PECF (Bitfield-Mask: 0x01) */
#define USART_ICR_PECF                                                     USART_ICR_PECF_Msk

