stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/******************** Number of backup registers ******************************/
#define RTC_BKP_NUMBER                 (2U)

/* =========================================================================================================================== */
/* ================                                            PKA                                            ================ */
/* =========================================================================================================================== */

/* =====================================================    CSR    ===================================================== */
#define PKA_CSR_SFT_RST_Pos                                                (7UL)    /*!<PKA CSR: SFT_RST (Bit 7) */
#define PKA_CSR_SFT_RST_Msk                                                (0x80UL)   /*!< PKA CSR: SFT_RST (Bitfield-Mask: 0x01) */
#define PKA_CSR_SFT_RST                                                    PKA_CSR_SFT_RST_Msk
#define PKA_CSR_READY_Pos                                                  (1UL)    /*!<PKA CSR: READY (Bit 1) */
#define PKA_CSR_READY_Msk                                                  (0x2UL)    /*!< PKA CSR: READY (Bitfield-Mask: 0x01) */
#define PKA_CSR_READY                                                      PKA_CSR_READY_Msk
#define PKA_CSR_GO_Pos                                                     (0UL)    /*!<PKA CSR: GO (Bit 0) */
#define PKA_CSR_GO_Msk                                                     (0x1UL)    /*!< PKA CSR: GO (Bitfield-Mask: 0x01) */
#define PKA_CSR_GO                                                         PKA_CSR_GO_Msk

/* =====================================================    ISR    ===================================================== */
#define PKA_ISR_ADD_ERR_Pos                                                (3UL)    /*!<PKA ISR: ADD_ERR (Bit 3) */
#define PKA_ISR_ADD_ERR_Msk                                                (0x8UL)    /*!< PKA ISR: ADD_ERR (Bitfield-Mask: 0x01) */
#define PKA_ISR_ADD_ERR                                                    PKA_ISR_ADD_ERR_Msk
#define PKA_ISR_RAM_ERR_Pos                                                (2UL)    /*!<PKA ISR: RAM_ERR (Bit 2) */
#define PKA_ISR_RAM_ERR_Msk                                                (0x4UL)    /*!< PKA ISR: RAM_ERR (Bitfield-Mask: 0x01) */
#define PKA_ISR_RAM_ERR                                                    PKA_ISR_RAM_ERR_Msk
#define PKA_ISR_PROC_END_Pos                                               (0UL)    /*!<PKA ISR: PROC_END (Bit 0) */
#define PKA_ISR_PROC_END_Msk                                               (0x1UL)    /*!< PKA ISR: PROC_END (Bitfield-Mask: 0x01) */
#define PKA_ISR_PROC_END                                                   PKA_ISR_PROC_END_Msk

/* =====================================================    IEN    ===================================================== */
#define PKA_IEN_ADDERR_EN_Pos                                              (3UL)    /*!<PKA IEN: ADDERR_EN (Bit 3) */
#define PKA_IEN_ADDERR_EN_Msk                                              (0x8UL)    /*!< PKA IEN: ADDERR_EN (Bitfield-Mask: 0x01) */
#define PKA_IEN_ADDERR_EN                                                  PKA_IEN_ADDERR_EN_Msk
#define PKA_IEN_RAMERR_EN_Pos                                              (2UL)    /*!<PKA IEN: RAMERR_EN (Bit 2) */
#define PKA_IEN_RAMERR_EN_Msk                                              (0x4UL)    /*!< PKA IEN: RAMERR_EN (Bitfield-Mask: 0x01) */
#define PKA_IEN_RAMERR_EN                                                  PKA_IEN_RAMERR_EN_Msk
#define PKA_IEN_READY_EN_Pos                                               (0UL)    /*!<PKA IEN: READY_EN (Bit 0) */
#define PKA_IEN_READY_EN_Msk                                               (0x1UL)    /*!< PKA IEN: READY_EN (Bitfield-Mask: 0x01) */
#define PKA_IEN_READY_EN                                                   PKA_IEN_READY_EN_Msk


/* =========================================================================================================================== */
/*=====================                                       ADC                                       ===================== */
/* =========================================================================================================================== */
#define ADC_SUPPORT_AUDIO_FEATURES

/* =====================================================    VERSION_ID    ===================================================== */
#define ADC_VERSION_ID_VERSION_ID_Pos                                      (0UL)    /*!<ADC VERSION_ID: VERSION_ID (Bit 0) */
#define ADC_VERSION_ID_VERSION_ID_Msk                                      (0xffUL)   /*!< ADC VERSION_ID: VERSION_ID (Bitfield-Mask: 0xff) */
#define ADC_VERSION_ID_VERSION_ID                                          ADC_VERSION_ID_VERSION_ID_Msk
#define ADC_VERSION_ID_VERSION_ID_0                                        (0x1U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_1                                        (0x2U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_2                                        (0x4U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_3                                        (0x8U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_4                                        (0x10U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_5                                        (0x20U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_6                                        (0x40U << ADC_VERSION_ID_VERSION_ID_Pos)
#define ADC_VERSION_ID_VERSION_ID_7                                        (0x80U << ADC_VERSION_ID_VERSION_ID_Pos)

/* =====================================================    CONF    ===================================================== */
#define ADC_CONF_VBIAS_PRECH_FORCE_Pos                                     (20UL)   /*!<ADC CONF: VBIAS_PRECH_FORCE (Bit 20) */
#define ADC_CONF_VBIAS_PRECH_FORCE_Msk                                     (0x100000UL)   /*!< ADC CONF: VBIAS_PRECH_FORCE (Bitfield-Mask: 0x01) */
#define ADC_CONF_VBIAS_PRECH_FORCE                                         ADC_CONF_VBIAS_PRECH_FORCE_Msk
#define ADC_CONF_ADC_CONT_1V2_Pos                                          (19UL)   /*!<ADC CONF: ADC_CONT_1V2 (Bit 19) */
#define ADC_CONF_ADC_CONT_1V2_Msk                                          (0x80000UL)    /*!< ADC CONF: ADC_CONT_1V2 (Bitfield-Mask: 0x01) */
#define ADC_CONF_ADC_CONT_1V2                                              ADC_CONF_ADC_CONT_1V2_Msk
#define ADC_CONF_BIT_INVERT_DIFF_Pos                                       (18UL)   /*!<ADC CONF: BIT_INVERT_DIFF (Bit 18) */
#define ADC_CONF_BIT_INVERT_DIFF_Msk                                       (0x40000UL)    /*!< ADC CONF: BIT_INVERT_DIFF (Bitfield-Mask: 0x01) */
#define ADC_CONF_BIT_INVERT_DIFF                                           ADC_CONF_BIT_INVERT_DIFF_Msk
#define ADC_CONF_BIT_INVERT_SN_Pos                                         (17UL)   /*!<ADC CONF: BIT_INVERT_SN (Bit 17) */
#define ADC_CONF_BIT_INVERT_SN_Msk                                         (0x20000UL)    /*!< ADC CONF: BIT_INVERT_SN (Bitfield-Mask: 0x01) */
#define ADC_CONF_BIT_INVERT_SN                                             ADC_CONF_BIT_INVERT_SN_Msk
#define ADC_CONF_OVR_DF_CFG_Pos                                            (16UL)   /*!<ADC CONF: OVR_DF_CFG (Bit 16) */
#define ADC_CONF_OVR_DF_CFG_Msk                                            (0x10000UL)    /*!< ADC CONF: OVR_DF_CFG (Bitfield-Mask: 0x01) */
#define ADC_CONF_OVR_DF_CFG                                                ADC_CONF_OVR_DF_CFG_Msk
#define ADC_CONF_OVR_DS_CFG_Pos                                            (15UL)   /*!<ADC CONF: OVR_DS_CFG (Bit 15) */
#define ADC_CONF_OVR_DS_CFG_Msk                                            (0x8000UL)   /*!< ADC CONF: OVR_DS_CFG (Bitfield-Mask: 0x01) */
#define ADC_CONF_OVR_DS_CFG                                                ADC_CONF_OVR_DS_CFG_Msk
#define ADC_CONF_DMA_DF_ENA_Pos                                            (14UL)   /*!<ADC CONF: DMA_DF_ENA (Bit 14) */
#define ADC_CONF_DMA_DF_ENA_Msk                                            (0x4000UL)   /*!< ADC CONF: DMA_DF_ENA (Bitfield-Mask: 0x01) */
#define ADC_CONF_DMA_DF_ENA                                                ADC_CONF_DMA_DF_ENA_Msk
#define ADC_CONF_DMA_DS_ENA_Pos                                            (13UL)   /*!<ADC CONF: DMA_DS_ENA (Bit 13) */
#define ADC_CONF_DMA_DS_ENA_Msk                                            (0x2000UL)   /*!< ADC CONF: DMA_DS_ENA (Bitfield-Mask: 0x01) */
#define ADC_CONF_DMA_DS_ENA                                                ADC_CONF_DMA_DS_ENA_Msk
#define ADC_CONF_SAMPLE_RATE_Pos                                           (11UL)   /*!<ADC CONF: SAMPLE_RATE (Bit 11) */
#define ADC_CONF_SAMPLE_RATE_Msk                                           (0x1800UL)   /*!< ADC CONF: SAMPLE_RATE (Bitfield-Mask: 0x03) */
#define ADC_CONF_SAMPLE_RATE                                               ADC_CONF_SAMPLE_RATE_Msk
#define ADC_CONF_SAMPLE_RATE_0                                             (0x1U << ADC_CONF_SAMPLE_RATE_Pos)
#define ADC_CONF_SAMPLE_RATE_1                                             (0x2U << ADC_CONF_SAMPLE_RATE_Pos)
#define ADC_CONF_OP_MODE_Pos                                               (7UL)    /*!<ADC CONF: OP_MODE (Bit 7) */
#define ADC_CONF_OP_MODE_Msk                                               (0x180UL)    /*!< ADC CONF: OP_MODE (Bitfield-Mask: 0x03) */
#define ADC_CONF_OP_MODE                                                   ADC_CONF_OP_MODE_Msk
#define ADC_CONF_OP_MODE_0                                                 (0x1U << ADC_CONF_OP_MODE_Pos)
#define ADC_CONF_OP_MODE_1                                                 (0x2U << ADC_CONF_OP_MODE_Pos)
#define ADC_CONF_SMPS_SYNCHRO_ENA_Pos                                      (6UL)    /*!<ADC CONF: SMPS_SYNCHRO_ENA (Bit 6) */
#define ADC_CONF_SMPS_SYNCHRO_ENA_Msk                                      (0x40UL)   /*!< ADC CONF: SMPS_SYNCHRO_ENA (Bitfield-Mask: 0x01) */
#define ADC_CONF_SMPS_SYNCHRO_ENA                                          ADC_CONF_SMPS_SYNCHRO_ENA_Msk
#define ADC_CONF_SEQ_LEN_Pos                                               (2UL)    /*!<ADC CONF: SEQ_LEN (Bit 2) */
#define ADC_CONF_SEQ_LEN_Msk                                               (0x3cUL)   /*!< ADC CONF: SEQ_LEN (Bitfield-Mask: 0x0f) */
#define ADC_CONF_SEQ_LEN                                                   ADC_CONF_SEQ_LEN_Msk
#define ADC_CONF_SEQ_LEN_0                                                 (0x1U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_1                                                 (0x2U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_2                                                 (0x4U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQ_LEN_3                                                 (0x8U << ADC_CONF_SEQ_LEN_Pos)
#define ADC_CONF_SEQUENCE_Pos                                              (1UL)    /*!<ADC CONF: SEQUENCE (Bit 1) */
#define ADC_CONF_SEQUENCE_Msk                                              (0x2UL)    /*!< ADC CONF: SEQUENCE (Bitfield-Mask: 0x01) */
#define ADC_CONF_SEQUENCE                                                  ADC_CONF_SEQUENCE_Msk
#define ADC_CONF_CONT_Pos                                                  (0UL)    /*!<ADC CONF: CONT (Bit 0) */
#define ADC_CONF_CONT_Msk                                                  (0x1UL)    /*!< ADC CONF: CONT (Bitfield-Mask: 0x01) */
#define ADC_CONF_CONT                                                      ADC_CONF_CONT_Msk

/* =====================================================    CTRL    ===================================================== */
#define ADC_CTRL_ADC_LDO_ENA_Pos                                           (5UL)    /*!<ADC CTRL: ADC_LDO_ENA (Bit 5) */
#define ADC_CTRL_ADC_LDO_ENA_Msk                                           (0x20UL)   /*!< ADC CTRL: ADC_LDO_ENA (Bitfield-Mask: 0x01) */
#define ADC_CTRL_ADC_LDO_ENA                                               ADC_CTRL_ADC_LDO_ENA_Msk
#define ADC_CTRL_DIG_AUD_MODE_Pos                                          (3UL)    /*!<ADC CTRL: DIG_AUD_MODE (Bit 3) */
#define ADC_CTRL_DIG_AUD_MODE_Msk                                          (0x8UL)    /*!< ADC CTRL: DIG_AUD_MODE (Bitfield-Mask: 0x01) */
#define ADC_CTRL_DIG_AUD_MODE                                              ADC_CTRL_DIG_AUD_MODE_Msk
#define ADC_CTRL_STOP_OP_MODE_Pos                                          (2UL)    /*!<ADC CTRL: STOP_OP_MODE (Bit 2) */
#define ADC_CTRL_STOP_OP_MODE_Msk                                          (0x4UL)    /*!< ADC CTRL: STOP_OP_MODE (Bitfield-Mask: 0x01) */
#define ADC_CTRL_STOP_OP_MODE                                              ADC_CTRL_STOP_OP_MODE_Msk
#define ADC_CTRL_START_CONV_Pos                                            (1UL)    /*!<ADC CTRL: START_CONV (Bit 1) */
#define ADC_CTRL_START_CONV_Msk                                            (0x2UL)    /*!< ADC CTRL: START_CONV (Bitfield-Mask: 0x01) */
#define ADC_CTRL_START_CONV                                                ADC_CTRL_START_CONV_Msk
#define ADC_CTRL_ADC_ON_OFF_Pos                                            (0UL)    /*!<ADC CTRL: ADC_ON_OFF (Bit 0) */
#define ADC_CTRL_ADC_ON_OFF_Msk                                            (0x1UL)    /*!< ADC CTRL: ADC_ON_OFF (Bitfield-Mask: 0x01) */
#define ADC_CTRL_ADC_ON_OFF                                                ADC_CTRL_ADC_ON_OFF_Msk

