stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* =====================================================    DF_CONF    ===================================================== */
#define ADC_DF_CONF_DF_HALF_D_EN_Pos                                       (17UL)   /*!<ADC DF_CONF: DF_HALF_D_EN (Bit 17) */
#define ADC_DF_CONF_DF_HALF_D_EN_Msk                                       (0x20000UL)    /*!< ADC DF_CONF: DF_HALF_D_EN (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_HALF_D_EN                                           ADC_DF_CONF_DF_HALF_D_EN_Msk
#define ADC_DF_CONF_DF_HPF_EN_Pos                                          (16UL)   /*!<ADC DF_CONF: DF_HPF_EN (Bit 16) */
#define ADC_DF_CONF_DF_HPF_EN_Msk                                          (0x10000UL)    /*!< ADC DF_CONF: DF_HPF_EN (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_HPF_EN                                              ADC_DF_CONF_DF_HPF_EN_Msk
#define ADC_DF_CONF_DF_MICROL_RN_Pos                                       (15UL)   /*!<ADC DF_CONF: DF_MICROL_RN (Bit 15) */
#define ADC_DF_CONF_DF_MICROL_RN_Msk                                       (0x8000UL)   /*!< ADC DF_CONF: DF_MICROL_RN (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_MICROL_RN                                           ADC_DF_CONF_DF_MICROL_RN_Msk
#define ADC_DF_CONF_PDM_RATE_Pos                                           (11UL)   /*!<ADC DF_CONF: PDM_RATE (Bit 11) */
#define ADC_DF_CONF_PDM_RATE_Msk                                           (0x7800UL)   /*!< ADC DF_CONF: PDM_RATE (Bitfield-Mask: 0x0f) */
#define ADC_DF_CONF_PDM_RATE                                               ADC_DF_CONF_PDM_RATE_Msk
#define ADC_DF_CONF_PDM_RATE_0                                             (0x1U << ADC_DF_CONF_PDM_RATE_Pos)
#define ADC_DF_CONF_PDM_RATE_1                                             (0x2U << ADC_DF_CONF_PDM_RATE_Pos)
#define ADC_DF_CONF_PDM_RATE_2                                             (0x4U << ADC_DF_CONF_PDM_RATE_Pos)
#define ADC_DF_CONF_PDM_RATE_3                                             (0x8U << ADC_DF_CONF_PDM_RATE_Pos)
#define ADC_DF_CONF_DF_O_S2U_Pos                                           (10UL)   /*!<ADC DF_CONF: DF_O_S2U (Bit 10) */
#define ADC_DF_CONF_DF_O_S2U_Msk                                           (0x400UL)    /*!< ADC DF_CONF: DF_O_S2U (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_O_S2U                                               ADC_DF_CONF_DF_O_S2U_Msk
#define ADC_DF_CONF_DF_I_U2S_Pos                                           (9UL)    /*!<ADC DF_CONF: DF_I_U2S (Bit 9) */
#define ADC_DF_CONF_DF_I_U2S_Msk                                           (0x200UL)    /*!< ADC DF_CONF: DF_I_U2S (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_I_U2S                                               ADC_DF_CONF_DF_I_U2S_Msk
#define ADC_DF_CONF_DF_ITP1P2_Pos                                          (8UL)    /*!<ADC DF_CONF: DF_ITP1P2 (Bit 8) */
#define ADC_DF_CONF_DF_ITP1P2_Msk                                          (0x100UL)    /*!< ADC DF_CONF: DF_ITP1P2 (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_ITP1P2                                              ADC_DF_CONF_DF_ITP1P2_Msk
#define ADC_DF_CONF_DF_CIC_DHF_Pos                                         (7UL)    /*!<ADC DF_CONF: DF_CIC_DHF (Bit 7) */
#define ADC_DF_CONF_DF_CIC_DHF_Msk                                         (0x80UL)   /*!< ADC DF_CONF: DF_CIC_DHF (Bitfield-Mask: 0x01) */
#define ADC_DF_CONF_DF_CIC_DHF                                             ADC_DF_CONF_DF_CIC_DHF_Msk
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos                                  (0UL)    /*!<ADC DF_CONF: DF_CIC_DEC_FACTOR (Bit 0) */
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_Msk                                  (0x7fUL)   /*!< ADC DF_CONF: DF_CIC_DEC_FACTOR (Bitfield-Mask: 0x7f) */
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR                                      ADC_DF_CONF_DF_CIC_DEC_FACTOR_Msk
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_0                                    (0x1U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_1                                    (0x2U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_2                                    (0x4U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_3                                    (0x8U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_4                                    (0x10U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_5                                    (0x20U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)
#define ADC_DF_CONF_DF_CIC_DEC_FACTOR_6                                    (0x40U << ADC_DF_CONF_DF_CIC_DEC_FACTOR_Pos)

/* =====================================================    DS_CONF    ===================================================== */
#define ADC_DS_CONF_DS_WIDTH_Pos                                           (3UL)    /*!<ADC DS_CONF: DS_WIDTH (Bit 3) */
#define ADC_DS_CONF_DS_WIDTH_Msk                                           (0x38UL)   /*!< ADC DS_CONF: DS_WIDTH (Bitfield-Mask: 0x07) */
#define ADC_DS_CONF_DS_WIDTH                                               ADC_DS_CONF_DS_WIDTH_Msk
#define ADC_DS_CONF_DS_WIDTH_0                                             (0x1U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_WIDTH_1                                             (0x2U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_WIDTH_2                                             (0x4U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_RATIO_Pos                                           (0UL)    /*!<ADC DS_CONF: DS_RATIO (Bit 0) */
#define ADC_DS_CONF_DS_RATIO_Msk                                           (0x7UL)    /*!< ADC DS_CONF: DS_RATIO (Bitfield-Mask: 0x07) */
#define ADC_DS_CONF_DS_RATIO                                               ADC_DS_CONF_DS_RATIO_Msk
#define ADC_DS_CONF_DS_RATIO_0                                             (0x1U << ADC_DS_CONF_DS_RATIO_Pos)
#define ADC_DS_CONF_DS_RATIO_1                                             (0x2U << ADC_DS_CONF_DS_RATIO_Pos)
#define ADC_DS_CONF_DS_RATIO_2                                             (0x4U << ADC_DS_CONF_DS_RATIO_Pos)

