stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
#define BLUE_INTERRUPT1REG_ADDPOINTERROR_Pos                               (4UL)   /*!< BLUE INTERRUPT1REG: ADDPOINTERROR (Bit 4) */
#define BLUE_INTERRUPT1REG_ADDPOINTERROR_Msk                               (0x00000010UL)  /*!< BLUE INTERRUPT1REG: ADDPOINTERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_ADDPOINTERROR                                   BLUE_INTERRUPT1REG_ADDPOINTERROR_Msk
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Pos                             (5UL)   /*!< BLUE INTERRUPT1REG: RXOVERFLOWERROR (Bit 5) */
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Msk                             (0x00000020UL)  /*!< BLUE INTERRUPT1REG: RXOVERFLOWERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RXOVERFLOWERROR                                 BLUE_INTERRUPT1REG_RXOVERFLOWERROR_Msk
#define BLUE_INTERRUPT1REG_SEQDONE_Pos                                     (7UL)   /*!< BLUE INTERRUPT1REG: SEQDONE (Bit 7) */
#define BLUE_INTERRUPT1REG_SEQDONE_Msk                                     (0x00000080UL)  /*!< BLUE INTERRUPT1REG: SEQDONE (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_SEQDONE                                         BLUE_INTERRUPT1REG_SEQDONE_Msk
#define BLUE_INTERRUPT1REG_TXERROR_0_Pos                                   (8UL)   /*!< BLUE INTERRUPT1REG: TXERROR_0 (Bit 8) */
#define BLUE_INTERRUPT1REG_TXERROR_0_Msk                                   (0x00000100UL)  /*!< BLUE INTERRUPT1REG: TXERROR_0 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXERROR_0                                       BLUE_INTERRUPT1REG_TXERROR_0_Msk
#define BLUE_INTERRUPT1REG_TXERROR_1_Pos                                   (9UL)   /*!< BLUE INTERRUPT1REG: TXERROR_1 (Bit 9) */
#define BLUE_INTERRUPT1REG_TXERROR_1_Msk                                   (0x00000200UL)  /*!< BLUE INTERRUPT1REG: TXERROR_1 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXERROR_1                                       BLUE_INTERRUPT1REG_TXERROR_1_Msk
#define BLUE_INTERRUPT1REG_TXERROR_2_Pos                                   (10UL)   /*!< BLUE INTERRUPT1REG: TXERROR_2 (Bit 10) */
#define BLUE_INTERRUPT1REG_TXERROR_2_Msk                                   (0x00000400UL)  /*!< BLUE INTERRUPT1REG: TXERROR_2 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXERROR_2                                       BLUE_INTERRUPT1REG_TXERROR_2_Msk
#define BLUE_INTERRUPT1REG_TXERROR_3_Pos                                   (11UL)   /*!< BLUE INTERRUPT1REG: TXERROR_3 (Bit 11) */
#define BLUE_INTERRUPT1REG_TXERROR_3_Msk                                   (0x00000800UL)  /*!< BLUE INTERRUPT1REG: TXERROR_3 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXERROR_3                                       BLUE_INTERRUPT1REG_TXERROR_3_Msk
#define BLUE_INTERRUPT1REG_TXERROR_4_Pos                                   (12UL)   /*!< BLUE INTERRUPT1REG: TXERROR_4 (Bit 12) */
#define BLUE_INTERRUPT1REG_TXERROR_4_Msk                                   (0x00001000UL)  /*!< BLUE INTERRUPT1REG: TXERROR_4 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXERROR_4                                       BLUE_INTERRUPT1REG_TXERROR_4_Msk
#define BLUE_INTERRUPT1REG_ENCERROR_Pos                                    (13UL)   /*!< BLUE INTERRUPT1REG: ENCERROR (Bit 13) */
#define BLUE_INTERRUPT1REG_ENCERROR_Msk                                    (0x00002000UL)  /*!< BLUE INTERRUPT1REG: ENCERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_ENCERROR                                        BLUE_INTERRUPT1REG_ENCERROR_Msk
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Pos                          (14UL)   /*!< BLUE INTERRUPT1REG: ALLTABLEREADYERROR (Bit 14) */
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Msk                          (0x00004000UL)  /*!< BLUE INTERRUPT1REG: ALLTABLEREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_ALLTABLEREADYERROR                              BLUE_INTERRUPT1REG_ALLTABLEREADYERROR_Msk
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR_Pos                            (15UL)   /*!< BLUE INTERRUPT1REG: TXDATAREADYERROR (Bit 15) */
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR_Msk                            (0x00008000UL)  /*!< BLUE INTERRUPT1REG: TXDATAREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXDATAREADYERROR                                BLUE_INTERRUPT1REG_TXDATAREADYERROR_Msk
#define BLUE_INTERRUPT1REG_NOACTIVELERROR_Pos                              (16UL)   /*!< BLUE INTERRUPT1REG: NOACTIVELERROR (Bit 16) */
#define BLUE_INTERRUPT1REG_NOACTIVELERROR_Msk                              (0x00010000UL)  /*!< BLUE INTERRUPT1REG: NOACTIVELERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_NOACTIVELERROR                                  BLUE_INTERRUPT1REG_NOACTIVELERROR_Msk
#define BLUE_INTERRUPT1REG_INITDELAYERROR_Pos                              (17UL)   /*!< BLUE INTERRUPT1REG: INITDELAYERROR (Bit 17) */
#define BLUE_INTERRUPT1REG_INITDELAYERROR_Msk                              (0x00020000UL)  /*!< BLUE INTERRUPT1REG: INITDELAYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_INITDELAYERROR                                  BLUE_INTERRUPT1REG_INITDELAYERROR_Msk
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR_Pos                              (18UL)   /*!< BLUE INTERRUPT1REG: RCVLENGTHERROR (Bit 18) */
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR_Msk                              (0x00040000UL)  /*!< BLUE INTERRUPT1REG: RCVLENGTHERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVLENGTHERROR                                  BLUE_INTERRUPT1REG_RCVLENGTHERROR_Msk
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Pos                            (19UL)   /*!< BLUE INTERRUPT1REG: SEMATIMEOUTERROR (Bit 19) */
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Msk                            (0x00080000UL)  /*!< BLUE INTERRUPT1REG: SEMATIMEOUTERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_SEMATIMEOUTERROR                                BLUE_INTERRUPT1REG_SEMATIMEOUTERROR_Msk
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Pos                              (20UL)   /*!< BLUE INTERRUPT1REG: SEMAWASPREEMPT (Bit 20) */
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Msk                              (0x00100000UL)  /*!< BLUE INTERRUPT1REG: SEMAWASPREEMPT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_SEMAWASPREEMPT                                  BLUE_INTERRUPT1REG_SEMAWASPREEMPT_Msk
#define BLUE_INTERRUPT1REG_TXRXSKIP_Pos                                    (21UL)   /*!< BLUE INTERRUPT1REG: TXRXSKIP (Bit 21) */
#define BLUE_INTERRUPT1REG_TXRXSKIP_Msk                                    (0x00200000UL)  /*!< BLUE INTERRUPT1REG: TXRXSKIP (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXRXSKIP                                        BLUE_INTERRUPT1REG_TXRXSKIP_Msk
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR_Pos                                (22UL)   /*!< BLUE INTERRUPT1REG: ACTIVE2ERROR (Bit 22) */
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR_Msk                                (0x00400000UL)  /*!< BLUE INTERRUPT1REG: ACTIVE2ERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_ACTIVE2ERROR                                    BLUE_INTERRUPT1REG_ACTIVE2ERROR_Msk
#define BLUE_INTERRUPT1REG_CONFIGERROR_Pos                                 (23UL)   /*!< BLUE INTERRUPT1REG: CONFIGERROR (Bit 23) */
#define BLUE_INTERRUPT1REG_CONFIGERROR_Msk                                 (0x00800000UL)  /*!< BLUE INTERRUPT1REG: CONFIGERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_CONFIGERROR                                     BLUE_INTERRUPT1REG_CONFIGERROR_Msk
#define BLUE_INTERRUPT1REG_TXOK_Pos                                        (24UL)   /*!< BLUE INTERRUPT1REG: TXOK (Bit 24) */
#define BLUE_INTERRUPT1REG_TXOK_Msk                                        (0x01000000UL)  /*!< BLUE INTERRUPT1REG: TXOK (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TXOK                                            BLUE_INTERRUPT1REG_TXOK_Msk
#define BLUE_INTERRUPT1REG_DONE_Pos                                        (25UL)   /*!< BLUE INTERRUPT1REG: DONE (Bit 25) */
#define BLUE_INTERRUPT1REG_DONE_Msk                                        (0x02000000UL)  /*!< BLUE INTERRUPT1REG: DONE (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_DONE                                            BLUE_INTERRUPT1REG_DONE_Msk
#define BLUE_INTERRUPT1REG_RCVTIMEOUT_Pos                                  (26UL)   /*!< BLUE INTERRUPT1REG: RCVTIMEOUT (Bit 26) */
#define BLUE_INTERRUPT1REG_RCVTIMEOUT_Msk                                  (0x04000000UL)  /*!< BLUE INTERRUPT1REG: RCVTIMEOUT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVTIMEOUT                                      BLUE_INTERRUPT1REG_RCVTIMEOUT_Msk
#define BLUE_INTERRUPT1REG_RCVNOMD_Pos                                     (27UL)   /*!< BLUE INTERRUPT1REG: RCVNOMD (Bit 27) */
#define BLUE_INTERRUPT1REG_RCVNOMD_Msk                                     (0x08000000UL)  /*!< BLUE INTERRUPT1REG: RCVNOMD (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVNOMD                                         BLUE_INTERRUPT1REG_RCVNOMD_Msk
#define BLUE_INTERRUPT1REG_RCVCMD_Pos                                      (28UL)   /*!< BLUE INTERRUPT1REG: RCVCMD (Bit 28) */
#define BLUE_INTERRUPT1REG_RCVCMD_Msk                                      (0x10000000UL)  /*!< BLUE INTERRUPT1REG: RCVCMD (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVCMD                                          BLUE_INTERRUPT1REG_RCVCMD_Msk
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Pos                             (29UL)   /*!< BLUE INTERRUPT1REG: TIMECAPTURETRIG (Bit 29) */
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Msk                             (0x20000000UL)  /*!< BLUE INTERRUPT1REG: TIMECAPTURETRIG (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_TIMECAPTURETRIG                                 BLUE_INTERRUPT1REG_TIMECAPTURETRIG_Msk
#define BLUE_INTERRUPT1REG_RCVCRCERR_Pos                                   (30UL)   /*!< BLUE INTERRUPT1REG: RCVCRCERR (Bit 30) */
#define BLUE_INTERRUPT1REG_RCVCRCERR_Msk                                   (0x40000000UL)  /*!< BLUE INTERRUPT1REG: RCVCRCERR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVCRCERR                                       BLUE_INTERRUPT1REG_RCVCRCERR_Msk
#define BLUE_INTERRUPT1REG_RCVOK_Pos                                       (31UL)   /*!< BLUE INTERRUPT1REG: RCVOK (Bit 31) */
#define BLUE_INTERRUPT1REG_RCVOK_Msk                                       (0x80000000UL)  /*!< BLUE INTERRUPT1REG: RCVOK (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1REG_RCVOK                                           BLUE_INTERRUPT1REG_RCVOK_Msk
#define BLUE_INTERRUPT1REG_ALL_Pos                                         (0UL)
//#define BLUE_INTERRUPT1REG_ALL_Msk                                         (0xffffffffUL)
#define BLUE_INTERRUPT1REG_ALL_Msk                                         (BLUE_INTERRUPT1REG_ADDPOINTERROR |\
                                                                            BLUE_INTERRUPT1REG_RXOVERFLOWERROR |\
                                                                            BLUE_INTERRUPT1REG_SEQDONE |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_0 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_1 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_2 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_3 |\
                                                                            BLUE_INTERRUPT1REG_TXERROR_4 |\
                                                                            BLUE_INTERRUPT1REG_ENCERROR |\
                                                                            BLUE_INTERRUPT1REG_ALLTABLEREADYERROR |\
                                                                            BLUE_INTERRUPT1REG_TXDATAREADYERROR |\
                                                                            BLUE_INTERRUPT1REG_NOACTIVELERROR |\
                                                                            BLUE_INTERRUPT1REG_INITDELAYERROR |\
                                                                            BLUE_INTERRUPT1REG_RCVLENGTHERROR |\
                                                                            BLUE_INTERRUPT1REG_SEMATIMEOUTERROR |\
                                                                            BLUE_INTERRUPT1REG_SEMAWASPREEMPT |\
                                                                            BLUE_INTERRUPT1REG_TXRXSKIP |\
                                                                            BLUE_INTERRUPT1REG_ACTIVE2ERROR |\
                                                                            BLUE_INTERRUPT1REG_CONFIGERROR |\
                                                                            BLUE_INTERRUPT1REG_TXOK |\
                                                                            BLUE_INTERRUPT1REG_DONE |\
                                                                            BLUE_INTERRUPT1REG_RCVTIMEOUT |\
                                                                            BLUE_INTERRUPT1REG_RCVNOMD |\
                                                                            BLUE_INTERRUPT1REG_RCVCMD |\
                                                                            BLUE_INTERRUPT1REG_TIMECAPTURETRIG | BLUE_INTERRUPT1REG_RCVCRCERR | BLUE_INTERRUPT1REG_RCVOK )
#define BLUE_INTERRUPT1REG_ALL                                             BLUE_INTERRUPT1REG_ALL_Msk

/* ===============================================   INTERRUPT2REG   =============================================== */
#define BLUE_INTERRUPT2REG_AESMANENCINT_Pos                                (0UL)   /*!< BLUE INTERRUPT2REG: AESMANENCINT (Bit 0) */
#define BLUE_INTERRUPT2REG_AESMANENCINT_Msk                                (0x00000001UL)  /*!< BLUE INTERRUPT2REG: AESMANENCINT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT2REG_AESMANENCINT                                    BLUE_INTERRUPT2REG_AESMANENCINT_Msk
#define BLUE_INTERRUPT2REG_AESLEPRIVINT_Pos                                (1UL)   /*!< BLUE INTERRUPT2REG: AESLEPRIVINT (Bit 1) */
#define BLUE_INTERRUPT2REG_AESLEPRIVINT_Msk                                (0x00000002UL)  /*!< BLUE INTERRUPT2REG: AESLEPRIVINT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT2REG_AESLEPRIVINT                                    BLUE_INTERRUPT2REG_AESLEPRIVINT_Msk

/* ===============================================   TIMEOUTDESTREG   =============================================== */
#define BLUE_TIMEOUTDESTREG_DESTINATION_Pos                                (0UL)   /*!< BLUE TIMEOUTDESTREG: DESTINATION (Bit 0) */
#define BLUE_TIMEOUTDESTREG_DESTINATION_Msk                                (0x00000003UL)  /*!< BLUE TIMEOUTDESTREG: DESTINATION (Bitfield-Mask: 0x3) */
#define BLUE_TIMEOUTDESTREG_DESTINATION                                    BLUE_TIMEOUTDESTREG_DESTINATION_Msk
#define BLUE_TIMEOUTDESTREG_DESTINATION_0                                  (0x1 << BLUE_TIMEOUTDESTREG_DESTINATION_Pos)   /*!<0x00000001 */
#define BLUE_TIMEOUTDESTREG_DESTINATION_1                                  (0x2 << BLUE_TIMEOUTDESTREG_DESTINATION_Pos)   /*!<0x00000002 */

/* ===============================================   TIMEOUTREG   =============================================== */
#define BLUE_TIMEOUTREG_TIMEOUT_Pos                                        (0UL)   /*!< BLUE TIMEOUTREG: TIMEOUT (Bit 0) */
#define BLUE_TIMEOUTREG_TIMEOUT_Msk                                        (0xffffffffUL)  /*!< BLUE TIMEOUTREG: TIMEOUT (Bitfield-Mask: 0xffffffffL) */
#define BLUE_TIMEOUTREG_TIMEOUT                                            BLUE_TIMEOUTREG_TIMEOUT_Msk
#define BLUE_TIMEOUTREG_TIMEOUT_0                                          (0x00000001 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000001 */
#define BLUE_TIMEOUTREG_TIMEOUT_1                                          (0x00000002 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000002 */
#define BLUE_TIMEOUTREG_TIMEOUT_2                                          (0x00000004 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000004 */
#define BLUE_TIMEOUTREG_TIMEOUT_3                                          (0x00000008 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000008 */
#define BLUE_TIMEOUTREG_TIMEOUT_4                                          (0x00000010 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000010 */
#define BLUE_TIMEOUTREG_TIMEOUT_5                                          (0x00000020 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000020 */
#define BLUE_TIMEOUTREG_TIMEOUT_6                                          (0x00000040 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000040 */
#define BLUE_TIMEOUTREG_TIMEOUT_7                                          (0x00000080 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000080 */
#define BLUE_TIMEOUTREG_TIMEOUT_8                                          (0x00000100 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000100 */
#define BLUE_TIMEOUTREG_TIMEOUT_9                                          (0x00000200 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000200 */
#define BLUE_TIMEOUTREG_TIMEOUT_10                                         (0x00000400 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000400 */
#define BLUE_TIMEOUTREG_TIMEOUT_11                                         (0x00000800 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00000800 */
#define BLUE_TIMEOUTREG_TIMEOUT_12                                         (0x00001000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00001000 */
#define BLUE_TIMEOUTREG_TIMEOUT_13                                         (0x00002000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00002000 */
#define BLUE_TIMEOUTREG_TIMEOUT_14                                         (0x00004000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00004000 */
#define BLUE_TIMEOUTREG_TIMEOUT_15                                         (0x00008000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00008000 */
#define BLUE_TIMEOUTREG_TIMEOUT_16                                         (0x00010000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00010000 */
#define BLUE_TIMEOUTREG_TIMEOUT_17                                         (0x00020000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00020000 */
#define BLUE_TIMEOUTREG_TIMEOUT_18                                         (0x00040000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00040000 */
#define BLUE_TIMEOUTREG_TIMEOUT_19                                         (0x00080000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00080000 */
#define BLUE_TIMEOUTREG_TIMEOUT_20                                         (0x00100000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00100000 */
#define BLUE_TIMEOUTREG_TIMEOUT_21                                         (0x00200000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00200000 */
#define BLUE_TIMEOUTREG_TIMEOUT_22                                         (0x00400000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00400000 */
#define BLUE_TIMEOUTREG_TIMEOUT_23                                         (0x00800000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x00800000 */
#define BLUE_TIMEOUTREG_TIMEOUT_24                                         (0x01000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x01000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_25                                         (0x02000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x02000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_26                                         (0x04000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x04000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_27                                         (0x08000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x08000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_28                                         (0x10000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x10000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_29                                         (0x20000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x20000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_30                                         (0x40000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x40000000 */
#define BLUE_TIMEOUTREG_TIMEOUT_31                                         (0x80000000 << BLUE_TIMEOUTREG_TIMEOUT_Pos)   /*!<0x80000000 */

