stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   MANAESCLEARTEXT0REG   =============================================== */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos                        (0UL)   /*!< BLUE MANAESCLEARTEXT0REG: AES_CLEAR_31_0 (Bit 0) */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Msk                        (0xffffffffUL)  /*!< BLUE MANAESCLEARTEXT0REG: AES_CLEAR_31_0 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0                            BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Msk
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_0                          (0x00000001 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000001 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_1                          (0x00000002 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000002 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_2                          (0x00000004 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000004 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_3                          (0x00000008 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000008 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_4                          (0x00000010 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000010 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_5                          (0x00000020 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000020 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_6                          (0x00000040 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000040 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_7                          (0x00000080 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000080 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_8                          (0x00000100 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000100 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_9                          (0x00000200 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000200 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_10                         (0x00000400 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000400 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_11                         (0x00000800 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00000800 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_12                         (0x00001000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00001000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_13                         (0x00002000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00002000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_14                         (0x00004000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00004000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_15                         (0x00008000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00008000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_16                         (0x00010000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00010000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_17                         (0x00020000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00020000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_18                         (0x00040000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00040000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_19                         (0x00080000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00080000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_20                         (0x00100000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00100000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_21                         (0x00200000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00200000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_22                         (0x00400000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00400000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_23                         (0x00800000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x00800000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_24                         (0x01000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x01000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_25                         (0x02000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x02000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_26                         (0x04000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x04000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_27                         (0x08000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x08000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_28                         (0x10000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x10000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_29                         (0x20000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x20000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_30                         (0x40000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x40000000 */
#define BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_31                         (0x80000000 << BLUE_MANAESCLEARTEXT0REG_AES_CLEAR_31_0_Pos)   /*!<0x80000000 */

/* ===============================================   MANAESCLEARTEXT1REG   =============================================== */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos                       (0UL)   /*!< BLUE MANAESCLEARTEXT1REG: AES_CLEAR_63_32 (Bit 0) */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Msk                       (0xffffffffUL)  /*!< BLUE MANAESCLEARTEXT1REG: AES_CLEAR_63_32 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32                           BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Msk
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_0                         (0x00000001 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000001 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_1                         (0x00000002 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000002 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_2                         (0x00000004 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000004 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_3                         (0x00000008 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000008 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_4                         (0x00000010 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000010 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_5                         (0x00000020 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000020 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_6                         (0x00000040 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000040 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_7                         (0x00000080 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000080 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_8                         (0x00000100 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000100 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_9                         (0x00000200 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000200 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_10                        (0x00000400 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000400 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_11                        (0x00000800 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00000800 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_12                        (0x00001000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00001000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_13                        (0x00002000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00002000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_14                        (0x00004000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00004000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_15                        (0x00008000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00008000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_16                        (0x00010000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00010000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_17                        (0x00020000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00020000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_18                        (0x00040000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00040000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_19                        (0x00080000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00080000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_20                        (0x00100000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00100000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_21                        (0x00200000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00200000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_22                        (0x00400000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00400000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_23                        (0x00800000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x00800000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_24                        (0x01000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x01000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_25                        (0x02000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x02000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_26                        (0x04000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x04000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_27                        (0x08000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x08000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_28                        (0x10000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x10000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_29                        (0x20000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x20000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_30                        (0x40000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x40000000 */
#define BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_31                        (0x80000000 << BLUE_MANAESCLEARTEXT1REG_AES_CLEAR_63_32_Pos)   /*!<0x80000000 */

