stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   DEBUGSTATUSREG   =============================================== */
#define BLUE_DEBUGSTATUSREG_SEQERROR_0_Pos                                 (0UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_0 (Bit 0) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_0_Msk                                 (0x00000001UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_0 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_0                                     BLUE_DEBUGSTATUSREG_SEQERROR_0_Msk
#define BLUE_DEBUGSTATUSREG_SEQERROR_1_Pos                                 (1UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_1 (Bit 1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_1_Msk                                 (0x00000002UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_1 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_1                                     BLUE_DEBUGSTATUSREG_SEQERROR_1_Msk
#define BLUE_DEBUGSTATUSREG_SEQERROR_2_Pos                                 (2UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_2 (Bit 2) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_2_Msk                                 (0x00000004UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_2 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_2                                     BLUE_DEBUGSTATUSREG_SEQERROR_2_Msk
#define BLUE_DEBUGSTATUSREG_SEQERROR_3_Pos                                 (3UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_3 (Bit 3) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_3_Msk                                 (0x00000008UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_3 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_3                                     BLUE_DEBUGSTATUSREG_SEQERROR_3_Msk
#define BLUE_DEBUGSTATUSREG_SEQERROR_4_Pos                                 (4UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_4 (Bit 4) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_4_Msk                                 (0x00000010UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_4 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_4                                     BLUE_DEBUGSTATUSREG_SEQERROR_4_Msk
#define BLUE_DEBUGSTATUSREG_SEQERROR_5_Pos                                 (5UL)   /*!< BLUE DEBUGSTATUSREG: SEQERROR_5 (Bit 5) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_5_Msk                                 (0x00000020UL)  /*!< BLUE DEBUGSTATUSREG: SEQERROR_5 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_SEQERROR_5                                     BLUE_DEBUGSTATUSREG_SEQERROR_5_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_0_Pos                                   (16UL)   /*!< BLUE DEBUGSTATUSREG: AESDBG_0 (Bit 16) */
#define BLUE_DEBUGSTATUSREG_AESDBG_0_Msk                                   (0x00010000UL)  /*!< BLUE DEBUGSTATUSREG: AESDBG_0 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_AESDBG_0                                       BLUE_DEBUGSTATUSREG_AESDBG_0_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_1_Pos                                   (17UL)   /*!< BLUE DEBUGSTATUSREG: AESDBG_1 (Bit 17) */
#define BLUE_DEBUGSTATUSREG_AESDBG_1_Msk                                   (0x00020000UL)  /*!< BLUE DEBUGSTATUSREG: AESDBG_1 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_AESDBG_1                                       BLUE_DEBUGSTATUSREG_AESDBG_1_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_2_Pos                                   (18UL)   /*!< BLUE DEBUGSTATUSREG: AESDBG_2 (Bit 18) */
#define BLUE_DEBUGSTATUSREG_AESDBG_2_Msk                                   (0x00040000UL)  /*!< BLUE DEBUGSTATUSREG: AESDBG_2 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_AESDBG_2                                       BLUE_DEBUGSTATUSREG_AESDBG_2_Msk
#define BLUE_DEBUGSTATUSREG_AESDBG_3_Pos                                   (19UL)   /*!< BLUE DEBUGSTATUSREG: AESDBG_3 (Bit 19) */
#define BLUE_DEBUGSTATUSREG_AESDBG_3_Msk                                   (0x00080000UL)  /*!< BLUE DEBUGSTATUSREG: AESDBG_3 (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGSTATUSREG_AESDBG_3                                       BLUE_DEBUGSTATUSREG_AESDBG_3_Msk


/* =========================================================================================================================== */
/* ================                                     WAKEUP                                                ================ */
/* =========================================================================================================================== */


/* ===============================================   WAKEUP_BLOCK_VERSION   =============================================== */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos                        (0UL)   /*!< WAKEUP WAKEUP_BLOCK_VERSION: SUB_VERSION (Bit 0) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Msk                        (0x000000ffUL)  /*!< WAKEUP WAKEUP_BLOCK_VERSION: SUB_VERSION (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION                            WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Msk
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_0                          (0x01 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000001 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_1                          (0x02 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000002 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_2                          (0x04 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000004 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_3                          (0x08 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000008 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_4                          (0x10 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000010 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_5                          (0x20 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000020 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_6                          (0x40 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000040 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_7                          (0x80 << WAKEUP_WAKEUP_BLOCK_VERSION_SUB_VERSION_Pos)   /*!<0x00000080 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos                     (8UL)   /*!< WAKEUP WAKEUP_BLOCK_VERSION: VERSION_NUMBER (Bit 8) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Msk                     (0x0000ff00UL)  /*!< WAKEUP WAKEUP_BLOCK_VERSION: VERSION_NUMBER (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER                         WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Msk
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_0                       (0x01 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00000100 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_1                       (0x02 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00000200 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_2                       (0x04 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00000400 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_3                       (0x08 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00000800 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_4                       (0x10 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00001000 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_5                       (0x20 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00002000 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_6                       (0x40 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00004000 */
#define WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_7                       (0x80 << WAKEUP_WAKEUP_BLOCK_VERSION_VERSION_NUMBER_Pos)   /*!<0x00008000 */

/* ===============================================   WAKEUP_OFFSET_1   =============================================== */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos                                   (0UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE0 (Bit 0) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_Msk                                   (0x000000ffUL)  /*!< WAKEUP WAKEUP_OFFSET_1: MODE0 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0                                       WAKEUP_WAKEUP_OFFSET_1_MODE0_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000001 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000002 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000004 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000008 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000010 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000020 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000040 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE0_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_1_MODE0_Pos)   /*!<0x00000080 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos                                   (8UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE1 (Bit 8) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_Msk                                   (0x0000ff00UL)  /*!< WAKEUP WAKEUP_OFFSET_1: MODE1 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1                                       WAKEUP_WAKEUP_OFFSET_1_MODE1_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00000100 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00000200 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00000400 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00000800 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00001000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00002000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00004000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE1_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_1_MODE1_Pos)   /*!<0x00008000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos                                   (16UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE2 (Bit 16) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_Msk                                   (0x00ff0000UL)  /*!< WAKEUP WAKEUP_OFFSET_1: MODE2 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2                                       WAKEUP_WAKEUP_OFFSET_1_MODE2_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00010000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00020000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00040000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00080000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00100000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00200000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00400000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE2_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_1_MODE2_Pos)   /*!<0x00800000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos                                   (24UL)   /*!< WAKEUP WAKEUP_OFFSET_1: MODE3 (Bit 24) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_Msk                                   (0xff000000UL)  /*!< WAKEUP WAKEUP_OFFSET_1: MODE3 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3                                       WAKEUP_WAKEUP_OFFSET_1_MODE3_Msk
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x01000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x02000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x04000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x08000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x10000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x20000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x40000000 */
#define WAKEUP_WAKEUP_OFFSET_1_MODE3_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_1_MODE3_Pos)   /*!<0x80000000 */

/* ===============================================   WAKEUP_OFFSET_2   =============================================== */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos                                   (0UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE4 (Bit 0) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_Msk                                   (0x000000ffUL)  /*!< WAKEUP WAKEUP_OFFSET_2: MODE4 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4                                       WAKEUP_WAKEUP_OFFSET_2_MODE4_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000001 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000002 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000004 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000008 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000010 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000020 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000040 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE4_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_2_MODE4_Pos)   /*!<0x00000080 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos                                   (8UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE5 (Bit 8) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_Msk                                   (0x0000ff00UL)  /*!< WAKEUP WAKEUP_OFFSET_2: MODE5 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5                                       WAKEUP_WAKEUP_OFFSET_2_MODE5_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00000100 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00000200 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00000400 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00000800 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00001000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00002000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00004000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE5_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_2_MODE5_Pos)   /*!<0x00008000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos                                   (16UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE6 (Bit 16) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_Msk                                   (0x00ff0000UL)  /*!< WAKEUP WAKEUP_OFFSET_2: MODE6 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6                                       WAKEUP_WAKEUP_OFFSET_2_MODE6_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00010000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00020000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00040000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00080000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00100000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00200000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00400000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE6_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_2_MODE6_Pos)   /*!<0x00800000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos                                   (24UL)   /*!< WAKEUP WAKEUP_OFFSET_2: MODE7 (Bit 24) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_Msk                                   (0xff000000UL)  /*!< WAKEUP WAKEUP_OFFSET_2: MODE7 (Bitfield-Mask: 0xff) */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7                                       WAKEUP_WAKEUP_OFFSET_2_MODE7_Msk
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_0                                     (0x01 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x01000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_1                                     (0x02 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x02000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_2                                     (0x04 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x04000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_3                                     (0x08 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x08000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_4                                     (0x10 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x10000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_5                                     (0x20 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x20000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_6                                     (0x40 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x40000000 */
#define WAKEUP_WAKEUP_OFFSET_2_MODE7_7                                     (0x80 << WAKEUP_WAKEUP_OFFSET_2_MODE7_Pos)   /*!<0x80000000 */

