stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   ABSOLUTE_TIME   =============================================== */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos                             (0UL)   /*!< WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bit 0) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk                             (0xffffffffUL)  /*!< WAKEUP ABSOLUTE_TIME: ABSOLUTE_TIME (Bitfield-Mask: 0xffffffffL) */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME                                 WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Msk
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_0                               (0x00000001 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000001 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_1                               (0x00000002 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000002 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_2                               (0x00000004 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000004 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_3                               (0x00000008 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000008 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_4                               (0x00000010 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000010 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_5                               (0x00000020 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000020 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_6                               (0x00000040 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000040 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_7                               (0x00000080 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000080 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_8                               (0x00000100 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000100 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_9                               (0x00000200 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000200 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_10                              (0x00000400 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000400 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_11                              (0x00000800 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00000800 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_12                              (0x00001000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00001000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_13                              (0x00002000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00002000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_14                              (0x00004000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00004000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_15                              (0x00008000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00008000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_16                              (0x00010000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00010000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_17                              (0x00020000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00020000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_18                              (0x00040000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00040000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_19                              (0x00080000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00080000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_20                              (0x00100000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00100000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_21                              (0x00200000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00200000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_22                              (0x00400000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00400000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_23                              (0x00800000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x00800000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_24                              (0x01000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x01000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_25                              (0x02000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x02000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_26                              (0x04000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x04000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_27                              (0x08000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x08000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_28                              (0x10000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x10000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_29                              (0x20000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x20000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_30                              (0x40000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x40000000 */
#define WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_31                              (0x80000000 << WAKEUP_ABSOLUTE_TIME_ABSOLUTE_TIME_Pos)   /*!<0x80000000 */

/* ===============================================   MINIMUM_PERIOD_LENGTH   =============================================== */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)   /*!< WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x00003ff0UL)  /*!< WAKEUP MINIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_0                              (0x01 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000010 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_1                              (0x02 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000020 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_2                              (0x04 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000040 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_3                              (0x08 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000080 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000100 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000200 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000400 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000800 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00001000 */
#define WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200 << WAKEUP_MINIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00002000 */

