stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   CM0_WAKEUP_TIME   =============================================== */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos                             (4UL)   /*!< WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bit 4) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk                             (0xfffffff0UL)  /*!< WAKEUP CM0_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xfffffff) */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME                                 WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_0                               (0x0000001 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000010 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_1                               (0x0000002 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000020 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_2                               (0x0000004 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000040 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_3                               (0x0000008 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000080 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_4                               (0x0000010 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000100 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_5                               (0x0000020 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000200 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_6                               (0x0000040 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000400 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_7                               (0x0000080 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000800 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_8                               (0x0000100 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00001000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_9                               (0x0000200 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00002000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_10                              (0x0000400 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00004000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_11                              (0x0000800 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00008000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_12                              (0x0001000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00010000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_13                              (0x0002000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00020000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_14                              (0x0004000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00040000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_15                              (0x0008000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00080000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_16                              (0x0010000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00100000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_17                              (0x0020000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00200000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_18                              (0x0040000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00400000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_19                              (0x0080000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00800000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_20                              (0x0100000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x01000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_21                              (0x0200000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x02000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_22                              (0x0400000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x04000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_23                              (0x0800000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x08000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_24                              (0x1000000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x10000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_25                              (0x2000000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x20000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_26                              (0x4000000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x40000000 */
#define WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_27                              (0x8000000 << WAKEUP_CM0_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x80000000 */

/* ===============================================   CM0_SLEEP_REQUEST_MODE   =============================================== */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos                   (0UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bit 0) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk                   (0x00000007UL)  /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bitfield-Mask: 0x7) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE                       WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_0                     (0x1 << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000001 */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_1                     (0x2 << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000002 */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_2                     (0x4 << WAKEUP_CM0_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000004 */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Pos                    (30UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bit 30) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk                    (0x40000000UL)  /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: CPU_WAKEUP_EN (Bitfield-Mask: 0x1) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN                        WAKEUP_CM0_SLEEP_REQUEST_MODE_CPU_WAKEUP_EN_Msk
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                   (31UL)   /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                   (0x80000000UL)  /*!< WAKEUP CM0_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x1) */
#define WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING                       WAKEUP_CM0_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk

/* ===============================================   WAKEUP_BLE_IRQ_ENABLE   =============================================== */
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Pos                         (0UL)   /*!< WAKEUP WAKEUP_BLE_IRQ_ENABLE: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Msk                         (0x00000001UL)  /*!< WAKEUP WAKEUP_BLE_IRQ_ENABLE: WAKEUP_IT (Bitfield-Mask: 0x1) */
#define WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT                             WAKEUP_WAKEUP_BLE_IRQ_ENABLE_WAKEUP_IT_Msk

/* ===============================================   WAKEUP_BLE_IRQ_STATUS   =============================================== */
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Pos                         (0UL)   /*!< WAKEUP WAKEUP_BLE_IRQ_STATUS: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Msk                         (0x00000001UL)  /*!< WAKEUP WAKEUP_BLE_IRQ_STATUS: WAKEUP_IT (Bitfield-Mask: 0x1) */
#define WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT                             WAKEUP_WAKEUP_BLE_IRQ_STATUS_WAKEUP_IT_Msk

/* ===============================================   WAKEUP_CM0_IRQ_ENABLE   =============================================== */
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Pos                         (0UL)   /*!< WAKEUP WAKEUP_CM0_IRQ_ENABLE: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Msk                         (0x00000001UL)  /*!< WAKEUP WAKEUP_CM0_IRQ_ENABLE: WAKEUP_IT (Bitfield-Mask: 0x1) */
#define WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT                             WAKEUP_WAKEUP_CM0_IRQ_ENABLE_WAKEUP_IT_Msk

/* ===============================================   WAKEUP_CM0_IRQ_STATUS   =============================================== */
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Pos                         (0UL)   /*!< WAKEUP WAKEUP_CM0_IRQ_STATUS: WAKEUP_IT (Bit 0) */
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Msk                         (0x00000001UL)  /*!< WAKEUP WAKEUP_CM0_IRQ_STATUS: WAKEUP_IT (Bitfield-Mask: 0x1) */
#define WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT                             WAKEUP_WAKEUP_CM0_IRQ_STATUS_WAKEUP_IT_Msk


/* =========================================================================================================================== */
/* ================                                     RADIO_CTRL                                            ================ */
/* =========================================================================================================================== */


/* ===============================================   RADIO_CONTROL_ID   =============================================== */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos                     (0UL)   /*!< RADIO_CTRL RADIO_CONTROL_ID: IDENTIFICATION (Bit 0) */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Msk                     (0xffffffffUL)  /*!< RADIO_CTRL RADIO_CONTROL_ID: IDENTIFICATION (Bitfield-Mask: 0xffffffffL) */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION                         RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Msk
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_0                       (0x00000001 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000001 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_1                       (0x00000002 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000002 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_2                       (0x00000004 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000004 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_3                       (0x00000008 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000008 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_4                       (0x00000010 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000010 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_5                       (0x00000020 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000020 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_6                       (0x00000040 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000040 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_7                       (0x00000080 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000080 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_8                       (0x00000100 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000100 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_9                       (0x00000200 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000200 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_10                      (0x00000400 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000400 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_11                      (0x00000800 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00000800 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_12                      (0x00001000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00001000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_13                      (0x00002000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00002000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_14                      (0x00004000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00004000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_15                      (0x00008000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00008000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_16                      (0x00010000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00010000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_17                      (0x00020000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00020000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_18                      (0x00040000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00040000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_19                      (0x00080000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00080000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_20                      (0x00100000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00100000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_21                      (0x00200000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00200000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_22                      (0x00400000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00400000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_23                      (0x00800000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x00800000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_24                      (0x01000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x01000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_25                      (0x02000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x02000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_26                      (0x04000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x04000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_27                      (0x08000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x08000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_28                      (0x10000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x10000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_29                      (0x20000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x20000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_30                      (0x40000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x40000000 */
#define RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_31                      (0x80000000 << RADIO_CTRL_RADIO_CONTROL_ID_IDENTIFICATION_Pos)   /*!<0x80000000 */

/* ===============================================   CLK32COUNT_REG   =============================================== */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos                           (0UL)   /*!< RADIO_CTRL CLK32COUNT_REG: SLOW_COUNT (Bit 0) */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Msk                           (0x000001ffUL)  /*!< RADIO_CTRL CLK32COUNT_REG: SLOW_COUNT (Bitfield-Mask: 0x1ff) */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT                               RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Msk
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_0                             (0x01 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000001 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_1                             (0x02 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000002 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_2                             (0x04 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000004 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_3                             (0x08 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000008 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_4                             (0x10 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000010 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_5                             (0x20 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000020 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_6                             (0x40 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000040 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_7                             (0x80 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000080 */
#define RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_8                             (0x100 << RADIO_CTRL_CLK32COUNT_REG_SLOW_COUNT_Pos)   /*!<0x00000100 */

/* ===============================================   CLK32PERIOD_REG   =============================================== */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos                         (0UL)   /*!< RADIO_CTRL CLK32PERIOD_REG: SLOW_PERIOD (Bit 0) */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Msk                         (0x0007ffffUL)  /*!< RADIO_CTRL CLK32PERIOD_REG: SLOW_PERIOD (Bitfield-Mask: 0x7ffff) */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD                             RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Msk
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_0                           (0x0001 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000001 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_1                           (0x0002 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000002 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_2                           (0x0004 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000004 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_3                           (0x0008 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000008 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_4                           (0x0010 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000010 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_5                           (0x0020 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000020 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_6                           (0x0040 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000040 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_7                           (0x0080 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000080 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_8                           (0x0100 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000100 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_9                           (0x0200 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000200 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_10                          (0x0400 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000400 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_11                          (0x0800 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00000800 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_12                          (0x1000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00001000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_13                          (0x2000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00002000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_14                          (0x4000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00004000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_15                          (0x8000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00008000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_16                          (0x10000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00010000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_17                          (0x20000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00020000 */
#define RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_18                          (0x40000 << RADIO_CTRL_CLK32PERIOD_REG_SLOW_PERIOD_Pos)   /*!<0x00040000 */

