stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   AA0_DIG_USR   =============================================== */
#define RRM_AA0_DIG_USR_AA_7_0_Pos                                         (0UL)   /*!< RRM AA0_DIG_USR: AA_7_0 (Bit 0) */
#define RRM_AA0_DIG_USR_AA_7_0_Msk                                         (0x000000ffUL)  /*!< RRM AA0_DIG_USR: AA_7_0 (Bitfield-Mask: 0xff) */
#define RRM_AA0_DIG_USR_AA_7_0                                             RRM_AA0_DIG_USR_AA_7_0_Msk
#define RRM_AA0_DIG_USR_AA_7_0_0                                           (0x01 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000001 */
#define RRM_AA0_DIG_USR_AA_7_0_1                                           (0x02 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000002 */
#define RRM_AA0_DIG_USR_AA_7_0_2                                           (0x04 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000004 */
#define RRM_AA0_DIG_USR_AA_7_0_3                                           (0x08 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000008 */
#define RRM_AA0_DIG_USR_AA_7_0_4                                           (0x10 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000010 */
#define RRM_AA0_DIG_USR_AA_7_0_5                                           (0x20 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000020 */
#define RRM_AA0_DIG_USR_AA_7_0_6                                           (0x40 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000040 */
#define RRM_AA0_DIG_USR_AA_7_0_7                                           (0x80 << RRM_AA0_DIG_USR_AA_7_0_Pos)   /*!<0x00000080 */

/* ===============================================   AA1_DIG_USR   =============================================== */
#define RRM_AA1_DIG_USR_AA_15_8_Pos                                        (0UL)   /*!< RRM AA1_DIG_USR: AA_15_8 (Bit 0) */
#define RRM_AA1_DIG_USR_AA_15_8_Msk                                        (0x000000ffUL)  /*!< RRM AA1_DIG_USR: AA_15_8 (Bitfield-Mask: 0xff) */
#define RRM_AA1_DIG_USR_AA_15_8                                            RRM_AA1_DIG_USR_AA_15_8_Msk
#define RRM_AA1_DIG_USR_AA_15_8_0                                          (0x01 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000001 */
#define RRM_AA1_DIG_USR_AA_15_8_1                                          (0x02 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000002 */
#define RRM_AA1_DIG_USR_AA_15_8_2                                          (0x04 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000004 */
#define RRM_AA1_DIG_USR_AA_15_8_3                                          (0x08 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000008 */
#define RRM_AA1_DIG_USR_AA_15_8_4                                          (0x10 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000010 */
#define RRM_AA1_DIG_USR_AA_15_8_5                                          (0x20 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000020 */
#define RRM_AA1_DIG_USR_AA_15_8_6                                          (0x40 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000040 */
#define RRM_AA1_DIG_USR_AA_15_8_7                                          (0x80 << RRM_AA1_DIG_USR_AA_15_8_Pos)   /*!<0x00000080 */

/* ===============================================   AA2_DIG_USR   =============================================== */
#define RRM_AA2_DIG_USR_AA_23_16_Pos                                       (0UL)   /*!< RRM AA2_DIG_USR: AA_23_16 (Bit 0) */
#define RRM_AA2_DIG_USR_AA_23_16_Msk                                       (0x000000ffUL)  /*!< RRM AA2_DIG_USR: AA_23_16 (Bitfield-Mask: 0xff) */
#define RRM_AA2_DIG_USR_AA_23_16                                           RRM_AA2_DIG_USR_AA_23_16_Msk
#define RRM_AA2_DIG_USR_AA_23_16_0                                         (0x01 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000001 */
#define RRM_AA2_DIG_USR_AA_23_16_1                                         (0x02 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000002 */
#define RRM_AA2_DIG_USR_AA_23_16_2                                         (0x04 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000004 */
#define RRM_AA2_DIG_USR_AA_23_16_3                                         (0x08 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000008 */
#define RRM_AA2_DIG_USR_AA_23_16_4                                         (0x10 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000010 */
#define RRM_AA2_DIG_USR_AA_23_16_5                                         (0x20 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000020 */
#define RRM_AA2_DIG_USR_AA_23_16_6                                         (0x40 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000040 */
#define RRM_AA2_DIG_USR_AA_23_16_7                                         (0x80 << RRM_AA2_DIG_USR_AA_23_16_Pos)   /*!<0x00000080 */

/* ===============================================   AA3_DIG_USR   =============================================== */
#define RRM_AA3_DIG_USR_AA_31_24_Pos                                       (0UL)   /*!< RRM AA3_DIG_USR: AA_31_24 (Bit 0) */
#define RRM_AA3_DIG_USR_AA_31_24_Msk                                       (0x000000ffUL)  /*!< RRM AA3_DIG_USR: AA_31_24 (Bitfield-Mask: 0xff) */
#define RRM_AA3_DIG_USR_AA_31_24                                           RRM_AA3_DIG_USR_AA_31_24_Msk
#define RRM_AA3_DIG_USR_AA_31_24_0                                         (0x01 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000001 */
#define RRM_AA3_DIG_USR_AA_31_24_1                                         (0x02 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000002 */
#define RRM_AA3_DIG_USR_AA_31_24_2                                         (0x04 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000004 */
#define RRM_AA3_DIG_USR_AA_31_24_3                                         (0x08 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000008 */
#define RRM_AA3_DIG_USR_AA_31_24_4                                         (0x10 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000010 */
#define RRM_AA3_DIG_USR_AA_31_24_5                                         (0x20 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000020 */
#define RRM_AA3_DIG_USR_AA_31_24_6                                         (0x40 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000040 */
#define RRM_AA3_DIG_USR_AA_31_24_7                                         (0x80 << RRM_AA3_DIG_USR_AA_31_24_Pos)   /*!<0x00000080 */

/* ===============================================   DEM_MOD_DIG_USR   =============================================== */
#define RRM_DEM_MOD_DIG_USR_SPARE_Pos                                      (0UL)   /*!< RRM DEM_MOD_DIG_USR: SPARE (Bit 0) */
#define RRM_DEM_MOD_DIG_USR_SPARE_Msk                                      (0x00000001UL)  /*!< RRM DEM_MOD_DIG_USR: SPARE (Bitfield-Mask: 0x1) */
#define RRM_DEM_MOD_DIG_USR_SPARE                                          RRM_DEM_MOD_DIG_USR_SPARE_Msk
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos                                (1UL)   /*!< RRM DEM_MOD_DIG_USR: CHANNEL_NUM (Bit 1) */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Msk                                (0x000000feUL)  /*!< RRM DEM_MOD_DIG_USR: CHANNEL_NUM (Bitfield-Mask: 0x7f) */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM                                    RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Msk
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_0                                  (0x1 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000002 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_1                                  (0x2 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000004 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_2                                  (0x4 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000008 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_3                                  (0x8 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000010 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_4                                  (0x10 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000020 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_5                                  (0x20 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000040 */
#define RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_6                                  (0x40 << RRM_DEM_MOD_DIG_USR_CHANNEL_NUM_Pos)   /*!<0x00000080 */

/* ===============================================   RADIO_FSM_USR   =============================================== */
#define RRM_RADIO_FSM_USR_SPARE_Pos                                        (0UL)   /*!< RRM RADIO_FSM_USR: SPARE (Bit 0) */
#define RRM_RADIO_FSM_USR_SPARE_Msk                                        (0x00000001UL)  /*!< RRM RADIO_FSM_USR: SPARE (Bitfield-Mask: 0x1) */
#define RRM_RADIO_FSM_USR_SPARE                                            RRM_RADIO_FSM_USR_SPARE_Msk
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP_Pos                                 (1UL)   /*!< RRM RADIO_FSM_USR: EN_CALIB_CBP (Bit 1) */
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP_Msk                                 (0x00000002UL)  /*!< RRM RADIO_FSM_USR: EN_CALIB_CBP (Bitfield-Mask: 0x1) */
#define RRM_RADIO_FSM_USR_EN_CALIB_CBP                                     RRM_RADIO_FSM_USR_EN_CALIB_CBP_Msk
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Pos                               (2UL)   /*!< RRM RADIO_FSM_USR: EN_CALIB_SYNTH (Bit 2) */
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Msk                               (0x00000004UL)  /*!< RRM RADIO_FSM_USR: EN_CALIB_SYNTH (Bitfield-Mask: 0x1) */
#define RRM_RADIO_FSM_USR_EN_CALIB_SYNTH                                   RRM_RADIO_FSM_USR_EN_CALIB_SYNTH_Msk
#define RRM_RADIO_FSM_USR_PA_POWER_Pos                                     (3UL)   /*!< RRM RADIO_FSM_USR: PA_POWER (Bit 3) */
#define RRM_RADIO_FSM_USR_PA_POWER_Msk                                     (0x000000f8UL)  /*!< RRM RADIO_FSM_USR: PA_POWER (Bitfield-Mask: 0x1f) */
#define RRM_RADIO_FSM_USR_PA_POWER                                         RRM_RADIO_FSM_USR_PA_POWER_Msk
#define RRM_RADIO_FSM_USR_PA_POWER_0                                       (0x1 << RRM_RADIO_FSM_USR_PA_POWER_Pos)   /*!<0x00000008 */
#define RRM_RADIO_FSM_USR_PA_POWER_1                                       (0x2 << RRM_RADIO_FSM_USR_PA_POWER_Pos)   /*!<0x00000010 */
#define RRM_RADIO_FSM_USR_PA_POWER_2                                       (0x4 << RRM_RADIO_FSM_USR_PA_POWER_Pos)   /*!<0x00000020 */
#define RRM_RADIO_FSM_USR_PA_POWER_3                                       (0x8 << RRM_RADIO_FSM_USR_PA_POWER_Pos)   /*!<0x00000040 */
#define RRM_RADIO_FSM_USR_PA_POWER_4                                       (0x10 << RRM_RADIO_FSM_USR_PA_POWER_Pos)   /*!<0x00000080 */

