stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   LR_AAC_THR_DIG_ENG   =============================================== */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos                              (0UL)   /*!< RRM LR_AAC_THR_DIG_ENG: LR_AAC_THR (Bit 0) */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Msk                              (0x000000ffUL)  /*!< RRM LR_AAC_THR_DIG_ENG: LR_AAC_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR                                  RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Msk
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_0                                (0x01 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000001 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_1                                (0x02 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000002 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_2                                (0x04 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000004 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_3                                (0x08 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000008 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_4                                (0x10 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000010 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_5                                (0x20 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000020 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_6                                (0x40 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000040 */
#define RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_7                                (0x80 << RRM_LR_AAC_THR_DIG_ENG_LR_AAC_THR_Pos)   /*!<0x00000080 */

/* ===============================================   DTB0_DIG_ENG   =============================================== */
#define RRM_DTB0_DIG_ENG_DTB_EN_Pos                                        (0UL)   /*!< RRM DTB0_DIG_ENG: DTB_EN (Bit 0) */
#define RRM_DTB0_DIG_ENG_DTB_EN_Msk                                        (0x00000001UL)  /*!< RRM DTB0_DIG_ENG: DTB_EN (Bitfield-Mask: 0x1) */
#define RRM_DTB0_DIG_ENG_DTB_EN                                            RRM_DTB0_DIG_ENG_DTB_EN_Msk
#define RRM_DTB0_DIG_ENG_DTB_CFG_Pos                                       (1UL)   /*!< RRM DTB0_DIG_ENG: DTB_CFG (Bit 1) */
#define RRM_DTB0_DIG_ENG_DTB_CFG_Msk                                       (0x0000001eUL)  /*!< RRM DTB0_DIG_ENG: DTB_CFG (Bitfield-Mask: 0xf) */
#define RRM_DTB0_DIG_ENG_DTB_CFG                                           RRM_DTB0_DIG_ENG_DTB_CFG_Msk
#define RRM_DTB0_DIG_ENG_DTB_CFG_0                                         (0x1 << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)   /*!<0x00000002 */
#define RRM_DTB0_DIG_ENG_DTB_CFG_1                                         (0x2 << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)   /*!<0x00000004 */
#define RRM_DTB0_DIG_ENG_DTB_CFG_2                                         (0x4 << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)   /*!<0x00000008 */
#define RRM_DTB0_DIG_ENG_DTB_CFG_3                                         (0x8 << RRM_DTB0_DIG_ENG_DTB_CFG_Pos)   /*!<0x00000010 */
#define RRM_DTB0_DIG_ENG_SPARE_Pos                                         (5UL)   /*!< RRM DTB0_DIG_ENG: SPARE (Bit 5) */
#define RRM_DTB0_DIG_ENG_SPARE_Msk                                         (0x000000e0UL)  /*!< RRM DTB0_DIG_ENG: SPARE (Bitfield-Mask: 0x7) */
#define RRM_DTB0_DIG_ENG_SPARE                                             RRM_DTB0_DIG_ENG_SPARE_Msk


/* ===============================================   DTB5_DIG_ENG   =============================================== */
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL_Pos                                (0UL)   /*!< RRM DTB5_DIG_ENG: RXTX_START_SEL (Bit 0) */
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL_Msk                                (0x00000001UL)  /*!< RRM DTB5_DIG_ENG: RXTX_START_SEL (Bitfield-Mask: 0x1) */
#define RRM_DTB5_DIG_ENG_RXTX_START_SEL                                    RRM_DTB5_DIG_ENG_RXTX_START_SEL_Msk
#define RRM_DTB5_DIG_ENG_TX_ACTIVE_Pos                                     (1UL)   /*!< RRM DTB5_DIG_ENG: TX_ACTIVE (Bit 1) */
#define RRM_DTB5_DIG_ENG_TX_ACTIVE_Msk                                     (0x00000002UL)  /*!< RRM DTB5_DIG_ENG: TX_ACTIVE (Bitfield-Mask: 0x1) */
#define RRM_DTB5_DIG_ENG_TX_ACTIVE                                         RRM_DTB5_DIG_ENG_TX_ACTIVE_Msk
#define RRM_DTB5_DIG_ENG_RX_ACTIVE_Pos                                     (2UL)   /*!< RRM DTB5_DIG_ENG: RX_ACTIVE (Bit 2) */
#define RRM_DTB5_DIG_ENG_RX_ACTIVE_Msk                                     (0x00000004UL)  /*!< RRM DTB5_DIG_ENG: RX_ACTIVE (Bitfield-Mask: 0x1) */
#define RRM_DTB5_DIG_ENG_RX_ACTIVE                                         RRM_DTB5_DIG_ENG_RX_ACTIVE_Msk
#define RRM_DTB5_DIG_ENG_INITIALIZE_Pos                                    (3UL)   /*!< RRM DTB5_DIG_ENG: INITIALIZE (Bit 3) */
#define RRM_DTB5_DIG_ENG_INITIALIZE_Msk                                    (0x00000008UL)  /*!< RRM DTB5_DIG_ENG: INITIALIZE (Bitfield-Mask: 0x1) */
#define RRM_DTB5_DIG_ENG_INITIALIZE                                        RRM_DTB5_DIG_ENG_INITIALIZE_Msk
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Pos                              (4UL)   /*!< RRM DTB5_DIG_ENG: PORT_SELECTED_EN (Bit 4) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Msk                              (0x00000010UL)  /*!< RRM DTB5_DIG_ENG: PORT_SELECTED_EN (Bitfield-Mask: 0x1) */
#define RRM_DTB5_DIG_ENG_PORT_SELECTED_EN                                  RRM_DTB5_DIG_ENG_PORT_SELECTED_EN_Msk
#define RRM_DTB5_DIG_ENG_SPARE_Pos                                         (5UL)   /*!< RRM DTB5_DIG_ENG: SPARE (Bit 5) */
#define RRM_DTB5_DIG_ENG_SPARE_Msk                                         (0x000000e0UL)  /*!< RRM DTB5_DIG_ENG: SPARE (Bitfield-Mask: 0x7) */
#define RRM_DTB5_DIG_ENG_SPARE                                             RRM_DTB5_DIG_ENG_SPARE_Msk


/* ===============================================   MOD0_DIG_TST   =============================================== */
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Pos                              (0UL)   /*!< RRM MOD0_DIG_TST: MOD_DIG_TEST_SEL (Bit 0) */
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Msk                              (0x00000001UL)  /*!< RRM MOD0_DIG_TST: MOD_DIG_TEST_SEL (Bitfield-Mask: 0x1) */
#define RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL                                  RRM_MOD0_DIG_TST_MOD_DIG_TEST_SEL_Msk
#define RRM_MOD0_DIG_TST_SPARE_Pos                                         (1UL)   /*!< RRM MOD0_DIG_TST: SPARE (Bit 1) */
#define RRM_MOD0_DIG_TST_SPARE_Msk                                         (0x00000006UL)  /*!< RRM MOD0_DIG_TST: SPARE (Bitfield-Mask: 0x3) */
#define RRM_MOD0_DIG_TST_SPARE                                             RRM_MOD0_DIG_TST_SPARE_Msk
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Pos                            (3UL)   /*!< RRM MOD0_DIG_TST: PMU_NO_MODULTATION (Bit 3) */
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Msk                            (0x00000008UL)  /*!< RRM MOD0_DIG_TST: PMU_NO_MODULTATION (Bitfield-Mask: 0x1) */
#define RRM_MOD0_DIG_TST_PMU_NO_MODULTATION                                RRM_MOD0_DIG_TST_PMU_NO_MODULTATION_Msk
#define RRM_MOD0_DIG_TST_KFORCE_3_0_Pos                                    (4UL)   /*!< RRM MOD0_DIG_TST: KFORCE_3_0 (Bit 4) */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_Msk                                    (0x000000f0UL)  /*!< RRM MOD0_DIG_TST: KFORCE_3_0 (Bitfield-Mask: 0xf) */
#define RRM_MOD0_DIG_TST_KFORCE_3_0                                        RRM_MOD0_DIG_TST_KFORCE_3_0_Msk
#define RRM_MOD0_DIG_TST_KFORCE_3_0_0                                      (0x1 << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)   /*!<0x00000010 */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_1                                      (0x2 << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)   /*!<0x00000020 */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_2                                      (0x4 << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)   /*!<0x00000040 */
#define RRM_MOD0_DIG_TST_KFORCE_3_0_3                                      (0x8 << RRM_MOD0_DIG_TST_KFORCE_3_0_Pos)   /*!<0x00000080 */

/* ===============================================   MOD1_DIG_TST   =============================================== */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_Pos                                   (0UL)   /*!< RRM MOD1_DIG_TST: KFORCE_11_4 (Bit 0) */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_Msk                                   (0x000000ffUL)  /*!< RRM MOD1_DIG_TST: KFORCE_11_4 (Bitfield-Mask: 0xff) */
#define RRM_MOD1_DIG_TST_KFORCE_11_4                                       RRM_MOD1_DIG_TST_KFORCE_11_4_Msk
#define RRM_MOD1_DIG_TST_KFORCE_11_4_0                                     (0x01 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000001 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_1                                     (0x02 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000002 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_2                                     (0x04 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000004 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_3                                     (0x08 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000008 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_4                                     (0x10 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000010 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_5                                     (0x20 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000020 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_6                                     (0x40 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000040 */
#define RRM_MOD1_DIG_TST_KFORCE_11_4_7                                     (0x80 << RRM_MOD1_DIG_TST_KFORCE_11_4_Pos)   /*!<0x00000080 */

/* ===============================================   MOD2_DIG_TST   =============================================== */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_Pos                                  (0UL)   /*!< RRM MOD2_DIG_TST: KFORCE_19_12 (Bit 0) */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_Msk                                  (0x000000ffUL)  /*!< RRM MOD2_DIG_TST: KFORCE_19_12 (Bitfield-Mask: 0xff) */
#define RRM_MOD2_DIG_TST_KFORCE_19_12                                      RRM_MOD2_DIG_TST_KFORCE_19_12_Msk
#define RRM_MOD2_DIG_TST_KFORCE_19_12_0                                    (0x01 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000001 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_1                                    (0x02 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000002 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_2                                    (0x04 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000004 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_3                                    (0x08 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000008 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_4                                    (0x10 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000010 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_5                                    (0x20 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000020 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_6                                    (0x40 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000040 */
#define RRM_MOD2_DIG_TST_KFORCE_19_12_7                                    (0x80 << RRM_MOD2_DIG_TST_KFORCE_19_12_Pos)   /*!<0x00000080 */

/* ===============================================   MOD3_DIG_TST   =============================================== */
#define RRM_MOD3_DIG_TST_AFORCE_Pos                                        (0UL)   /*!< RRM MOD3_DIG_TST: AFORCE (Bit 0) */
#define RRM_MOD3_DIG_TST_AFORCE_Msk                                        (0x00000007UL)  /*!< RRM MOD3_DIG_TST: AFORCE (Bitfield-Mask: 0x7) */
#define RRM_MOD3_DIG_TST_AFORCE                                            RRM_MOD3_DIG_TST_AFORCE_Msk
#define RRM_MOD3_DIG_TST_AFORCE_0                                          (0x1 << RRM_MOD3_DIG_TST_AFORCE_Pos)   /*!<0x00000001 */
#define RRM_MOD3_DIG_TST_AFORCE_1                                          (0x2 << RRM_MOD3_DIG_TST_AFORCE_Pos)   /*!<0x00000002 */
#define RRM_MOD3_DIG_TST_AFORCE_2                                          (0x4 << RRM_MOD3_DIG_TST_AFORCE_Pos)   /*!<0x00000004 */
#define RRM_MOD3_DIG_TST_MFORCE_Pos                                        (3UL)   /*!< RRM MOD3_DIG_TST: MFORCE (Bit 3) */
#define RRM_MOD3_DIG_TST_MFORCE_Msk                                        (0x000000f8UL)  /*!< RRM MOD3_DIG_TST: MFORCE (Bitfield-Mask: 0x1f) */
#define RRM_MOD3_DIG_TST_MFORCE                                            RRM_MOD3_DIG_TST_MFORCE_Msk
#define RRM_MOD3_DIG_TST_MFORCE_0                                          (0x1 << RRM_MOD3_DIG_TST_MFORCE_Pos)   /*!<0x00000008 */
#define RRM_MOD3_DIG_TST_MFORCE_1                                          (0x2 << RRM_MOD3_DIG_TST_MFORCE_Pos)   /*!<0x00000010 */
#define RRM_MOD3_DIG_TST_MFORCE_2                                          (0x4 << RRM_MOD3_DIG_TST_MFORCE_Pos)   /*!<0x00000020 */
#define RRM_MOD3_DIG_TST_MFORCE_3                                          (0x8 << RRM_MOD3_DIG_TST_MFORCE_Pos)   /*!<0x00000040 */
#define RRM_MOD3_DIG_TST_MFORCE_4                                          (0x10 << RRM_MOD3_DIG_TST_MFORCE_Pos)   /*!<0x00000080 */


/* ===============================================   RXADC_ANA_USR   =============================================== */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos                        (0UL)   /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk                        (0x00000007UL)  /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x7) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_0                          (0x1 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)   /*!<0x00000001 */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_1                          (0x2 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)   /*!<0x00000002 */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_2                          (0x4 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_I_Pos)   /*!<0x00000004 */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos                        (3UL)   /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk                        (0x00000038UL)  /*!< RRM RXADC_ANA_USR: RFD_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x7) */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q                            RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_0                          (0x1 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)   /*!<0x00000008 */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_1                          (0x2 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)   /*!<0x00000010 */
#define RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_2                          (0x4 << RRM_RXADC_ANA_USR_RFD_RXADC_DELAYTRIM_Q_Pos)   /*!<0x00000020 */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Pos                    (6UL)   /*!< RRM RXADC_ANA_USR: RXADC_DELAYTRIM_I_TST_SEL (Bit 6) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Msk                    (0x00000040UL)  /*!< RRM RXADC_ANA_USR: RXADC_DELAYTRIM_I_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL                        RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_I_TST_SEL_Msk
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Pos                    (7UL)   /*!< RRM RXADC_ANA_USR: RXADC_DELAYTRIM_Q_TST_SEL (Bit 7) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Msk                    (0x00000080UL)  /*!< RRM RXADC_ANA_USR: SPARE (Bitfield-Mask: 0x1) */
#define RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL                        RRM_RXADC_ANA_USR_RXADC_DELAYTRIM_Q_TST_SEL_Msk


/* ===============================================   LDO_ANA_ENG   =============================================== */
#define RRM_LDO_ANA_ENG_SPARE_0_Pos                                        (0UL)   /*!< RRM LDO_ANA_ENG: SPARE_0 (Bit 0) */
#define RRM_LDO_ANA_ENG_SPARE_0_Msk                                        (0x00000001UL)  /*!< RRM LDO_ANA_ENG: SPARE_0 (Bitfield-Mask: 0x1) */
#define RRM_LDO_ANA_ENG_SPARE_0                                            RRM_LDO_ANA_ENG_SPARE_0_Msk
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Pos                         (1UL)   /*!< RRM LDO_ANA_ENG: RFD_LDO_TRANSFO_BYPASS (Bit 1) */
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Msk                         (0x00000002UL)  /*!< RRM LDO_ANA_ENG: RFD_LDO_TRANSFO_BYPASS (Bitfield-Mask: 0x1) */
#define RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS                             RRM_LDO_ANA_ENG_RFD_LDO_TRANSFO_BYPASS_Msk
#define RRM_LDO_ANA_ENG_RFD_LDO_RXADC_BYPASS_Pos                           (2UL)   /*!< RRM LDO_ANA_ENG: RFD_LDO_RXADC_BYPASS (Bit 2) */
#define RRM_LDO_ANA_ENG_RFD_LDO_RXADC_BYPASS_Msk                           (0x00000004UL)  /*!< RRM LDO_ANA_ENG: RFD_LDO_RXADC_BYPASS (Bitfield-Mask: 0x1) */
#define RRM_LDO_ANA_ENG_RFD_LDO_RXADC_BYPASS                               RRM_LDO_ANA_ENG_RFD_LDO_RXADC_BYPASS_Msk
#define RRM_LDO_ANA_ENG_RFD_LDO_RX_TX_BYPASS_Pos                           (3UL)   /*!< RRM LDO_ANA_ENG: RFD_LDO_RX_TX_BYPASS (Bit 3) */
#define RRM_LDO_ANA_ENG_RFD_LDO_RX_TX_BYPASS_Msk                           (0x00000008UL)  /*!< RRM LDO_ANA_ENG: RFD_LDO_RX_TX_BYPASS (Bitfield-Mask: 0x1) */
#define RRM_LDO_ANA_ENG_RFD_LDO_RX_TX_BYPASS                               RRM_LDO_ANA_ENG_RFD_LDO_RX_TX_BYPASS_Msk
#define RRM_LDO_ANA_ENG_SPARE_1_Pos                                        (4UL)   /*!< RRM LDO_ANA_ENG: SPARE_1 (Bit 4) */
#define RRM_LDO_ANA_ENG_SPARE_1_Msk                                        (0x000000f0UL)  /*!< RRM LDO_ANA_ENG: SPARE_1 (Bitfield-Mask: 0xf) */
#define RRM_LDO_ANA_ENG_SPARE_1                                            RRM_LDO_ANA_ENG_SPARE_1_Msk


/* ===============================================   CBIAS0_ANA_ENG   =============================================== */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos                        (0UL)   /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk                        (0x0000000fUL)  /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0xf) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_0                          (0x1 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)   /*!<0x00000001 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_1                          (0x2 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)   /*!<0x00000002 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_2                          (0x4 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)   /*!<0x00000004 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_3                          (0x8 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IBIAS_TRIM_Pos)   /*!<0x00000008 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos                        (4UL)   /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk                        (0x000000f0UL)  /*!< RRM CBIAS0_ANA_ENG: RFD_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0xf) */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM                            RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_0                          (0x1 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)   /*!<0x00000010 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_1                          (0x2 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)   /*!<0x00000020 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_2                          (0x4 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)   /*!<0x00000040 */
#define RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_3                          (0x8 << RRM_CBIAS0_ANA_ENG_RFD_CBIAS_IPTAT_TRIM_Pos)   /*!<0x00000080 */

/* ===============================================   CBIAS1_ANA_ENG   =============================================== */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos                          (0UL)   /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bit 0) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk                          (0x0000000fUL)  /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_VBG_TRIM (Bitfield-Mask: 0xf) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM                              RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Msk
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_0                            (0x1 << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)   /*!<0x00000001 */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_1                            (0x2 << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)   /*!<0x00000002 */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_2                            (0x4 << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)   /*!<0x00000004 */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_3                            (0x8 << RRM_CBIAS1_ANA_ENG_RFD_CBIAS_VBG_TRIM_Pos)   /*!<0x00000008 */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Pos                      (4UL)   /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_ENA_ATB_CURR (Bit 4) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Msk                      (0x00000010UL)  /*!< RRM CBIAS1_ANA_ENG: RFD_CBIAS_ENA_ATB_CURR (Bitfield-Mask: 0x1) */
#define RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR                          RRM_CBIAS1_ANA_ENG_RFD_CBIAS_ENA_ATB_CURR_Msk
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Pos                        (5UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS_CURR2_PREBOOST (Bit 5) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Msk                        (0x00000020UL)  /*!< RRM CBIAS1_ANA_ENG: CBIAS_CURR2_PREBOOST (Bitfield-Mask: 0x1) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST                            RRM_CBIAS1_ANA_ENG_CBIAS_CURR2_PREBOOST_Msk
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Pos                      (6UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS_VBG_TRIM_TST_SEL (Bit 6) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Msk                      (0x00000040UL)  /*!< RRM CBIAS1_ANA_ENG: CBIAS_VBG_TRIM_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL                          RRM_CBIAS1_ANA_ENG_CBIAS_VBG_TRIM_TST_SEL_Msk
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Pos                         (7UL)   /*!< RRM CBIAS1_ANA_ENG: CBIAS0_TRIM_TST_SEL (Bit 7) */
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Msk                         (0x00000080UL)  /*!< RRM CBIAS1_ANA_ENG: CBIAS0_TRIM_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL                             RRM_CBIAS1_ANA_ENG_CBIAS0_TRIM_TST_SEL_Msk

