stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   CBIAS_ANA_TEST   =============================================== */
#define RRM_CBIAS_ANA_TEST_CBIAS_ANA_TST_SEL_Pos                           (0UL)   /*!< RRM CBIAS_ANA_TEST: CBIAS_ANA_TST_SEL (Bit 0) */
#define RRM_CBIAS_ANA_TEST_CBIAS_ANA_TST_SEL_Msk                           (0x00000001UL)  /*!< RRM CBIAS_ANA_TEST: CBIAS_ANA_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_CBIAS_ANA_TST_SEL                               RRM_CBIAS_ANA_TEST_CBIAS_ANA_TST_SEL_Msk
#define RRM_CBIAS_ANA_TEST_SPARE_0_Pos                                     (1UL)   /*!< RRM CBIAS_ANA_TEST: SPARE_0 (Bit 1) */
#define RRM_CBIAS_ANA_TEST_SPARE_0_Msk                                     (0x00000002UL)  /*!< RRM CBIAS_ANA_TEST: SPARE_0 (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_SPARE_0                                         RRM_CBIAS_ANA_TEST_SPARE_0_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_CORE_Pos                          (2UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_CORE (Bit 2) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_CORE_Msk                          (0x00000004UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_CORE (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_CORE                              RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_CORE_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_1_Pos                        (3UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_SEL_CURR_1 (Bit 3) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_1_Msk                        (0x00000008UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_SEL_CURR_1 (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_1                            RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_1_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_2_Pos                        (4UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_SEL_CURR_2 (Bit 4) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_2_Msk                        (0x00000010UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_SEL_CURR_2 (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_2                            RRM_CBIAS_ANA_TEST_RFD_CBIAS_SEL_CURR_2_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_NF_OFF_Pos                        (5UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_NF_OFF (Bit 5) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_NF_OFF_Msk                        (0x00000020UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_NF_OFF (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_NF_OFF                            RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_NF_OFF_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_BOOST_Pos                     (6UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_VBG_BOOST (Bit 6) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_BOOST_Msk                     (0x00000040UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_VBG_BOOST (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_BOOST                         RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_BOOST_Msk
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_Pos                           (7UL)   /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_VBG (Bit 7) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_Msk                           (0x00000080UL)  /*!< RRM CBIAS_ANA_TEST: RFD_CBIAS_ENA_VBG (Bitfield-Mask: 0x1) */
#define RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG                               RRM_CBIAS_ANA_TEST_RFD_CBIAS_ENA_VBG_Msk

/* ===============================================   SYNTHCAL0_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos                       (0UL)   /*!< RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bit 0) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk                       (0x0000007fUL)  /*!< RRM SYNTHCAL0_DIG_OUT: VCO_CALAMP_OUT_6_0 (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0                           RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Msk
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_0                         (0x1 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_1                         (0x2 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_2                         (0x4 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_3                         (0x8 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_4                         (0x10 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000010 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_5                         (0x20 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000020 */
#define RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_6                         (0x40 << RRM_SYNTHCAL0_DIG_OUT_VCO_CALAMP_OUT_6_0_Pos)   /*!<0x00000040 */
#define RRM_SYNTHCAL0_DIG_OUT_RESERVE_Pos                                  (7UL)   /*!< RRM SYNTHCAL0_DIG_OUT: RESERVE (Bit 7) */
#define RRM_SYNTHCAL0_DIG_OUT_RESERVE_Msk                                  (0x00000080UL)  /*!< RRM SYNTHCAL0_DIG_OUT: RESERVE (Bitfield-Mask: 0x1) */
#define RRM_SYNTHCAL0_DIG_OUT_RESERVE                                      RRM_SYNTHCAL0_DIG_OUT_RESERVE_Msk

/* ===============================================   SYNTHCAL1_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos                      (0UL)   /*!< RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bit 0) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk                      (0x0000000fUL)  /*!< RRM SYNTHCAL1_DIG_OUT: VCO_CALAMP_OUT_10_7 (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7                          RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Msk
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_0                        (0x1 << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_1                        (0x2 << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_2                        (0x4 << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_3                        (0x8 << RRM_SYNTHCAL1_DIG_OUT_VCO_CALAMP_OUT_10_7_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL1_DIG_OUT_SPARE_Pos                                    (4UL)   /*!< RRM SYNTHCAL1_DIG_OUT: SPARE (Bit 4) */
#define RRM_SYNTHCAL1_DIG_OUT_SPARE_Msk                                    (0x000000f0UL)  /*!< RRM SYNTHCAL1_DIG_OUT: SPARE (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL1_DIG_OUT_SPARE                                        RRM_SYNTHCAL1_DIG_OUT_SPARE_Msk

/* ===============================================   SYNTHCAL2_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos                          (0UL)   /*!< RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bit 0) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk                          (0x0000007fUL)  /*!< RRM SYNTHCAL2_DIG_OUT: VCO_CALFREQ_OUT (Bitfield-Mask: 0x7f) */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT                              RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Msk
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_0                            (0x1 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_1                            (0x2 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_2                            (0x4 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_3                            (0x8 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_4                            (0x10 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000010 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_5                            (0x20 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000020 */
#define RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_6                            (0x40 << RRM_SYNTHCAL2_DIG_OUT_VCO_CALFREQ_OUT_Pos)   /*!<0x00000040 */
#define RRM_SYNTHCAL2_DIG_OUT_RESERVE_Pos                                  (7UL)   /*!< RRM SYNTHCAL2_DIG_OUT: RESERVE (Bit 7) */
#define RRM_SYNTHCAL2_DIG_OUT_RESERVE_Msk                                  (0x00000080UL)  /*!< RRM SYNTHCAL2_DIG_OUT: RESERVE (Bitfield-Mask: 0x1) */
#define RRM_SYNTHCAL2_DIG_OUT_RESERVE                                      RRM_SYNTHCAL2_DIG_OUT_RESERVE_Msk

/* ===============================================   SYNTHCAL3_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos                       (0UL)   /*!< RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bit 0) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk                       (0x0000000fUL)  /*!< RRM SYNTHCAL3_DIG_OUT: SYNTHCAL_DEBUG_BUS (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS                           RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Msk
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_0                         (0x1 << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_1                         (0x2 << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_2                         (0x4 << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_3                         (0x8 << RRM_SYNTHCAL3_DIG_OUT_SYNTHCAL_DEBUG_BUS_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_Pos                                  (4UL)   /*!< RRM SYNTHCAL3_DIG_OUT: RESERVE (Bit 4) */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_Msk                                  (0x000000f0UL)  /*!< RRM SYNTHCAL3_DIG_OUT: RESERVE (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE                                      RRM_SYNTHCAL3_DIG_OUT_RESERVE_Msk
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_0                                    (0x1 << RRM_SYNTHCAL3_DIG_OUT_RESERVE_Pos)   /*!<0x00000010 */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_1                                    (0x2 << RRM_SYNTHCAL3_DIG_OUT_RESERVE_Pos)   /*!<0x00000020 */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_2                                    (0x4 << RRM_SYNTHCAL3_DIG_OUT_RESERVE_Pos)   /*!<0x00000040 */
#define RRM_SYNTHCAL3_DIG_OUT_RESERVE_3                                    (0x8 << RRM_SYNTHCAL3_DIG_OUT_RESERVE_Pos)   /*!<0x00000080 */

