stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   SYNTHCAL4_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos                     (0UL)   /*!< RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bit 0) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk                     (0x0000003fUL)  /*!< RRM SYNTHCAL4_DIG_OUT: MOD_REF_DAC_WORD_OUT (Bitfield-Mask: 0x3f) */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT                         RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Msk
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_0                       (0x1 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_1                       (0x2 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_2                       (0x4 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_3                       (0x8 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_4                       (0x10 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000010 */
#define RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_5                       (0x20 << RRM_SYNTHCAL4_DIG_OUT_MOD_REF_DAC_WORD_OUT_Pos)   /*!<0x00000020 */
#define RRM_SYNTHCAL4_DIG_OUT_SPARE_Pos                                    (6UL)   /*!< RRM SYNTHCAL4_DIG_OUT: SPARE (Bit 6) */
#define RRM_SYNTHCAL4_DIG_OUT_SPARE_Msk                                    (0x000000c0UL)  /*!< RRM SYNTHCAL4_DIG_OUT: SPARE (Bitfield-Mask: 0x3) */
#define RRM_SYNTHCAL4_DIG_OUT_SPARE                                        RRM_SYNTHCAL4_DIG_OUT_SPARE_Msk

/* ===============================================   SYNTHCAL5_DIG_OUT   =============================================== */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos                           (0UL)   /*!< RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bit 0) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk                           (0x0000000fUL)  /*!< RRM SYNTHCAL5_DIG_OUT: CBP_CALIB_WORD (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD                               RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Msk
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_0                             (0x1 << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)   /*!<0x00000001 */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_1                             (0x2 << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)   /*!<0x00000002 */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_2                             (0x4 << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)   /*!<0x00000004 */
#define RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_3                             (0x8 << RRM_SYNTHCAL5_DIG_OUT_CBP_CALIB_WORD_Pos)   /*!<0x00000008 */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_Pos                                  (4UL)   /*!< RRM SYNTHCAL5_DIG_OUT: RESERVE (Bit 4) */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_Msk                                  (0x000000f0UL)  /*!< RRM SYNTHCAL5_DIG_OUT: RESERVE (Bitfield-Mask: 0xf) */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE                                      RRM_SYNTHCAL5_DIG_OUT_RESERVE_Msk
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_0                                    (0x1 << RRM_SYNTHCAL5_DIG_OUT_RESERVE_Pos)   /*!<0x00000010 */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_1                                    (0x2 << RRM_SYNTHCAL5_DIG_OUT_RESERVE_Pos)   /*!<0x00000020 */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_2                                    (0x4 << RRM_SYNTHCAL5_DIG_OUT_RESERVE_Pos)   /*!<0x00000040 */
#define RRM_SYNTHCAL5_DIG_OUT_RESERVE_3                                    (0x8 << RRM_SYNTHCAL5_DIG_OUT_RESERVE_Pos)   /*!<0x00000080 */

/* ===============================================   FSM_STATUS_DIG_OUT   =============================================== */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_Pos                                  (0UL)   /*!< RRM FSM_STATUS_DIG_OUT: STATUS (Bit 0) */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_Msk                                  (0x0000001fUL)  /*!< RRM FSM_STATUS_DIG_OUT: STATUS (Bitfield-Mask: 0x1f) */
#define RRM_FSM_STATUS_DIG_OUT_STATUS                                      RRM_FSM_STATUS_DIG_OUT_STATUS_Msk
#define RRM_FSM_STATUS_DIG_OUT_STATUS_0                                    (0x1 << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)   /*!<0x00000001 */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_1                                    (0x2 << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)   /*!<0x00000002 */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_2                                    (0x4 << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)   /*!<0x00000004 */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_3                                    (0x8 << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)   /*!<0x00000008 */
#define RRM_FSM_STATUS_DIG_OUT_STATUS_4                                    (0x10 << RRM_FSM_STATUS_DIG_OUT_STATUS_Pos)   /*!<0x00000010 */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Pos                         (7UL)   /*!< RRM FSM_STATUS_DIG_OUT: SYNTH_CAL_ERROR (Bit 7) */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Msk                         (0x00000080UL)  /*!< RRM FSM_STATUS_DIG_OUT: SYNTH_CAL_ERROR (Bitfield-Mask: 0x1) */
#define RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR                             RRM_FSM_STATUS_DIG_OUT_SYNTH_CAL_ERROR_Msk

/* ===============================================   IRQ_STATUS_DIG_OUT   =============================================== */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos                                 (0UL)   /*!< RRM IRQ_STATUS_DIG_OUT: RESERVE (Bit 0) */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_Msk                                 (0x000000ffUL)  /*!< RRM IRQ_STATUS_DIG_OUT: RESERVE (Bitfield-Mask: 0xff) */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE                                     RRM_IRQ_STATUS_DIG_OUT_RESERVE_Msk
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_0                                   (0x01 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000001 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_1                                   (0x02 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000002 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_2                                   (0x04 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000004 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_3                                   (0x08 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000008 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_4                                   (0x10 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000010 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_5                                   (0x20 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000020 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_6                                   (0x40 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000040 */
#define RRM_IRQ_STATUS_DIG_OUT_RESERVE_7                                   (0x80 << RRM_IRQ_STATUS_DIG_OUT_RESERVE_Pos)   /*!<0x00000080 */


/* ===============================================   RSSI0_DIG_OUT   =============================================== */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos                            (0UL)   /*!< RRM RSSI0_DIG_OUT: RSSI_MEAS_OUT_7_0 (Bit 0) */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Msk                            (0x000000ffUL)  /*!< RRM RSSI0_DIG_OUT: RSSI_MEAS_OUT_7_0 (Bitfield-Mask: 0xff) */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0                                RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Msk
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_0                              (0x01 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000001 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_1                              (0x02 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000002 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_2                              (0x04 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000004 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_3                              (0x08 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000008 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_4                              (0x10 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000010 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_5                              (0x20 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000020 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_6                              (0x40 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000040 */
#define RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_7                              (0x80 << RRM_RSSI0_DIG_OUT_RSSI_MEAS_OUT_7_0_Pos)   /*!<0x00000080 */

/* ===============================================   RSSI1_DIG_OUT   =============================================== */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos                           (0UL)   /*!< RRM RSSI1_DIG_OUT: RSSI_MEAS_OUT_15_8 (Bit 0) */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Msk                           (0x000000ffUL)  /*!< RRM RSSI1_DIG_OUT: RSSI_MEAS_OUT_15_8 (Bitfield-Mask: 0xff) */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8                               RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Msk
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_0                             (0x01 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000001 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_1                             (0x02 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000002 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_2                             (0x04 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000004 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_3                             (0x08 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000008 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_4                             (0x10 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000010 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_5                             (0x20 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000020 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_6                             (0x40 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000040 */
#define RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_7                             (0x80 << RRM_RSSI1_DIG_OUT_RSSI_MEAS_OUT_15_8_Pos)   /*!<0x00000080 */

