stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   AGC1_ANA_TST   =============================================== */
#define RRM_AGC1_ANA_TST_AGC1_ANA_TST_SEL_Pos                              (0UL)   /*!< RRM AGC1_ANA_TST: AGC1_ANA_TST_SEL (Bit 0) */
#define RRM_AGC1_ANA_TST_AGC1_ANA_TST_SEL_Msk                              (0x00000001UL)  /*!< RRM AGC1_ANA_TST: AGC1_ANA_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_AGC1_ANA_TST_AGC1_ANA_TST_SEL                                  RRM_AGC1_ANA_TST_AGC1_ANA_TST_SEL_Msk
#define RRM_AGC1_ANA_TST_AGC_IFATT_Pos                                     (1UL)   /*!< RRM AGC1_ANA_TST: AGC_IFATT (Bit 1) */
#define RRM_AGC1_ANA_TST_AGC_IFATT_Msk                                     (0x0000003eUL)  /*!< RRM AGC1_ANA_TST: AGC_IFATT (Bitfield-Mask: 0x1f) */
#define RRM_AGC1_ANA_TST_AGC_IFATT                                         RRM_AGC1_ANA_TST_AGC_IFATT_Msk
#define RRM_AGC1_ANA_TST_AGC_IFATT_0                                       (0x1 << RRM_AGC1_ANA_TST_AGC_IFATT_Pos)   /*!<0x00000002 */
#define RRM_AGC1_ANA_TST_AGC_IFATT_1                                       (0x2 << RRM_AGC1_ANA_TST_AGC_IFATT_Pos)   /*!<0x00000004 */
#define RRM_AGC1_ANA_TST_AGC_IFATT_2                                       (0x4 << RRM_AGC1_ANA_TST_AGC_IFATT_Pos)   /*!<0x00000008 */
#define RRM_AGC1_ANA_TST_AGC_IFATT_3                                       (0x8 << RRM_AGC1_ANA_TST_AGC_IFATT_Pos)   /*!<0x00000010 */
#define RRM_AGC1_ANA_TST_AGC_IFATT_4                                       (0x10 << RRM_AGC1_ANA_TST_AGC_IFATT_Pos)   /*!<0x00000020 */
#define RRM_AGC1_ANA_TST_SPARE_Pos                                         (6UL)   /*!< RRM AGC1_ANA_TST: SPARE (Bit 6) */
#define RRM_AGC1_ANA_TST_SPARE_Msk                                         (0x000000c0UL)  /*!< RRM AGC1_ANA_TST: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC1_ANA_TST_SPARE                                             RRM_AGC1_ANA_TST_SPARE_Msk

/* ===============================================   AGC2_ANA_TST   =============================================== */
#define RRM_AGC2_ANA_TST_AGC2_ANA_TST_SEL_Pos                              (0UL)   /*!< RRM AGC2_ANA_TST: AGC2_ANA_TST_SEL (Bit 0) */
#define RRM_AGC2_ANA_TST_AGC2_ANA_TST_SEL_Msk                              (0x00000001UL)  /*!< RRM AGC2_ANA_TST: AGC2_ANA_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_AGC2_ANA_TST_AGC2_ANA_TST_SEL                                  RRM_AGC2_ANA_TST_AGC2_ANA_TST_SEL_Msk
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Pos                         (1UL)   /*!< RRM AGC2_ANA_TST: AGC_ANTENNAE_USR_TRIM (Bit 1) */
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Msk                         (0x0000000eUL)  /*!< RRM AGC2_ANA_TST: AGC_ANTENNAE_USR_TRIM (Bitfield-Mask: 0x7) */
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM                             RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Msk
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_0                           (0x1 << RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Pos)   /*!<0x00000002 */
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_1                           (0x2 << RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Pos)   /*!<0x00000004 */
#define RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_2                           (0x4 << RRM_AGC2_ANA_TST_AGC_ANTENNAE_USR_TRIM_Pos)   /*!<0x00000008 */
#define RRM_AGC2_ANA_TST_SPARE_Pos                                         (4UL)   /*!< RRM AGC2_ANA_TST: SPARE (Bit 4) */
#define RRM_AGC2_ANA_TST_SPARE_Msk                                         (0x000000f0UL)  /*!< RRM AGC2_ANA_TST: SPARE (Bitfield-Mask: 0xf) */
#define RRM_AGC2_ANA_TST_SPARE                                             RRM_AGC2_ANA_TST_SPARE_Msk

/* ===============================================   AGC0_DIG_ENG   =============================================== */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos                                  (0UL)   /*!< RRM AGC0_DIG_ENG: AGC_THR_HIGH (Bit 0) */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Msk                                  (0x0000003fUL)  /*!< RRM AGC0_DIG_ENG: AGC_THR_HIGH (Bitfield-Mask: 0x3f) */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH                                      RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Msk
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_0                                    (0x1 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000001 */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_1                                    (0x2 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000002 */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_2                                    (0x4 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000004 */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_3                                    (0x8 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000008 */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_4                                    (0x10 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000010 */
#define RRM_AGC0_DIG_ENG_AGC_THR_HIGH_5                                    (0x20 << RRM_AGC0_DIG_ENG_AGC_THR_HIGH_Pos)   /*!<0x00000020 */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE_Pos                                    (6UL)   /*!< RRM AGC0_DIG_ENG: AGC_ENABLE (Bit 6) */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE_Msk                                    (0x00000040UL)  /*!< RRM AGC0_DIG_ENG: AGC_ENABLE (Bitfield-Mask: 0x1) */
#define RRM_AGC0_DIG_ENG_AGC_ENABLE                                        RRM_AGC0_DIG_ENG_AGC_ENABLE_Msk
#define RRM_AGC0_DIG_ENG_SPARE_Pos                                         (7UL)   /*!< RRM AGC0_DIG_ENG: SPARE (Bit 7) */
#define RRM_AGC0_DIG_ENG_SPARE_Msk                                         (0x00000080UL)  /*!< RRM AGC0_DIG_ENG: SPARE (Bitfield-Mask: 0x1) */
#define RRM_AGC0_DIG_ENG_SPARE                                             RRM_AGC0_DIG_ENG_SPARE_Msk

/* ===============================================   AGC1_DIG_ENG   =============================================== */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos                                 (0UL)   /*!< RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bit 0) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk                                 (0x0000003fUL)  /*!< RRM AGC1_DIG_ENG: AGC_THR_LOW_6 (Bitfield-Mask: 0x3f) */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6                                     RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Msk
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_0                                   (0x1 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000001 */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_1                                   (0x2 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000002 */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_2                                   (0x4 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000004 */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_3                                   (0x8 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000008 */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_4                                   (0x10 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000010 */
#define RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_5                                   (0x20 << RRM_AGC1_DIG_ENG_AGC_THR_LOW_6_Pos)   /*!<0x00000020 */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Pos                                  (6UL)   /*!< RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bit 6) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk                                  (0x00000040UL)  /*!< RRM AGC1_DIG_ENG: AGC_AUTOLOCK (Bitfield-Mask: 0x1) */
#define RRM_AGC1_DIG_ENG_AGC_AUTOLOCK                                      RRM_AGC1_DIG_ENG_AGC_AUTOLOCK_Msk
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Pos                                 (7UL)   /*!< RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bit 7) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk                                 (0x00000080UL)  /*!< RRM AGC1_DIG_ENG: AGC_LOCK_SYNC (Bitfield-Mask: 0x1) */
#define RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC                                     RRM_AGC1_DIG_ENG_AGC_LOCK_SYNC_Msk

/* ===============================================   AGC2_DIG_ENG   =============================================== */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos                                (0UL)   /*!< RRM AGC2_DIG_ENG: AGC_THR_LOW_12 (Bit 0) */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Msk                                (0x0000003fUL)  /*!< RRM AGC2_DIG_ENG: AGC_THR_LOW_12 (Bitfield-Mask: 0x3f) */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12                                    RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Msk
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_0                                  (0x1 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000001 */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_1                                  (0x2 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000002 */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_2                                  (0x4 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000004 */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_3                                  (0x8 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000008 */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_4                                  (0x10 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000010 */
#define RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_5                                  (0x20 << RRM_AGC2_DIG_ENG_AGC_THR_LOW_12_Pos)   /*!<0x00000020 */
#define RRM_AGC2_DIG_ENG_SPARE_Pos                                         (6UL)   /*!< RRM AGC2_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC2_DIG_ENG_SPARE_Msk                                         (0x000000c0UL)  /*!< RRM AGC2_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC2_DIG_ENG_SPARE                                             RRM_AGC2_DIG_ENG_SPARE_Msk

/* ===============================================   AGC3_DIG_ENG   =============================================== */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos                                  (0UL)   /*!< RRM AGC3_DIG_ENG: AUTOLOCK_THR (Bit 0) */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Msk                                  (0x0000003fUL)  /*!< RRM AGC3_DIG_ENG: AUTOLOCK_THR (Bitfield-Mask: 0x3f) */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR                                      RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Msk
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_0                                    (0x1 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000001 */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_1                                    (0x2 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000002 */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_2                                    (0x4 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000004 */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_3                                    (0x8 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000008 */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_4                                    (0x10 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000010 */
#define RRM_AGC3_DIG_ENG_AUTOLOCK_THR_5                                    (0x20 << RRM_AGC3_DIG_ENG_AUTOLOCK_THR_Pos)   /*!<0x00000020 */
#define RRM_AGC3_DIG_ENG_SPARE_Pos                                         (6UL)   /*!< RRM AGC3_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC3_DIG_ENG_SPARE_Msk                                         (0x000000c0UL)  /*!< RRM AGC3_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC3_DIG_ENG_SPARE                                             RRM_AGC3_DIG_ENG_SPARE_Msk

/* ===============================================   AGC4_DIG_ENG   =============================================== */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos                            (0UL)   /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_FAST (Bit 0) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Msk                            (0x0000000fUL)  /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_FAST (Bitfield-Mask: 0xf) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST                                RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Msk
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_0                              (0x1 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)   /*!<0x00000001 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_1                              (0x2 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)   /*!<0x00000002 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_2                              (0x4 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)   /*!<0x00000004 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_3                              (0x8 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_FAST_Pos)   /*!<0x00000008 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos                            (4UL)   /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_SLOW (Bit 4) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Msk                            (0x000000f0UL)  /*!< RRM AGC4_DIG_ENG: AGC_HOLD_TIME_SLOW (Bitfield-Mask: 0xf) */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW                                RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Msk
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_0                              (0x1 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)   /*!<0x00000010 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_1                              (0x2 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)   /*!<0x00000020 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_2                              (0x4 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)   /*!<0x00000040 */
#define RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_3                              (0x8 << RRM_AGC4_DIG_ENG_AGC_HOLD_TIME_SLOW_Pos)   /*!<0x00000080 */

/* ===============================================   AGC5_DIG_ENG   =============================================== */
#define RRM_AGC5_DIG_ENG_T_MEAS_Pos                                        (0UL)   /*!< RRM AGC5_DIG_ENG: T_MEAS (Bit 0) */
#define RRM_AGC5_DIG_ENG_T_MEAS_Msk                                        (0x0000000fUL)  /*!< RRM AGC5_DIG_ENG: T_MEAS (Bitfield-Mask: 0xf) */
#define RRM_AGC5_DIG_ENG_T_MEAS                                            RRM_AGC5_DIG_ENG_T_MEAS_Msk
#define RRM_AGC5_DIG_ENG_T_MEAS_0                                          (0x1 << RRM_AGC5_DIG_ENG_T_MEAS_Pos)   /*!<0x00000001 */
#define RRM_AGC5_DIG_ENG_T_MEAS_1                                          (0x2 << RRM_AGC5_DIG_ENG_T_MEAS_Pos)   /*!<0x00000002 */
#define RRM_AGC5_DIG_ENG_T_MEAS_2                                          (0x4 << RRM_AGC5_DIG_ENG_T_MEAS_Pos)   /*!<0x00000004 */
#define RRM_AGC5_DIG_ENG_T_MEAS_3                                          (0x8 << RRM_AGC5_DIG_ENG_T_MEAS_Pos)   /*!<0x00000008 */
#define RRM_AGC5_DIG_ENG_T_INT_Pos                                         (4UL)   /*!< RRM AGC5_DIG_ENG: T_INT (Bit 4) */
#define RRM_AGC5_DIG_ENG_T_INT_Msk                                         (0x000000f0UL)  /*!< RRM AGC5_DIG_ENG: T_INT (Bitfield-Mask: 0xf) */
#define RRM_AGC5_DIG_ENG_T_INT                                             RRM_AGC5_DIG_ENG_T_INT_Msk
#define RRM_AGC5_DIG_ENG_T_INT_0                                           (0x1 << RRM_AGC5_DIG_ENG_T_INT_Pos)   /*!<0x00000010 */
#define RRM_AGC5_DIG_ENG_T_INT_1                                           (0x2 << RRM_AGC5_DIG_ENG_T_INT_Pos)   /*!<0x00000020 */
#define RRM_AGC5_DIG_ENG_T_INT_2                                           (0x4 << RRM_AGC5_DIG_ENG_T_INT_Pos)   /*!<0x00000040 */
#define RRM_AGC5_DIG_ENG_T_INT_3                                           (0x8 << RRM_AGC5_DIG_ENG_T_INT_Pos)   /*!<0x00000080 */

