stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   AGC6_DIG_ENG   =============================================== */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos                            (0UL)   /*!< RRM AGC6_DIG_ENG: HOLD_TIME_SEL_10_4 (Bit 0) */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Msk                            (0x0000007fUL)  /*!< RRM AGC6_DIG_ENG: HOLD_TIME_SEL_10_4 (Bitfield-Mask: 0x7f) */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4                                RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Msk
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_0                              (0x1 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000001 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_1                              (0x2 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000002 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_2                              (0x4 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000004 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_3                              (0x8 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000008 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_4                              (0x10 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000010 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_5                              (0x20 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000020 */
#define RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_6                              (0x40 << RRM_AGC6_DIG_ENG_HOLD_TIME_SEL_10_4_Pos)   /*!<0x00000040 */
#define RRM_AGC6_DIG_ENG_SPARE_Pos                                         (7UL)   /*!< RRM AGC6_DIG_ENG: SPARE (Bit 7) */
#define RRM_AGC6_DIG_ENG_SPARE_Msk                                         (0x00000080UL)  /*!< RRM AGC6_DIG_ENG: SPARE (Bitfield-Mask: 0x1) */
#define RRM_AGC6_DIG_ENG_SPARE                                             RRM_AGC6_DIG_ENG_SPARE_Msk

/* ===============================================   AGC7_DIG_ENG   =============================================== */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos                               (0UL)   /*!< RRM AGC7_DIG_ENG: TH_LOW_SEL_10_4 (Bit 0) */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Msk                               (0x0000007fUL)  /*!< RRM AGC7_DIG_ENG: TH_LOW_SEL_10_4 (Bitfield-Mask: 0x7f) */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4                                   RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Msk
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_0                                 (0x1 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000001 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_1                                 (0x2 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000002 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_2                                 (0x4 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000004 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_3                                 (0x8 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000008 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_4                                 (0x10 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000010 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_5                                 (0x20 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000020 */
#define RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_6                                 (0x40 << RRM_AGC7_DIG_ENG_TH_LOW_SEL_10_4_Pos)   /*!<0x00000040 */
#define RRM_AGC7_DIG_ENG_SPARE_Pos                                         (7UL)   /*!< RRM AGC7_DIG_ENG: SPARE (Bit 7) */
#define RRM_AGC7_DIG_ENG_SPARE_Msk                                         (0x00000080UL)  /*!< RRM AGC7_DIG_ENG: SPARE (Bitfield-Mask: 0x1) */
#define RRM_AGC7_DIG_ENG_SPARE                                             RRM_AGC7_DIG_ENG_SPARE_Msk

/* ===============================================   AGC8_DIG_ENG   =============================================== */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos                             (0UL)   /*!< RRM AGC8_DIG_ENG: HOLD_TIME_SEL_3_0 (Bit 0) */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Msk                             (0x0000000fUL)  /*!< RRM AGC8_DIG_ENG: HOLD_TIME_SEL_3_0 (Bitfield-Mask: 0xf) */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0                                 RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Msk
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_0                               (0x1 << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)   /*!<0x00000001 */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_1                               (0x2 << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)   /*!<0x00000002 */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_2                               (0x4 << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)   /*!<0x00000004 */
#define RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_3                               (0x8 << RRM_AGC8_DIG_ENG_HOLD_TIME_SEL_3_0_Pos)   /*!<0x00000008 */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos                                (4UL)   /*!< RRM AGC8_DIG_ENG: TH_LOW_SEL_3_0 (Bit 4) */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Msk                                (0x000000f0UL)  /*!< RRM AGC8_DIG_ENG: TH_LOW_SEL_3_0 (Bitfield-Mask: 0xf) */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0                                    RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Msk
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_0                                  (0x1 << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)   /*!<0x00000010 */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_1                                  (0x2 << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)   /*!<0x00000020 */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_2                                  (0x4 << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)   /*!<0x00000040 */
#define RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_3                                  (0x8 << RRM_AGC8_DIG_ENG_TH_LOW_SEL_3_0_Pos)   /*!<0x00000080 */

/* ===============================================   AGC9_DIG_ENG   =============================================== */
#define RRM_AGC9_DIG_ENG_START_SEQ_Pos                                     (0UL)   /*!< RRM AGC9_DIG_ENG: START_SEQ (Bit 0) */
#define RRM_AGC9_DIG_ENG_START_SEQ_Msk                                     (0x0000000fUL)  /*!< RRM AGC9_DIG_ENG: START_SEQ (Bitfield-Mask: 0xf) */
#define RRM_AGC9_DIG_ENG_START_SEQ                                         RRM_AGC9_DIG_ENG_START_SEQ_Msk
#define RRM_AGC9_DIG_ENG_START_SEQ_0                                       (0x1 << RRM_AGC9_DIG_ENG_START_SEQ_Pos)   /*!<0x00000001 */
#define RRM_AGC9_DIG_ENG_START_SEQ_1                                       (0x2 << RRM_AGC9_DIG_ENG_START_SEQ_Pos)   /*!<0x00000002 */
#define RRM_AGC9_DIG_ENG_START_SEQ_2                                       (0x4 << RRM_AGC9_DIG_ENG_START_SEQ_Pos)   /*!<0x00000004 */
#define RRM_AGC9_DIG_ENG_START_SEQ_3                                       (0x8 << RRM_AGC9_DIG_ENG_START_SEQ_Pos)   /*!<0x00000008 */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_Pos                                       (4UL)   /*!< RRM AGC9_DIG_ENG: MAX_SEQ (Bit 4) */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_Msk                                       (0x000000f0UL)  /*!< RRM AGC9_DIG_ENG: MAX_SEQ (Bitfield-Mask: 0xf) */
#define RRM_AGC9_DIG_ENG_MAX_SEQ                                           RRM_AGC9_DIG_ENG_MAX_SEQ_Msk
#define RRM_AGC9_DIG_ENG_MAX_SEQ_0                                         (0x1 << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)   /*!<0x00000010 */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_1                                         (0x2 << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)   /*!<0x00000020 */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_2                                         (0x4 << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)   /*!<0x00000040 */
#define RRM_AGC9_DIG_ENG_MAX_SEQ_3                                         (0x8 << RRM_AGC9_DIG_ENG_MAX_SEQ_Pos)   /*!<0x00000080 */

/* ===============================================   AGC10_DIG_ENG   =============================================== */
#define RRM_AGC10_DIG_ENG_ATT_0_Pos                                        (0UL)   /*!< RRM AGC10_DIG_ENG: ATT_0 (Bit 0) */
#define RRM_AGC10_DIG_ENG_ATT_0_Msk                                        (0x0000003fUL)  /*!< RRM AGC10_DIG_ENG: ATT_0 (Bitfield-Mask: 0x3f) */
#define RRM_AGC10_DIG_ENG_ATT_0                                            RRM_AGC10_DIG_ENG_ATT_0_Msk
#define RRM_AGC10_DIG_ENG_ATT_0_0                                          (0x1 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000001 */
#define RRM_AGC10_DIG_ENG_ATT_0_1                                          (0x2 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000002 */
#define RRM_AGC10_DIG_ENG_ATT_0_2                                          (0x4 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000004 */
#define RRM_AGC10_DIG_ENG_ATT_0_3                                          (0x8 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000008 */
#define RRM_AGC10_DIG_ENG_ATT_0_4                                          (0x10 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000010 */
#define RRM_AGC10_DIG_ENG_ATT_0_5                                          (0x20 << RRM_AGC10_DIG_ENG_ATT_0_Pos)   /*!<0x00000020 */
#define RRM_AGC10_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC10_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC10_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC10_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC10_DIG_ENG_SPARE                                            RRM_AGC10_DIG_ENG_SPARE_Msk

/* ===============================================   AGC11_DIG_ENG   =============================================== */
#define RRM_AGC11_DIG_ENG_ATT_1_Pos                                        (0UL)   /*!< RRM AGC11_DIG_ENG: ATT_1 (Bit 0) */
#define RRM_AGC11_DIG_ENG_ATT_1_Msk                                        (0x0000003fUL)  /*!< RRM AGC11_DIG_ENG: ATT_1 (Bitfield-Mask: 0x3f) */
#define RRM_AGC11_DIG_ENG_ATT_1                                            RRM_AGC11_DIG_ENG_ATT_1_Msk
#define RRM_AGC11_DIG_ENG_ATT_1_0                                          (0x1 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000001 */
#define RRM_AGC11_DIG_ENG_ATT_1_1                                          (0x2 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000002 */
#define RRM_AGC11_DIG_ENG_ATT_1_2                                          (0x4 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000004 */
#define RRM_AGC11_DIG_ENG_ATT_1_3                                          (0x8 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000008 */
#define RRM_AGC11_DIG_ENG_ATT_1_4                                          (0x10 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000010 */
#define RRM_AGC11_DIG_ENG_ATT_1_5                                          (0x20 << RRM_AGC11_DIG_ENG_ATT_1_Pos)   /*!<0x00000020 */
#define RRM_AGC11_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC11_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC11_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC11_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC11_DIG_ENG_SPARE                                            RRM_AGC11_DIG_ENG_SPARE_Msk

/* ===============================================   AGC12_DIG_ENG   =============================================== */
#define RRM_AGC12_DIG_ENG_ATT_2_Pos                                        (0UL)   /*!< RRM AGC12_DIG_ENG: ATT_2 (Bit 0) */
#define RRM_AGC12_DIG_ENG_ATT_2_Msk                                        (0x0000003fUL)  /*!< RRM AGC12_DIG_ENG: ATT_2 (Bitfield-Mask: 0x3f) */
#define RRM_AGC12_DIG_ENG_ATT_2                                            RRM_AGC12_DIG_ENG_ATT_2_Msk
#define RRM_AGC12_DIG_ENG_ATT_2_0                                          (0x1 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000001 */
#define RRM_AGC12_DIG_ENG_ATT_2_1                                          (0x2 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000002 */
#define RRM_AGC12_DIG_ENG_ATT_2_2                                          (0x4 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000004 */
#define RRM_AGC12_DIG_ENG_ATT_2_3                                          (0x8 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000008 */
#define RRM_AGC12_DIG_ENG_ATT_2_4                                          (0x10 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000010 */
#define RRM_AGC12_DIG_ENG_ATT_2_5                                          (0x20 << RRM_AGC12_DIG_ENG_ATT_2_Pos)   /*!<0x00000020 */
#define RRM_AGC12_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC12_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC12_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC12_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC12_DIG_ENG_SPARE                                            RRM_AGC12_DIG_ENG_SPARE_Msk

/* ===============================================   AGC13_DIG_ENG   =============================================== */
#define RRM_AGC13_DIG_ENG_ATT_3_Pos                                        (0UL)   /*!< RRM AGC13_DIG_ENG: ATT_3 (Bit 0) */
#define RRM_AGC13_DIG_ENG_ATT_3_Msk                                        (0x0000003fUL)  /*!< RRM AGC13_DIG_ENG: ATT_3 (Bitfield-Mask: 0x3f) */
#define RRM_AGC13_DIG_ENG_ATT_3                                            RRM_AGC13_DIG_ENG_ATT_3_Msk
#define RRM_AGC13_DIG_ENG_ATT_3_0                                          (0x1 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000001 */
#define RRM_AGC13_DIG_ENG_ATT_3_1                                          (0x2 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000002 */
#define RRM_AGC13_DIG_ENG_ATT_3_2                                          (0x4 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000004 */
#define RRM_AGC13_DIG_ENG_ATT_3_3                                          (0x8 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000008 */
#define RRM_AGC13_DIG_ENG_ATT_3_4                                          (0x10 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000010 */
#define RRM_AGC13_DIG_ENG_ATT_3_5                                          (0x20 << RRM_AGC13_DIG_ENG_ATT_3_Pos)   /*!<0x00000020 */
#define RRM_AGC13_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC13_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC13_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC13_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC13_DIG_ENG_SPARE                                            RRM_AGC13_DIG_ENG_SPARE_Msk

