stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb07.h
/* ===============================================   AGC14_DIG_ENG   =============================================== */
#define RRM_AGC14_DIG_ENG_ATT_4_Pos                                        (0UL)   /*!< RRM AGC14_DIG_ENG: ATT_4 (Bit 0) */
#define RRM_AGC14_DIG_ENG_ATT_4_Msk                                        (0x0000003fUL)  /*!< RRM AGC14_DIG_ENG: ATT_4 (Bitfield-Mask: 0x3f) */
#define RRM_AGC14_DIG_ENG_ATT_4                                            RRM_AGC14_DIG_ENG_ATT_4_Msk
#define RRM_AGC14_DIG_ENG_ATT_4_0                                          (0x1 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000001 */
#define RRM_AGC14_DIG_ENG_ATT_4_1                                          (0x2 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000002 */
#define RRM_AGC14_DIG_ENG_ATT_4_2                                          (0x4 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000004 */
#define RRM_AGC14_DIG_ENG_ATT_4_3                                          (0x8 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000008 */
#define RRM_AGC14_DIG_ENG_ATT_4_4                                          (0x10 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000010 */
#define RRM_AGC14_DIG_ENG_ATT_4_5                                          (0x20 << RRM_AGC14_DIG_ENG_ATT_4_Pos)   /*!<0x00000020 */
#define RRM_AGC14_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC14_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC14_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC14_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC14_DIG_ENG_SPARE                                            RRM_AGC14_DIG_ENG_SPARE_Msk

/* ===============================================   AGC15_DIG_ENG   =============================================== */
#define RRM_AGC15_DIG_ENG_ATT_5_Pos                                        (0UL)   /*!< RRM AGC15_DIG_ENG: ATT_5 (Bit 0) */
#define RRM_AGC15_DIG_ENG_ATT_5_Msk                                        (0x0000003fUL)  /*!< RRM AGC15_DIG_ENG: ATT_5 (Bitfield-Mask: 0x3f) */
#define RRM_AGC15_DIG_ENG_ATT_5                                            RRM_AGC15_DIG_ENG_ATT_5_Msk
#define RRM_AGC15_DIG_ENG_ATT_5_0                                          (0x1 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000001 */
#define RRM_AGC15_DIG_ENG_ATT_5_1                                          (0x2 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000002 */
#define RRM_AGC15_DIG_ENG_ATT_5_2                                          (0x4 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000004 */
#define RRM_AGC15_DIG_ENG_ATT_5_3                                          (0x8 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000008 */
#define RRM_AGC15_DIG_ENG_ATT_5_4                                          (0x10 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000010 */
#define RRM_AGC15_DIG_ENG_ATT_5_5                                          (0x20 << RRM_AGC15_DIG_ENG_ATT_5_Pos)   /*!<0x00000020 */
#define RRM_AGC15_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC15_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC15_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC15_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC15_DIG_ENG_SPARE                                            RRM_AGC15_DIG_ENG_SPARE_Msk

/* ===============================================   AGC16_DIG_ENG   =============================================== */
#define RRM_AGC16_DIG_ENG_ATT_6_Pos                                        (0UL)   /*!< RRM AGC16_DIG_ENG: ATT_6 (Bit 0) */
#define RRM_AGC16_DIG_ENG_ATT_6_Msk                                        (0x0000003fUL)  /*!< RRM AGC16_DIG_ENG: ATT_6 (Bitfield-Mask: 0x3f) */
#define RRM_AGC16_DIG_ENG_ATT_6                                            RRM_AGC16_DIG_ENG_ATT_6_Msk
#define RRM_AGC16_DIG_ENG_ATT_6_0                                          (0x1 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000001 */
#define RRM_AGC16_DIG_ENG_ATT_6_1                                          (0x2 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000002 */
#define RRM_AGC16_DIG_ENG_ATT_6_2                                          (0x4 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000004 */
#define RRM_AGC16_DIG_ENG_ATT_6_3                                          (0x8 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000008 */
#define RRM_AGC16_DIG_ENG_ATT_6_4                                          (0x10 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000010 */
#define RRM_AGC16_DIG_ENG_ATT_6_5                                          (0x20 << RRM_AGC16_DIG_ENG_ATT_6_Pos)   /*!<0x00000020 */
#define RRM_AGC16_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC16_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC16_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC16_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC16_DIG_ENG_SPARE                                            RRM_AGC16_DIG_ENG_SPARE_Msk

/* ===============================================   AGC17_DIG_ENG   =============================================== */
#define RRM_AGC17_DIG_ENG_ATT_7_Pos                                        (0UL)   /*!< RRM AGC17_DIG_ENG: ATT_7 (Bit 0) */
#define RRM_AGC17_DIG_ENG_ATT_7_Msk                                        (0x0000003fUL)  /*!< RRM AGC17_DIG_ENG: ATT_7 (Bitfield-Mask: 0x3f) */
#define RRM_AGC17_DIG_ENG_ATT_7                                            RRM_AGC17_DIG_ENG_ATT_7_Msk
#define RRM_AGC17_DIG_ENG_ATT_7_0                                          (0x1 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000001 */
#define RRM_AGC17_DIG_ENG_ATT_7_1                                          (0x2 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000002 */
#define RRM_AGC17_DIG_ENG_ATT_7_2                                          (0x4 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000004 */
#define RRM_AGC17_DIG_ENG_ATT_7_3                                          (0x8 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000008 */
#define RRM_AGC17_DIG_ENG_ATT_7_4                                          (0x10 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000010 */
#define RRM_AGC17_DIG_ENG_ATT_7_5                                          (0x20 << RRM_AGC17_DIG_ENG_ATT_7_Pos)   /*!<0x00000020 */
#define RRM_AGC17_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC17_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC17_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC17_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC17_DIG_ENG_SPARE                                            RRM_AGC17_DIG_ENG_SPARE_Msk

